[Survived] StringLiteral
traces.js:51:23
   const BAD_COLOR     = '#D55E00';   // Okabe-Ito vermillion
   const BAD_SLOT_COLOR = '#c8c8c8';  // muted grey fill for bad-channel slot background (R=200, delta ≥ 50 vs BG)
   const AXIS_COLOR    = '#b5b8bd';   // --ink-3
-  const SLOT_COLOR  = '#e8e5dc';   // --line-2 — hairlines between channels
+  const SLOT_COLOR  = "";   // --line-2 — hairlines between channels
   const LABEL_COLOR = '#3a3d42';   // --ink-2
   const LABEL_FONT  = "10.5px 'IBM Plex Mono', ui-monospace, Menlo, monospace";

[Survived] StringLiteral
traces.js:54:23
   const SLOT_COLOR  = '#e8e5dc';   // --line-2 — hairlines between channels
   const LABEL_COLOR = '#3a3d42';   // --ink-2
   const LABEL_FONT  = "10.5px 'IBM Plex Mono', ui-monospace, Menlo, monospace";
-  const AXIS_FONT   = "9.5px 'IBM Plex Mono', ui-monospace, Menlo, monospace";
+  const AXIS_FONT   = "";
 
   // Channel-type suffix in the row label. Suppressed for EEG (the

[Survived] StringLiteral
traces.js:59:28
   // Channel-type suffix in the row label. Suppressed for EEG (the
   // dominant type — would just clutter every row) and shown for
   // EOG/ECG/EMG/RESP/MISC/etc. so non-EEG rows are scannable.
-  const TYPE_LABEL_COLOR = '#8b8e94';   // --muted in styles.css
+  const TYPE_LABEL_COLOR = "";   // --muted in styles.css
   const TYPE_LABEL_FONT  = "8.5px 'IBM Plex Mono', ui-monospace, Menlo, monospace";
 

[Killed] ArrayDeclaration
traces.js:73:11
   // case for almost every recording); the other types each get a
   // distinct rhythm.
   const TYPE_DASH = {
-    EEG:  [],
+    EEG:  ["Stryker was here"],
     EOG:  [5, 2],
     ECG:  [2, 2],
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.466042ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.071958ms)
  ✔ empty input is safe (0.047ms)
  ✔ single sample → mean=value, std=0 (0.047292ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.05575ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.052958ms)

[Killed] BlockStatement
traces.js:102:36
   // page draws into multiple short-lived canvases, switch to an
   // explicit dispose() call when the canvas leaves the DOM.
   const _canvasDims = new WeakMap();   // canvas → { dpr, cssW, cssH }
-  function deviceFitCanvas(canvas) {
-    let dims = _canvasDims.get(canvas);
-    if (!dims) {
-      dims = { dpr: 1, cssW: 0, cssH: 0 };
-      _canvasDims.set(canvas, dims);
-      if (typeof ResizeObserver !== 'undefined') {
-        const ro = new ResizeObserver(() => { dims.cssW = 0; dims.cssH = 0; });
-        ro.observe(canvas);
-      }
-    }
-    if (!dims.cssW || !dims.cssH) {
-      dims.dpr = window.devicePixelRatio || 1;
-      dims.cssW = canvas.clientWidth;
-      dims.cssH = canvas.clientHeight;
-    }
-    const w = Math.max(1, Math.round(dims.cssW * dims.dpr));
-    const h = Math.max(1, Math.round(dims.cssH * dims.dpr));
-    if (canvas.width !== w || canvas.height !== h) {
-      canvas.width = w;
-      canvas.height = h;
-    }
-    return dims;
-  }
+  function deviceFitCanvas(canvas) {}
 
   // meanStd cache keyed by channel-array reference identity. Trace data
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.467042ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.063042ms)
  ✔ empty input is safe (0.046875ms)
  ✔ single sample → mean=value, std=0 (0.047583ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.060541ms)

[Killed] BooleanLiteral
traces.js:104:9
   const _canvasDims = new WeakMap();   // canvas → { dpr, cssW, cssH }
   function deviceFitCanvas(canvas) {
     let dims = _canvasDims.get(canvas);
-    if (!dims) {
+    if (dims) {
       dims = { dpr: 1, cssW: 0, cssH: 0 };
       _canvasDims.set(canvas, dims);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.491375ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.064708ms)
  ✔ empty input is safe (0.063709ms)

  ✔ single sample → mean=value, std=0 (0.050375ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.061833ms)

[Killed] ConditionalExpression
traces.js:104:9
   const _canvasDims = new WeakMap();   // canvas → { dpr, cssW, cssH }
   function deviceFitCanvas(canvas) {
     let dims = _canvasDims.get(canvas);
-    if (!dims) {
+    if (false) {
       dims = { dpr: 1, cssW: 0, cssH: 0 };
       _canvasDims.set(canvas, dims);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.552958ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.066542ms)
  ✔ empty input is safe (0.048791ms)
  ✔ single sample → mean=value, std=0 (0.049125ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.0745ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.0565ms)

[Survived] ObjectLiteral
traces.js:105:14
   function deviceFitCanvas(canvas) {
     let dims = _canvasDims.get(canvas);
     if (!dims) {
-      dims = { dpr: 1, cssW: 0, cssH: 0 };
+      dims = {};
       _canvasDims.set(canvas, dims);
       if (typeof ResizeObserver !== 'undefined') {

[Survived] ConditionalExpression
traces.js:107:11
     if (!dims) {
       dims = { dpr: 1, cssW: 0, cssH: 0 };
       _canvasDims.set(canvas, dims);
-      if (typeof ResizeObserver !== 'undefined') {
+      if (true) {
         const ro = new ResizeObserver(() => { dims.cssW = 0; dims.cssH = 0; });
         ro.observe(canvas);

[Survived] BlockStatement
traces.js:107:50
     if (!dims) {
       dims = { dpr: 1, cssW: 0, cssH: 0 };
       _canvasDims.set(canvas, dims);
-      if (typeof ResizeObserver !== 'undefined') {
-        const ro = new ResizeObserver(() => { dims.cssW = 0; dims.cssH = 0; });
-        ro.observe(canvas);
-      }
+      if (typeof ResizeObserver !== 'undefined') {}
     }
     if (!dims.cssW || !dims.cssH) {

[Survived] BlockStatement
traces.js:108:45
       dims = { dpr: 1, cssW: 0, cssH: 0 };
       _canvasDims.set(canvas, dims);
       if (typeof ResizeObserver !== 'undefined') {
-        const ro = new ResizeObserver(() => { dims.cssW = 0; dims.cssH = 0; });
+        const ro = new ResizeObserver(() => {});
         ro.observe(canvas);
       }

[Killed] ConditionalExpression
traces.js:112:9
         ro.observe(canvas);
       }
     }
-    if (!dims.cssW || !dims.cssH) {
+    if (false) {
       dims.dpr = window.devicePixelRatio || 1;
       dims.cssW = canvas.clientWidth;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.470875ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.065584ms)
  ✔ empty input is safe (0.05275ms)
  ✔ single sample → mean=value, std=0 (0.065375ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.061583ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.060167ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] BlockStatement
traces.js:112:35
         ro.observe(canvas);
       }
     }
-    if (!dims.cssW || !dims.cssH) {
-      dims.dpr = window.devicePixelRatio || 1;
-      dims.cssW = canvas.clientWidth;
-      dims.cssH = canvas.clientHeight;
-    }
+    if (!dims.cssW || !dims.cssH) {}
     const w = Math.max(1, Math.round(dims.cssW * dims.dpr));
     const h = Math.max(1, Math.round(dims.cssH * dims.dpr));
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.498875ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.065208ms)
  ✔ empty input is safe (0.049958ms)
  ✔ single sample → mean=value, std=0 (0.048792ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.07125ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.054042ms)

[Killed] LogicalOperator
traces.js:113:18
       }
     }
     if (!dims.cssW || !dims.cssH) {
-      dims.dpr = window.devicePixelRatio || 1;
+      dims.dpr = window.devicePixelRatio && 1;
       dims.cssW = canvas.clientWidth;
       dims.cssH = canvas.clientHeight;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (4.538708ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.095666ms)
  ✔ empty input is safe (0.058042ms)
  ✔ single sample → mean=value, std=0 (0.056292ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.080916ms)

[Killed] ConditionalExpression
traces.js:113:18
       }
     }
     if (!dims.cssW || !dims.cssH) {
-      dims.dpr = window.devicePixelRatio || 1;
+      dims.dpr = false;
       dims.cssW = canvas.clientWidth;
       dims.cssH = canvas.clientHeight;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.4825ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.060917ms)
  ✔ empty input is safe (0.047959ms)
  ✔ single sample → mean=value, std=0 (0.048792ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.0675ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.055458ms)

[Killed] MethodExpression
traces.js:117:15
       dims.cssW = canvas.clientWidth;
       dims.cssH = canvas.clientHeight;
     }
-    const w = Math.max(1, Math.round(dims.cssW * dims.dpr));
+    const w = Math.min(1, Math.round(dims.cssW * dims.dpr));
     const h = Math.max(1, Math.round(dims.cssH * dims.dpr));
     if (canvas.width !== w || canvas.height !== h) {
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.500167ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.07075ms)
  ✔ empty input is safe (0.052042ms)
  ✔ single sample → mean=value, std=0 (0.051667ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.07425ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.058583ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce N

[Killed] ArithmeticOperator
traces.js:117:38
       dims.cssW = canvas.clientWidth;
       dims.cssH = canvas.clientHeight;
     }
-    const w = Math.max(1, Math.round(dims.cssW * dims.dpr));
+    const w = Math.max(1, Math.round(dims.cssW / dims.dpr));
     const h = Math.max(1, Math.round(dims.cssH * dims.dpr));
     if (canvas.width !== w || canvas.height !== h) {
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.490625ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.069667ms)
  ✔ empty input is safe (0.056ms)
  ✔ single sample → mean=value, std=0 (0.069666ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.064541ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.060834ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce Na

[Killed] ArithmeticOperator
traces.js:118:38
       dims.cssH = canvas.clientHeight;
     }
     const w = Math.max(1, Math.round(dims.cssW * dims.dpr));
-    const h = Math.max(1, Math.round(dims.cssH * dims.dpr));
+    const h = Math.max(1, Math.round(dims.cssH / dims.dpr));
     if (canvas.width !== w || canvas.height !== h) {
       canvas.width = w;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.477833ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.061625ms)
  ✔ empty input is safe (0.071042ms)
  ✔ single sample → mean=value, std=0 (0.048167ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.070583ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.059041ms)

[Killed] MethodExpression
traces.js:118:15
       dims.cssH = canvas.clientHeight;
     }
     const w = Math.max(1, Math.round(dims.cssW * dims.dpr));
-    const h = Math.max(1, Math.round(dims.cssH * dims.dpr));
+    const h = Math.min(1, Math.round(dims.cssH * dims.dpr));
     if (canvas.width !== w || canvas.height !== h) {
       canvas.width = w;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.48525ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.065625ms)
  ✔ empty input is safe (0.047791ms)
  ✔ single sample → mean=value, std=0 (0.051875ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.867875ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.088875ms)

[Killed] BlockStatement
traces.js:119:52
     }
     const w = Math.max(1, Math.round(dims.cssW * dims.dpr));
     const h = Math.max(1, Math.round(dims.cssH * dims.dpr));
-    if (canvas.width !== w || canvas.height !== h) {
-      canvas.width = w;
-      canvas.height = h;
-    }
+    if (canvas.width !== w || canvas.height !== h) {}
     return dims;
   }
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.4715ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.064625ms)
  ✔ empty input is safe (0.049959ms)
  ✔ single sample → mean=value, std=0 (0.061ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.057125ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.055334ms)

[Killed] ConditionalExpression
traces.js:119:9
     }
     const w = Math.max(1, Math.round(dims.cssW * dims.dpr));
     const h = Math.max(1, Math.round(dims.cssH * dims.dpr));
-    if (canvas.width !== w || canvas.height !== h) {
+    if (false) {
       canvas.width = w;
       canvas.height = h;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.464083ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.061416ms)
  ✔ empty input is safe (0.048958ms)
  ✔ single sample → mean=value, std=0 (0.050292ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.057708ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.080375ms)

[Killed] BlockStatement
traces.js:130:29
   // is immutable per pan (readWindow returns fresh subarrays); a draw
   // that's only changing gain reuses the previous stats free.
   const _statsCache = new WeakMap();   // Float32Array → { mean, std, n }
-  function meanStd(data, n) {
-    if (n <= 0) return { mean: 0, std: 0 };
-    const cached = _statsCache.get(data);
-    if (cached && cached.n === n) return cached;
-    let s = 0, ss = 0;
-    for (let i = 0; i < n; i++) { s += data[i]; ss += data[i] * data[i]; }
-    const mean = s / n;
-    const variance = Math.max(0, ss / n - mean * mean);
-    const out = { mean, std: Math.sqrt(variance), n };
-    _statsCache.set(data, out);
-    return out;
-  }
+  function meanStd(data, n) {}
 
   // When `transparent` is true, leave the canvas pixel buffer fully
killedBy: All tests
statusReason: ▶ meanStd
  ✖ constant series → mean=value, std=0 (0.502834ms)
  ✖ ±1 alternating → mean≈0, std≈1 (0.05425ms)

  ✖ empty input is safe (0.044458ms)
  ✖ single sample → mean=value, std=0 (0.047041ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.095ms)
  ✖ mixed NaN/finite: n covers only finite-prefix in array (0.046292ms)

[Killed] ConditionalExpression
traces.js:131:9
   // that's only changing gain reuses the previous stats free.
   const _statsCache = new WeakMap();   // Float32Array → { mean, std, n }
   function meanStd(data, n) {
-    if (n <= 0) return { mean: 0, std: 0 };
+    if (false) return { mean: 0, std: 0 };
     const cached = _statsCache.get(data);
     if (cached && cached.n === n) return cached;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.47475ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.062625ms)
  ✖ empty input is safe (0.58225ms)
  ✔ single sample → mean=value, std=0 (0.065416ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.0575ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.055917ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce NaN

[Killed] EqualityOperator
traces.js:131:9
   // that's only changing gain reuses the previous stats free.
   const _statsCache = new WeakMap();   // Float32Array → { mean, std, n }
   function meanStd(data, n) {
-    if (n <= 0) return { mean: 0, std: 0 };
+    if (n < 0) return { mean: 0, std: 0 };
     const cached = _statsCache.get(data);
     if (cached && cached.n === n) return cached;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.517084ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.065958ms)
  ✖ empty input is safe (0.617958ms)
  ✔ single sample → mean=value, std=0 (0.073542ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.0605ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.057958ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce N

[Killed] LogicalOperator
traces.js:133:9
   function meanStd(data, n) {
     if (n <= 0) return { mean: 0, std: 0 };
     const cached = _statsCache.get(data);
-    if (cached && cached.n === n) return cached;
+    if (cached || cached.n === n) return cached;
     let s = 0, ss = 0;
     for (let i = 0; i < n; i++) { s += data[i]; ss += data[i] * data[i]; }
killedBy: All tests
statusReason: ▶ meanStd
  ✖ constant series → mean=value, std=0 (0.525042ms)
  ✖ ±1 alternating → mean≈0, std≈1 (0.083209ms)

  ✔ empty input is safe (0.072334ms)
  ✖ single sample → mean=value, std=0 (0.090208ms)
  ✖ all-NaN input propagates NaN cleanly (does not throw) (0.327041ms)
  ✖ mixed NaN/finite: n covers only finite-prefix in array (0.071792ms)

[Killed] ConditionalExpression
traces.js:133:9
   function meanStd(data, n) {
     if (n <= 0) return { mean: 0, std: 0 };
     const cached = _statsCache.get(data);
-    if (cached && cached.n === n) return cached;
+    if (true) return cached;
     let s = 0, ss = 0;
     for (let i = 0; i < n; i++) { s += data[i]; ss += data[i] * data[i]; }
killedBy: All tests
statusReason: ▶ meanStd
  ✖ constant series → mean=value, std=0 (0.51375ms)
  ✖ ±1 alternating → mean≈0, std≈1 (0.057167ms)
  ✔ empty input is safe (0.072042ms)

  ✖ single sample → mean=value, std=0 (0.0515ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.072209ms)
  ✖ mixed NaN/finite: n covers only finite-prefix in array (0.05275ms)

[Killed] AssignmentOperator
traces.js:135:35
     const cached = _statsCache.get(data);
     if (cached && cached.n === n) return cached;
     let s = 0, ss = 0;
-    for (let i = 0; i < n; i++) { s += data[i]; ss += data[i] * data[i]; }
+    for (let i = 0; i < n; i++) { s -= data[i]; ss += data[i] * data[i]; }
     const mean = s / n;
     const variance = Math.max(0, ss / n - mean * mean);
killedBy: All tests
statusReason: ▶ meanStd
  ✖ constant series → mean=value, std=0 (0.958125ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.090834ms)
  ✔ empty input is safe (0.0465ms)
  ✖ single sample → mean=value, std=0 (4.21075ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.068458ms)
  ✖ mixed NaN/finite: n covers only finite-prefix in array (0.074875ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce Na

[Killed] EqualityOperator
traces.js:135:21
     const cached = _statsCache.get(data);
     if (cached && cached.n === n) return cached;
     let s = 0, ss = 0;
-    for (let i = 0; i < n; i++) { s += data[i]; ss += data[i] * data[i]; }
+    for (let i = 0; i >= n; i++) { s += data[i]; ss += data[i] * data[i]; }
     const mean = s / n;
     const variance = Math.max(0, ss / n - mean * mean);
killedBy: All tests
statusReason: ▶ meanStd
  ✖ constant series → mean=value, std=0 (1.003625ms)
  ✖ ±1 alternating → mean≈0, std≈1 (10.713ms)
  ✔ empty input is safe (0.088416ms)
  ✖ single sample → mean=value, std=0 (0.179667ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.055541ms)
  ✖ mixed NaN/finite: n covers only finite-prefix in array (0.070708ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce N

[Killed] ArithmeticOperator
traces.js:136:18
     if (cached && cached.n === n) return cached;
     let s = 0, ss = 0;
     for (let i = 0; i < n; i++) { s += data[i]; ss += data[i] * data[i]; }
-    const mean = s / n;
+    const mean = s * n;
     const variance = Math.max(0, ss / n - mean * mean);
     const out = { mean, std: Math.sqrt(variance), n };
killedBy: All tests
statusReason: ▶ meanStd
  ✖ constant series → mean=value, std=0 (0.985625ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.101792ms)
  ✔ empty input is safe (0.048208ms)

  ✔ single sample → mean=value, std=0 (0.049833ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.058333ms)
  ✖ mixed NaN/finite: n covers only finite-prefix in array (0.076084ms)

[Killed] ArithmeticOperator
traces.js:137:34
     let s = 0, ss = 0;
     for (let i = 0; i < n; i++) { s += data[i]; ss += data[i] * data[i]; }
     const mean = s / n;
-    const variance = Math.max(0, ss / n - mean * mean);
+    const variance = Math.max(0, ss * n - mean * mean);
     const out = { mean, std: Math.sqrt(variance), n };
     _statsCache.set(data, out);
killedBy: All tests
statusReason: ▶ meanStd
  ✖ constant series → mean=value, std=0 (7.558166ms)
  ✖ ±1 alternating → mean≈0, std≈1 (0.664208ms)
  ✔ empty input is safe (0.105542ms)
  ✔ single sample → mean=value, std=0 (0.065084ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.065667ms)
  ✖ mixed NaN/finite: n covers only finite-prefix in array (0.09625ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] ArithmeticOperator
traces.js:137:34
     let s = 0, ss = 0;
     for (let i = 0; i < n; i++) { s += data[i]; ss += data[i] * data[i]; }
     const mean = s / n;
-    const variance = Math.max(0, ss / n - mean * mean);
+    const variance = Math.max(0, ss / n + mean * mean);
     const out = { mean, std: Math.sqrt(variance), n };
     _statsCache.set(data, out);
killedBy: All tests
statusReason: ▶ meanStd
  ✖ constant series → mean=value, std=0 (9.684667ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.086417ms)
  ✔ empty input is safe (0.049ms)
  ✖ single sample → mean=value, std=0 (0.071958ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.056208ms)
  ✖ mixed NaN/finite: n covers only finite-prefix in array (0.062833ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce Na

[Killed] ObjectLiteral
traces.js:138:17
     for (let i = 0; i < n; i++) { s += data[i]; ss += data[i] * data[i]; }
     const mean = s / n;
     const variance = Math.max(0, ss / n - mean * mean);
-    const out = { mean, std: Math.sqrt(variance), n };
+    const out = {};
     _statsCache.set(data, out);
     return out;
killedBy: All tests
statusReason: ▶ meanStd
  ✖ constant series → mean=value, std=0 (0.958291ms)
  ✖ ±1 alternating → mean≈0, std≈1 (4.309333ms)
  ✔ empty input is safe (0.107333ms)
  ✖ single sample → mean=value, std=0 (0.225916ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.069166ms)
  ✖ mixed NaN/finite: n covers only finite-prefix in array (0.086ms)
  ✖ extreme dynamic range (1e-10 to 1e10) does not produce Na

[Killed] BlockStatement
traces.js:147:42
   // alpha-zero so the host page (or surrounding stage CSS in embed
   // mode) bleeds through. Otherwise paint the cream paper BG that
   // matches the rest of the instrument.
-  function clear(ctx, w, h, transparent) {
-    ctx.clearRect(0, 0, w, h);
-    if (!transparent) {
-      ctx.fillStyle = BG_COLOR;
-      ctx.fillRect(0, 0, w, h);
-    }
-  }
+  function clear(ctx, w, h, transparent) {}
 
   // Hairline divider between each channel slot. Subtle enough not to
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.481792ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.067916ms)
  ✔ empty input is safe (0.053167ms)
  ✔ single sample → mean=value, std=0 (0.055542ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.073042ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.062583ms)

[Killed] BlockStatement
traces.js:149:23
   // matches the rest of the instrument.
   function clear(ctx, w, h, transparent) {
     ctx.clearRect(0, 0, w, h);
-    if (!transparent) {
-      ctx.fillStyle = BG_COLOR;
-      ctx.fillRect(0, 0, w, h);
-    }
+    if (!transparent) {}
   }
 
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.468917ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.065667ms)
  ✔ empty input is safe (0.051375ms)
  ✔ single sample → mean=value, std=0 (0.055834ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.064791ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.059417ms)

[Killed] ConditionalExpression
traces.js:149:9
   // matches the rest of the instrument.
   function clear(ctx, w, h, transparent) {
     ctx.clearRect(0, 0, w, h);
-    if (!transparent) {
+    if (true) {
       ctx.fillStyle = BG_COLOR;
       ctx.fillRect(0, 0, w, h);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.487958ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.062875ms)
  ✔ empty input is safe (0.051833ms)
  ✔ single sample → mean=value, std=0 (0.052083ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.070375ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.057708ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] BlockStatement
traces.js:158:70
   // Hairline divider between each channel slot. Subtle enough not to
   // compete with the trace, present enough that the eye can tell where
   // one channel ends and the next begins on dense (64+ ch) caps.
-  function drawSlotDividers(ctx, plotX0, plotX1, plotY0, slotH, nCh) {
-    ctx.strokeStyle = SLOT_COLOR;
-    ctx.lineWidth = 1;
-    ctx.beginPath();
-    for (let c = 1; c < nCh; c++) {
-      const y = Math.round(plotY0 + c * slotH) + 0.5;     // half-pixel snap
-      ctx.moveTo(plotX0, y);
-      ctx.lineTo(plotX1, y);
-    }
-    ctx.stroke();
-  }
+  function drawSlotDividers(ctx, plotX0, plotX1, plotY0, slotH, nCh) {}
 
   function drawChannelLabels(ctx, labels, types, slotH, x, y0) {
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.469541ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.064ms)
  ✔ empty input is safe (0.048042ms)
  ✔ single sample → mean=value, std=0 (0.049167ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.065541ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.057375ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce Na

[Killed] EqualityOperator
traces.js:162:21
     ctx.strokeStyle = SLOT_COLOR;
     ctx.lineWidth = 1;
     ctx.beginPath();
-    for (let c = 1; c < nCh; c++) {
+    for (let c = 1; c <= nCh; c++) {
       const y = Math.round(plotY0 + c * slotH) + 0.5;     // half-pixel snap
       ctx.moveTo(plotX0, y);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.466625ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.058083ms)
  ✔ empty input is safe (0.045ms)
  ✔ single sample → mean=value, std=0 (0.047458ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.06375ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.055ms)

[Killed] ConditionalExpression
traces.js:162:21
     ctx.strokeStyle = SLOT_COLOR;
     ctx.lineWidth = 1;
     ctx.beginPath();
-    for (let c = 1; c < nCh; c++) {
+    for (let c = 1; false; c++) {
       const y = Math.round(plotY0 + c * slotH) + 0.5;     // half-pixel snap
       ctx.moveTo(plotX0, y);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.473666ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.067834ms)
  ✔ empty input is safe (0.053375ms)
  ✔ single sample → mean=value, std=0 (0.0555ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.074334ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.060417ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce N

[Killed] ArithmeticOperator
traces.js:163:37
     ctx.lineWidth = 1;
     ctx.beginPath();
     for (let c = 1; c < nCh; c++) {
-      const y = Math.round(plotY0 + c * slotH) + 0.5;     // half-pixel snap
+      const y = Math.round(plotY0 + c / slotH) + 0.5;     // half-pixel snap
       ctx.moveTo(plotX0, y);
       ctx.lineTo(plotX1, y);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.469708ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.067917ms)

  ✔ empty input is safe (0.052625ms)
  ✔ single sample → mean=value, std=0 (0.053875ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.0725ms)

[Killed] ArithmeticOperator
traces.js:163:28
     ctx.lineWidth = 1;
     ctx.beginPath();
     for (let c = 1; c < nCh; c++) {
-      const y = Math.round(plotY0 + c * slotH) + 0.5;     // half-pixel snap
+      const y = Math.round(plotY0 - c * slotH) + 0.5;     // half-pixel snap
       ctx.moveTo(plotX0, y);
       ctx.lineTo(plotX1, y);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.472083ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.063667ms)
  ✔ empty input is safe (0.064083ms)

  ✔ single sample → mean=value, std=0 (0.05175ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.061042ms)
