[Killed] BlockStatement
traces.js:170:64
     ctx.stroke();
   }
 
-  function drawChannelLabels(ctx, labels, types, slotH, x, y0) {
-    ctx.textAlign = 'right';
-    ctx.textBaseline = 'middle';
-    for (let c = 0; c < labels.length; c++) {
-      const y = y0 + (c + 0.5) * slotH;
-      const type = (types && types[c] || '').toUpperCase();
-      const showType = type && type !== 'EEG';
-      if (showType) {
-        // Right-most: type chip in muted small mono.
-        ctx.font = TYPE_LABEL_FONT;
-        ctx.fillStyle = TYPE_LABEL_COLOR;
-        ctx.fillText(type, x - 8, y + 0.5);
-        const typeW = ctx.measureText(type).width;
-        // Then: name immediately to the left of the type chip.
-        ctx.font = LABEL_FONT;
-        ctx.fillStyle = LABEL_COLOR;
-        ctx.fillText(labels[c], x - 8 - typeW - 6, y);
-      } else {
-        ctx.font = LABEL_FONT;
-        ctx.fillStyle = LABEL_COLOR;
-        ctx.fillText(labels[c], x - 8, y);
-      }
-    }
-  }
+  function drawChannelLabels(ctx, labels, types, slotH, x, y0) {}
 
   // Round a positive number up to a "nice" round value from the
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.466917ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.06075ms)

  ✔ empty input is safe (0.047709ms)
  ✔ single sample → mean=value, std=0 (0.047667ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.055458ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.054125ms)

[Killed] ConditionalExpression
traces.js:173:21
   function drawChannelLabels(ctx, labels, types, slotH, x, y0) {
     ctx.textAlign = 'right';
     ctx.textBaseline = 'middle';
-    for (let c = 0; c < labels.length; c++) {
+    for (let c = 0; false; c++) {
       const y = y0 + (c + 0.5) * slotH;
       const type = (types && types[c] || '').toUpperCase();
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.461333ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.062084ms)
  ✔ empty input is safe (0.059042ms)
  ✔ single sample → mean=value, std=0 (0.05375ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.072875ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.05575ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce N

[Killed] BlockStatement
traces.js:173:45
   function drawChannelLabels(ctx, labels, types, slotH, x, y0) {
     ctx.textAlign = 'right';
     ctx.textBaseline = 'middle';
-    for (let c = 0; c < labels.length; c++) {
-      const y = y0 + (c + 0.5) * slotH;
-      const type = (types && types[c] || '').toUpperCase();
-      const showType = type && type !== 'EEG';
-      if (showType) {
-        // Right-most: type chip in muted small mono.
-        ctx.font = TYPE_LABEL_FONT;
-        ctx.fillStyle = TYPE_LABEL_COLOR;
-        ctx.fillText(type, x - 8, y + 0.5);
-        const typeW = ctx.measureText(type).width;
-        // Then: name immediately to the left of the type chip.
-        ctx.font = LABEL_FONT;
-        ctx.fillStyle = LABEL_COLOR;
-        ctx.fillText(labels[c], x - 8 - typeW - 6, y);
-      } else {
-        ctx.font = LABEL_FONT;
-        ctx.fillStyle = LABEL_COLOR;
-        ctx.fillText(labels[c], x - 8, y);
-      }
-    }
+    for (let c = 0; c < labels.length; c++) {}
   }
 
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.500125ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.062667ms)
  ✔ empty input is safe (0.064292ms)

  ✔ single sample → mean=value, std=0 (0.052542ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.060667ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.056167ms)

[Killed] ArithmeticOperator
traces.js:174:23
     ctx.textAlign = 'right';
     ctx.textBaseline = 'middle';
     for (let c = 0; c < labels.length; c++) {
-      const y = y0 + (c + 0.5) * slotH;
+      const y = y0 + (c - 0.5) * slotH;
       const type = (types && types[c] || '').toUpperCase();
       const showType = type && type !== 'EEG';
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.51125ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.0655ms)
  ✔ empty input is safe (0.050709ms)
  ✔ single sample → mean=value, std=0 (0.219417ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.100084ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.0725ms)

[Killed] ArithmeticOperator
traces.js:174:17
     ctx.textAlign = 'right';
     ctx.textBaseline = 'middle';
     for (let c = 0; c < labels.length; c++) {
-      const y = y0 + (c + 0.5) * slotH;
+      const y = y0 - (c + 0.5) * slotH;
       const type = (types && types[c] || '').toUpperCase();
       const showType = type && type !== 'EEG';
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.47625ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.06525ms)
  ✔ empty input is safe (0.049333ms)
  ✔ single sample → mean=value, std=0 (0.174292ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.09ms)

[Killed] LogicalOperator
traces.js:175:21
     ctx.textBaseline = 'middle';
     for (let c = 0; c < labels.length; c++) {
       const y = y0 + (c + 0.5) * slotH;
-      const type = (types && types[c] || '').toUpperCase();
+      const type = (types || types[c] || '').toUpperCase();
       const showType = type && type !== 'EEG';
       if (showType) {
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.4655ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.063666ms)
  ✔ empty input is safe (0.050375ms)
  ✔ single sample → mean=value, std=0 (0.052875ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.475417ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.096167ms)

[Killed] ConditionalExpression
traces.js:175:21
     ctx.textBaseline = 'middle';
     for (let c = 0; c < labels.length; c++) {
       const y = y0 + (c + 0.5) * slotH;
-      const type = (types && types[c] || '').toUpperCase();
+      const type = (true).toUpperCase();
       const showType = type && type !== 'EEG';
       if (showType) {
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.568541ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.069375ms)
  ✔ empty input is safe (0.051708ms)

  ✔ single sample → mean=value, std=0 (0.080333ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.062209ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.059292ms)

[Survived] ConditionalExpression
traces.js:176:24
     for (let c = 0; c < labels.length; c++) {
       const y = y0 + (c + 0.5) * slotH;
       const type = (types && types[c] || '').toUpperCase();
-      const showType = type && type !== 'EEG';
+      const showType = false;
       if (showType) {
         // Right-most: type chip in muted small mono.

[Survived] ConditionalExpression
traces.js:176:24
     for (let c = 0; c < labels.length; c++) {
       const y = y0 + (c + 0.5) * slotH;
       const type = (types && types[c] || '').toUpperCase();
-      const showType = type && type !== 'EEG';
+      const showType = true;
       if (showType) {
         // Right-most: type chip in muted small mono.

[Survived] BlockStatement
traces.js:177:21
       const y = y0 + (c + 0.5) * slotH;
       const type = (types && types[c] || '').toUpperCase();
       const showType = type && type !== 'EEG';
-      if (showType) {
-        // Right-most: type chip in muted small mono.
-        ctx.font = TYPE_LABEL_FONT;
-        ctx.fillStyle = TYPE_LABEL_COLOR;
-        ctx.fillText(type, x - 8, y + 0.5);
-        const typeW = ctx.measureText(type).width;
-        // Then: name immediately to the left of the type chip.
-        ctx.font = LABEL_FONT;
-        ctx.fillStyle = LABEL_COLOR;
-        ctx.fillText(labels[c], x - 8 - typeW - 6, y);
-      } else {
+      if (showType) {} else {
         ctx.font = LABEL_FONT;
         ctx.fillStyle = LABEL_COLOR;

[Survived] ConditionalExpression
traces.js:177:11
       const y = y0 + (c + 0.5) * slotH;
       const type = (types && types[c] || '').toUpperCase();
       const showType = type && type !== 'EEG';
-      if (showType) {
+      if (true) {
         // Right-most: type chip in muted small mono.
         ctx.font = TYPE_LABEL_FONT;

[Survived] ArithmeticOperator
traces.js:181:35
         // Right-most: type chip in muted small mono.
         ctx.font = TYPE_LABEL_FONT;
         ctx.fillStyle = TYPE_LABEL_COLOR;
-        ctx.fillText(type, x - 8, y + 0.5);
+        ctx.fillText(type, x - 8, y - 0.5);
         const typeW = ctx.measureText(type).width;
         // Then: name immediately to the left of the type chip.

[Survived] ArithmeticOperator
traces.js:181:28
         // Right-most: type chip in muted small mono.
         ctx.font = TYPE_LABEL_FONT;
         ctx.fillStyle = TYPE_LABEL_COLOR;
-        ctx.fillText(type, x - 8, y + 0.5);
+        ctx.fillText(type, x + 8, y + 0.5);
         const typeW = ctx.measureText(type).width;
         // Then: name immediately to the left of the type chip.

[Survived] ArithmeticOperator
traces.js:186:33
         // Then: name immediately to the left of the type chip.
         ctx.font = LABEL_FONT;
         ctx.fillStyle = LABEL_COLOR;
-        ctx.fillText(labels[c], x - 8 - typeW - 6, y);
+        ctx.fillText(labels[c], x + 8 - typeW - 6, y);
       } else {
         ctx.font = LABEL_FONT;

[Survived] ArithmeticOperator
traces.js:186:33
         // Then: name immediately to the left of the type chip.
         ctx.font = LABEL_FONT;
         ctx.fillStyle = LABEL_COLOR;
-        ctx.fillText(labels[c], x - 8 - typeW - 6, y);
+        ctx.fillText(labels[c], x - 8 - typeW + 6, y);
       } else {
         ctx.font = LABEL_FONT;

[Killed] BlockStatement
traces.js:187:14
         ctx.font = LABEL_FONT;
         ctx.fillStyle = LABEL_COLOR;
         ctx.fillText(labels[c], x - 8 - typeW - 6, y);
-      } else {
-        ctx.font = LABEL_FONT;
-        ctx.fillStyle = LABEL_COLOR;
-        ctx.fillText(labels[c], x - 8, y);
-      }
+      } else {}
     }
   }
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (1.790958ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.165ms)
  ✔ empty input is safe (0.153125ms)
  ✔ single sample → mean=value, std=0 (0.232583ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.349416ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.23825ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce NaN

[Survived] ArithmeticOperator
traces.js:190:33
       } else {
         ctx.font = LABEL_FONT;
         ctx.fillStyle = LABEL_COLOR;
-        ctx.fillText(labels[c], x - 8, y);
+        ctx.fillText(labels[c], x + 8, y);
       }
     }

[Killed] BlockStatement
traces.js:198:25
   // Round a positive number up to a "nice" round value from the
   // 1/2/5×10^N family. Used by the amplitude scale bar so its label
   // is human-friendly (50/100/200/500 µV, never 173 µV).
-  function niceRound(v) {
-    if (v <= 0) return 1;
-    const exp = Math.floor(Math.log10(v));
-    const f = v / Math.pow(10, exp);
-    const niceF = f < 1.5 ? 1 : f < 3.5 ? 2 : f < 7.5 ? 5 : 10;
-    return niceF * Math.pow(10, exp);
-  }
+  function niceRound(v) {}
 
   // Format an amplitude scale value in human-readable units. EEG is
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.465959ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.063167ms)
  ✔ empty input is safe (0.052ms)
  ✔ single sample → mean=value, std=0 (0.06825ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.063333ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.058125ms)

[Killed] EqualityOperator
traces.js:199:9
   // 1/2/5×10^N family. Used by the amplitude scale bar so its label
   // is human-friendly (50/100/200/500 µV, never 173 µV).
   function niceRound(v) {
-    if (v <= 0) return 1;
+    if (v < 0) return 1;
     const exp = Math.floor(Math.log10(v));
     const f = v / Math.pow(10, exp);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.465959ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.060084ms)

  ✔ empty input is safe (0.045958ms)

  ✔ single sample → mean=value, std=0 (0.047666ms)

[Killed] ConditionalExpression
traces.js:199:9
   // 1/2/5×10^N family. Used by the amplitude scale bar so its label
   // is human-friendly (50/100/200/500 µV, never 173 µV).
   function niceRound(v) {
-    if (v <= 0) return 1;
+    if (false) return 1;
     const exp = Math.floor(Math.log10(v));
     const f = v / Math.pow(10, exp);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.477667ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.062ms)
  ✔ empty input is safe (0.047167ms)
  ✔ single sample → mean=value, std=0 (0.061209ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.057708ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.054791ms)

[Killed] ArithmeticOperator
traces.js:201:15
   function niceRound(v) {
     if (v <= 0) return 1;
     const exp = Math.floor(Math.log10(v));
-    const f = v / Math.pow(10, exp);
+    const f = v * Math.pow(10, exp);
     const niceF = f < 1.5 ? 1 : f < 3.5 ? 2 : f < 7.5 ? 5 : 10;
     return niceF * Math.pow(10, exp);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.48925ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.066875ms)
  ✔ empty input is safe (0.053167ms)
  ✔ single sample → mean=value, std=0 (0.057417ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.066625ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.064625ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] EqualityOperator
traces.js:202:47
     if (v <= 0) return 1;
     const exp = Math.floor(Math.log10(v));
     const f = v / Math.pow(10, exp);
-    const niceF = f < 1.5 ? 1 : f < 3.5 ? 2 : f < 7.5 ? 5 : 10;
+    const niceF = f < 1.5 ? 1 : f < 3.5 ? 2 : f >= 7.5 ? 5 : 10;
     return niceF * Math.pow(10, exp);
   }
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.521167ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.069375ms)
  ✔ empty input is safe (0.052625ms)
  ✔ single sample → mean=value, std=0 (0.060334ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.058625ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.05325ms)

[Killed] ConditionalExpression
traces.js:202:19
     if (v <= 0) return 1;
     const exp = Math.floor(Math.log10(v));
     const f = v / Math.pow(10, exp);
-    const niceF = f < 1.5 ? 1 : f < 3.5 ? 2 : f < 7.5 ? 5 : 10;
+    const niceF = true ? 1 : f < 3.5 ? 2 : f < 7.5 ? 5 : 10;
     return niceF * Math.pow(10, exp);
   }
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.493667ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.110458ms)
  ✔ empty input is safe (0.082875ms)
  ✔ single sample → mean=value, std=0 (0.072084ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (1.579125ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.212542ms)

[Killed] ArithmeticOperator
traces.js:203:12
     const exp = Math.floor(Math.log10(v));
     const f = v / Math.pow(10, exp);
     const niceF = f < 1.5 ? 1 : f < 3.5 ? 2 : f < 7.5 ? 5 : 10;
-    return niceF * Math.pow(10, exp);
+    return niceF / Math.pow(10, exp);
   }
 
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (1.20575ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.425167ms)
  ✔ empty input is safe (0.124ms)
  ✔ single sample → mean=value, std=0 (0.27925ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.112792ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.069084ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce NaN/

[Killed] BlockStatement
traces.js:208:36
 
   // Format an amplitude scale value in human-readable units. EEG is
   // typically 1-500 µV; large drift channels can reach mV.
-  function formatScale(microvolts) {
-    if (microvolts < 1)    return microvolts.toFixed(2) + ' µV';
-    if (microvolts < 1000) return Math.round(microvolts) + ' µV';
-    return (microvolts / 1000).toFixed(1) + ' mV';
-  }
+  function formatScale(microvolts) {}
 
   // Vertical amplitude scale bar in the right gutter. Picks a nice
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.497792ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.06475ms)
  ✔ empty input is safe (0.052416ms)
  ✔ single sample → mean=value, std=0 (0.051542ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.073875ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.057208ms)

[Killed] ConditionalExpression
traces.js:209:9
   // Format an amplitude scale value in human-readable units. EEG is
   // typically 1-500 µV; large drift channels can reach mV.
   function formatScale(microvolts) {
-    if (microvolts < 1)    return microvolts.toFixed(2) + ' µV';
+    if (true)    return microvolts.toFixed(2) + ' µV';
     if (microvolts < 1000) return Math.round(microvolts) + ' µV';
     return (microvolts / 1000).toFixed(1) + ' mV';
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.475875ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.07975ms)
  ✔ empty input is safe (0.059459ms)
  ✔ single sample → mean=value, std=0 (0.069792ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.112542ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.058333ms)

[Killed] EqualityOperator
traces.js:209:9
   // Format an amplitude scale value in human-readable units. EEG is
   // typically 1-500 µV; large drift channels can reach mV.
   function formatScale(microvolts) {
-    if (microvolts < 1)    return microvolts.toFixed(2) + ' µV';
+    if (microvolts >= 1)    return microvolts.toFixed(2) + ' µV';
     if (microvolts < 1000) return Math.round(microvolts) + ' µV';
     return (microvolts / 1000).toFixed(1) + ' mV';
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.49ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.064084ms)
  ✔ empty input is safe (0.070042ms)
  ✔ single sample → mean=value, std=0 (0.052958ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.05925ms)

[Killed] ConditionalExpression
traces.js:210:9
   // typically 1-500 µV; large drift channels can reach mV.
   function formatScale(microvolts) {
     if (microvolts < 1)    return microvolts.toFixed(2) + ' µV';
-    if (microvolts < 1000) return Math.round(microvolts) + ' µV';
+    if (false) return Math.round(microvolts) + ' µV';
     return (microvolts / 1000).toFixed(1) + ' mV';
   }
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (2.720541ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.084875ms)
  ✔ empty input is safe (0.056ms)
  ✔ single sample → mean=value, std=0 (0.057ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.08425ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.060042ms)

[Killed] EqualityOperator
traces.js:210:9
   // typically 1-500 µV; large drift channels can reach mV.
   function formatScale(microvolts) {
     if (microvolts < 1)    return microvolts.toFixed(2) + ' µV';
-    if (microvolts < 1000) return Math.round(microvolts) + ' µV';
+    if (microvolts <= 1000) return Math.round(microvolts) + ' µV';
     return (microvolts / 1000).toFixed(1) + ' mV';
   }
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.491541ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.063292ms)
  ✔ empty input is safe (0.050208ms)
  ✔ single sample → mean=value, std=0 (0.064ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.056833ms)

[Killed] ArithmeticOperator
traces.js:211:13
   function formatScale(microvolts) {
     if (microvolts < 1)    return microvolts.toFixed(2) + ' µV';
     if (microvolts < 1000) return Math.round(microvolts) + ' µV';
-    return (microvolts / 1000).toFixed(1) + ' mV';
+    return (microvolts * 1000).toFixed(1) + ' mV';
   }
 
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.517917ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.067416ms)
  ✔ empty input is safe (0.048666ms)
  ✔ single sample → mean=value, std=0 (0.05175ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.152458ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.266708ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] StringLiteral
traces.js:211:45
   function formatScale(microvolts) {
     if (microvolts < 1)    return microvolts.toFixed(2) + ' µV';
     if (microvolts < 1000) return Math.round(microvolts) + ' µV';
-    return (microvolts / 1000).toFixed(1) + ' mV';
+    return (microvolts / 1000).toFixed(1) + "";
   }
 
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.483917ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.06ms)
  ✔ empty input is safe (0.062042ms)
  ✔ single sample → mean=value, std=0 (0.049792ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.058875ms)

[Killed] EqualityOperator
traces.js:218:38
   // round µV value that maps to ~50% of a slot height so the glyph
   // is visible without crowding adjacent slots.
   function drawScaleBar(ctx, slotH, slotMicrovolts, plotX1, plotY0, plotH) {
-    if (!isFinite(slotMicrovolts) || slotMicrovolts <= 0) return;
+    if (!isFinite(slotMicrovolts) || slotMicrovolts > 0) return;
     const targetMv = niceRound(slotMicrovolts * 0.5);
     const px = (targetMv / slotMicrovolts) * slotH;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.776166ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.352625ms)
  ✔ empty input is safe (1.190458ms)

  ✔ single sample → mean=value, std=0 (0.094291ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.071125ms)

[Killed] ConditionalExpression
traces.js:218:9
   // round µV value that maps to ~50% of a slot height so the glyph
   // is visible without crowding adjacent slots.
   function drawScaleBar(ctx, slotH, slotMicrovolts, plotX1, plotY0, plotH) {
-    if (!isFinite(slotMicrovolts) || slotMicrovolts <= 0) return;
+    if (true) return;
     const targetMv = niceRound(slotMicrovolts * 0.5);
     const px = (targetMv / slotMicrovolts) * slotH;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (4.64725ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.073209ms)
  ✔ empty input is safe (0.053334ms)
  ✔ single sample → mean=value, std=0 (0.050791ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.073208ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.076084ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] ArithmeticOperator
traces.js:219:32
   // is visible without crowding adjacent slots.
   function drawScaleBar(ctx, slotH, slotMicrovolts, plotX1, plotY0, plotH) {
     if (!isFinite(slotMicrovolts) || slotMicrovolts <= 0) return;
-    const targetMv = niceRound(slotMicrovolts * 0.5);
+    const targetMv = niceRound(slotMicrovolts / 0.5);
     const px = (targetMv / slotMicrovolts) * slotH;
     if (!isFinite(px) || px < 8) return;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.480375ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.062167ms)
  ✔ empty input is safe (0.046625ms)
  ✔ single sample → mean=value, std=0 (0.049375ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.0545ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.052292ms)

[Killed] ArithmeticOperator
traces.js:220:16
   function drawScaleBar(ctx, slotH, slotMicrovolts, plotX1, plotY0, plotH) {
     if (!isFinite(slotMicrovolts) || slotMicrovolts <= 0) return;
     const targetMv = niceRound(slotMicrovolts * 0.5);
-    const px = (targetMv / slotMicrovolts) * slotH;
+    const px = targetMv / slotMicrovolts / slotH;
     if (!isFinite(px) || px < 8) return;
 
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.52175ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.2135ms)
  ✔ empty input is safe (0.166583ms)
  ✔ single sample → mean=value, std=0 (0.142625ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.243916ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.180459ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce Na

[Killed] ArithmeticOperator
traces.js:220:17
   function drawScaleBar(ctx, slotH, slotMicrovolts, plotX1, plotY0, plotH) {
     if (!isFinite(slotMicrovolts) || slotMicrovolts <= 0) return;
     const targetMv = niceRound(slotMicrovolts * 0.5);
-    const px = (targetMv / slotMicrovolts) * slotH;
+    const px = (targetMv * slotMicrovolts) * slotH;
     if (!isFinite(px) || px < 8) return;
 
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.489167ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.061792ms)
  ✔ empty input is safe (0.048542ms)
  ✔ single sample → mean=value, std=0 (0.0625ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.057ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.055125ms)

[Killed] EqualityOperator
traces.js:221:26
     if (!isFinite(slotMicrovolts) || slotMicrovolts <= 0) return;
     const targetMv = niceRound(slotMicrovolts * 0.5);
     const px = (targetMv / slotMicrovolts) * slotH;
-    if (!isFinite(px) || px < 8) return;
+    if (!isFinite(px) || px >= 8) return;
 
     const x = plotX1 + 18;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.500291ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.061458ms)
  ✔ empty input is safe (0.050042ms)
  ✔ single sample → mean=value, std=0 (0.049208ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.068916ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.054834ms)

[Killed] BooleanLiteral
traces.js:221:9
     if (!isFinite(slotMicrovolts) || slotMicrovolts <= 0) return;
     const targetMv = niceRound(slotMicrovolts * 0.5);
     const px = (targetMv / slotMicrovolts) * slotH;
-    if (!isFinite(px) || px < 8) return;
+    if (isFinite(px) || px < 8) return;
 
     const x = plotX1 + 18;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (1.287917ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.180708ms)
  ✔ empty input is safe (0.092917ms)
  ✔ single sample → mean=value, std=0 (0.066ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.162083ms)

[Killed] ArithmeticOperator
traces.js:223:15
     const px = (targetMv / slotMicrovolts) * slotH;
     if (!isFinite(px) || px < 8) return;
 
-    const x = plotX1 + 18;
+    const x = plotX1 - 18;
     const yBottom = plotY0 + plotH - 12;
     const yTop = yBottom - px;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.474375ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.068333ms)
  ✔ empty input is safe (0.050625ms)
  ✔ single sample → mean=value, std=0 (0.05ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.070875ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.054083ms)

[Killed] ArithmeticOperator
traces.js:224:21
     if (!isFinite(px) || px < 8) return;
 
     const x = plotX1 + 18;
-    const yBottom = plotY0 + plotH - 12;
+    const yBottom = plotY0 - plotH - 12;
     const yTop = yBottom - px;
 
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.480833ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.06475ms)
  ✔ empty input is safe (0.047959ms)
  ✔ single sample → mean=value, std=0 (0.049083ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.067625ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.054458ms)

[Killed] ArithmeticOperator
traces.js:224:21
     if (!isFinite(px) || px < 8) return;
 
     const x = plotX1 + 18;
-    const yBottom = plotY0 + plotH - 12;
+    const yBottom = plotY0 + plotH + 12;
     const yTop = yBottom - px;
 
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (2.704667ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.181583ms)
  ✔ empty input is safe (1.062209ms)
  ✔ single sample → mean=value, std=0 (0.15075ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.170666ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.144667ms)

[Killed] ArithmeticOperator
traces.js:225:18
 
     const x = plotX1 + 18;
     const yBottom = plotY0 + plotH - 12;
-    const yTop = yBottom - px;
+    const yTop = yBottom + px;
 
     ctx.save();
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (2.814166ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.179958ms)
  ✔ empty input is safe (0.127625ms)
  ✔ single sample → mean=value, std=0 (0.175958ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.152459ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.081958ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] ArithmeticOperator
traces.js:232:16
     ctx.fillStyle = LABEL_COLOR;
     ctx.lineWidth = 1;
     ctx.beginPath();
-    ctx.moveTo(x + 0.5, yTop);
+    ctx.moveTo(x - 0.5, yTop);
     ctx.lineTo(x + 0.5, yBottom);
     ctx.moveTo(x - 3, yTop + 0.5);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.490959ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.062ms)
  ✔ empty input is safe (0.047792ms)
  ✔ single sample → mean=value, std=0 (0.0485ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.070542ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.053291ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce NaN/
