[Killed] ArithmeticOperator
traces.js:233:16
     ctx.lineWidth = 1;
     ctx.beginPath();
     ctx.moveTo(x + 0.5, yTop);
-    ctx.lineTo(x + 0.5, yBottom);
+    ctx.lineTo(x - 0.5, yBottom);
     ctx.moveTo(x - 3, yTop + 0.5);
     ctx.lineTo(x + 4, yTop + 0.5);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.477208ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.066334ms)
  ✔ empty input is safe (0.054875ms)
  ✔ single sample → mean=value, std=0 (0.065ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.063042ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.062625ms)

[Killed] ArithmeticOperator
traces.js:234:16
     ctx.beginPath();
     ctx.moveTo(x + 0.5, yTop);
     ctx.lineTo(x + 0.5, yBottom);
-    ctx.moveTo(x - 3, yTop + 0.5);
+    ctx.moveTo(x + 3, yTop + 0.5);
     ctx.lineTo(x + 4, yTop + 0.5);
     ctx.moveTo(x - 3, yBottom + 0.5);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.4675ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.059083ms)
  ✔ empty input is safe (0.049125ms)
  ✔ single sample → mean=value, std=0 (0.051333ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.076291ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.055ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce NaN/

[Survived] ArithmeticOperator
traces.js:234:23
     ctx.beginPath();
     ctx.moveTo(x + 0.5, yTop);
     ctx.lineTo(x + 0.5, yBottom);
-    ctx.moveTo(x - 3, yTop + 0.5);
+    ctx.moveTo(x - 3, yTop - 0.5);
     ctx.lineTo(x + 4, yTop + 0.5);
     ctx.moveTo(x - 3, yBottom + 0.5);

[Killed] ArithmeticOperator
traces.js:235:16
     ctx.moveTo(x + 0.5, yTop);
     ctx.lineTo(x + 0.5, yBottom);
     ctx.moveTo(x - 3, yTop + 0.5);
-    ctx.lineTo(x + 4, yTop + 0.5);
+    ctx.lineTo(x - 4, yTop + 0.5);
     ctx.moveTo(x - 3, yBottom + 0.5);
     ctx.lineTo(x + 4, yBottom + 0.5);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.482833ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.064041ms)
  ✔ empty input is safe (0.047875ms)
  ✔ single sample → mean=value, std=0 (0.050042ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.058667ms)

[Survived] ArithmeticOperator
traces.js:235:23
     ctx.moveTo(x + 0.5, yTop);
     ctx.lineTo(x + 0.5, yBottom);
     ctx.moveTo(x - 3, yTop + 0.5);
-    ctx.lineTo(x + 4, yTop + 0.5);
+    ctx.lineTo(x + 4, yTop - 0.5);
     ctx.moveTo(x - 3, yBottom + 0.5);
     ctx.lineTo(x + 4, yBottom + 0.5);

[Killed] ArithmeticOperator
traces.js:236:16
     ctx.lineTo(x + 0.5, yBottom);
     ctx.moveTo(x - 3, yTop + 0.5);
     ctx.lineTo(x + 4, yTop + 0.5);
-    ctx.moveTo(x - 3, yBottom + 0.5);
+    ctx.moveTo(x + 3, yBottom + 0.5);
     ctx.lineTo(x + 4, yBottom + 0.5);
     ctx.stroke();
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.47725ms)
  ✔ ±1 alternating → mean≈0, std≈1 (5.589709ms)
  ✔ empty input is safe (0.112916ms)
  ✔ single sample → mean=value, std=0 (0.186083ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.0955ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.07275ms)

[Survived] ArithmeticOperator
traces.js:236:23
     ctx.lineTo(x + 0.5, yBottom);
     ctx.moveTo(x - 3, yTop + 0.5);
     ctx.lineTo(x + 4, yTop + 0.5);
-    ctx.moveTo(x - 3, yBottom + 0.5);
+    ctx.moveTo(x - 3, yBottom - 0.5);
     ctx.lineTo(x + 4, yBottom + 0.5);
     ctx.stroke();

[Killed] ArithmeticOperator
traces.js:237:16
     ctx.moveTo(x - 3, yTop + 0.5);
     ctx.lineTo(x + 4, yTop + 0.5);
     ctx.moveTo(x - 3, yBottom + 0.5);
-    ctx.lineTo(x + 4, yBottom + 0.5);
+    ctx.lineTo(x - 4, yBottom + 0.5);
     ctx.stroke();
     ctx.font = AXIS_FONT;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (1.133791ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.175ms)
  ✔ empty input is safe (0.134459ms)
  ✔ single sample → mean=value, std=0 (0.128042ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.166458ms)

[Survived] ArithmeticOperator
traces.js:237:23
     ctx.moveTo(x - 3, yTop + 0.5);
     ctx.lineTo(x + 4, yTop + 0.5);
     ctx.moveTo(x - 3, yBottom + 0.5);
-    ctx.lineTo(x + 4, yBottom + 0.5);
+    ctx.lineTo(x + 4, yBottom - 0.5);
     ctx.stroke();
     ctx.font = AXIS_FONT;

[Killed] ArithmeticOperator
traces.js:242:41
     ctx.font = AXIS_FONT;
     ctx.textAlign = 'left';
     ctx.textBaseline = 'middle';
-    ctx.fillText(formatScale(targetMv), x + 8, (yTop + yBottom) / 2);
+    ctx.fillText(formatScale(targetMv), x - 8, (yTop + yBottom) / 2);
     ctx.restore();
   }
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (4.593ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.155708ms)
  ✔ empty input is safe (0.175834ms)
  ✔ single sample → mean=value, std=0 (0.386333ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.135667ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.103875ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce Na

[Killed] ArithmeticOperator
traces.js:242:49
     ctx.font = AXIS_FONT;
     ctx.textAlign = 'left';
     ctx.textBaseline = 'middle';
-    ctx.fillText(formatScale(targetMv), x + 8, (yTop + yBottom) / 2);
+    ctx.fillText(formatScale(targetMv), x + 8, (yTop - yBottom) / 2);
     ctx.restore();
   }
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.527541ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.065541ms)
  ✔ empty input is safe (0.050125ms)
  ✔ single sample → mean=value, std=0 (0.051ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.084041ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.060708ms)

[Killed] ConditionalExpression
traces.js:251:9
   // are dropped when they would collide (< 32 px apart) so a
   // dense burst of events looks like a comb instead of a wall of text.
   function drawEventMarkers(ctx, events, t0, t1, plotX0, plotX1, plotY0, plotH) {
-    if (!events || !events.length) return;
+    if (true) return;
     const span = t1 - t0;
     if (span <= 0) return;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.499833ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.0605ms)
  ✔ empty input is safe (0.054209ms)
  ✔ single sample → mean=value, std=0 (0.0695ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.05775ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.057833ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce NaN/

[Killed] LogicalOperator
traces.js:251:9
   // are dropped when they would collide (< 32 px apart) so a
   // dense burst of events looks like a comb instead of a wall of text.
   function drawEventMarkers(ctx, events, t0, t1, plotX0, plotX1, plotY0, plotH) {
-    if (!events || !events.length) return;
+    if (!events && !events.length) return;
     const span = t1 - t0;
     if (span <= 0) return;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.623208ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.075625ms)
  ✔ empty input is safe (0.066334ms)
  ✔ single sample → mean=value, std=0 (0.051958ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.154625ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.057667ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Survived] ArithmeticOperator
traces.js:252:18
   // dense burst of events looks like a comb instead of a wall of text.
   function drawEventMarkers(ctx, events, t0, t1, plotX0, plotX1, plotY0, plotH) {
     if (!events || !events.length) return;
-    const span = t1 - t0;
+    const span = t1 + t0;
     if (span <= 0) return;
     const visible = [];

[Killed] ConditionalExpression
traces.js:253:9
   function drawEventMarkers(ctx, events, t0, t1, plotX0, plotX1, plotY0, plotH) {
     if (!events || !events.length) return;
     const span = t1 - t0;
-    if (span <= 0) return;
+    if (true) return;
     const visible = [];
     for (const ev of events) {
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (1.697ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.313209ms)
  ✔ empty input is safe (0.145125ms)
  ✔ single sample → mean=value, std=0 (0.24275ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.162542ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.147417ms)

[Killed] EqualityOperator
traces.js:253:9
   function drawEventMarkers(ctx, events, t0, t1, plotX0, plotX1, plotY0, plotH) {
     if (!events || !events.length) return;
     const span = t1 - t0;
-    if (span <= 0) return;
+    if (span > 0) return;
     const visible = [];
     for (const ev of events) {
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.476ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.062542ms)
  ✔ empty input is safe (0.045583ms)
  ✔ single sample → mean=value, std=0 (0.049875ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.068792ms)

[Killed] BlockStatement
traces.js:255:30
     const span = t1 - t0;
     if (span <= 0) return;
     const visible = [];
-    for (const ev of events) {
-      if (ev.onset < t0 || ev.onset > t1) continue;
-      visible.push(ev);
-    }
+    for (const ev of events) {}
     if (!visible.length) return;
     ctx.save();
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.505625ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.068709ms)
  ✔ empty input is safe (0.048291ms)
  ✔ single sample → mean=value, std=0 (0.052583ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.077209ms)

[Killed] ConditionalExpression
traces.js:256:11
     if (span <= 0) return;
     const visible = [];
     for (const ev of events) {
-      if (ev.onset < t0 || ev.onset > t1) continue;
+      if (true) continue;
       visible.push(ev);
     }
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.484875ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.070208ms)
  ✔ empty input is safe (0.068958ms)
  ✔ single sample → mean=value, std=0 (2.670417ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.140708ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.305791ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] ConditionalExpression
traces.js:256:11
     if (span <= 0) return;
     const visible = [];
     for (const ev of events) {
-      if (ev.onset < t0 || ev.onset > t1) continue;
+      if (false) continue;
       visible.push(ev);
     }
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.506291ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.066083ms)
  ✔ empty input is safe (0.054125ms)
  ✔ single sample → mean=value, std=0 (0.068542ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.063375ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.065333ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] BooleanLiteral
traces.js:259:9
       if (ev.onset < t0 || ev.onset > t1) continue;
       visible.push(ev);
     }
-    if (!visible.length) return;
+    if (visible.length) return;
     ctx.save();
     ctx.strokeStyle = EVENT_LINE_COLOR;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.489875ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.058833ms)
  ✔ empty input is safe (0.04975ms)
  ✔ single sample → mean=value, std=0 (0.05225ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.068417ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.141208ms)

[Killed] ConditionalExpression
traces.js:259:9
       if (ev.onset < t0 || ev.onset > t1) continue;
       visible.push(ev);
     }
-    if (!visible.length) return;
+    if (true) return;
     ctx.save();
     ctx.strokeStyle = EVENT_LINE_COLOR;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.468583ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.061584ms)
  ✔ empty input is safe (0.048583ms)
  ✔ single sample → mean=value, std=0 (0.048542ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.07575ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.054708ms)

[Killed] BlockStatement
traces.js:264:31
     ctx.strokeStyle = EVENT_LINE_COLOR;
     ctx.lineWidth = 1;
     ctx.beginPath();
-    for (const ev of visible) {
-      const x = Math.round(plotX0 + ((ev.onset - t0) / span) * (plotX1 - plotX0)) + 0.5;
-      ctx.moveTo(x, plotY0);
-      ctx.lineTo(x, plotY0 + plotH);
-    }
+    for (const ev of visible) {}
     ctx.stroke();
     ctx.fillStyle = EVENT_LABEL_COLOR;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.493375ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.059167ms)
  ✔ empty input is safe (0.0495ms)

  ✔ single sample → mean=value, std=0 (0.061ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.056959ms)

[Killed] ArithmeticOperator
traces.js:265:37
     ctx.lineWidth = 1;
     ctx.beginPath();
     for (const ev of visible) {
-      const x = Math.round(plotX0 + ((ev.onset - t0) / span) * (plotX1 - plotX0)) + 0.5;
+      const x = Math.round(plotX0 + (ev.onset - t0) / span / (plotX1 - plotX0)) + 0.5;
       ctx.moveTo(x, plotY0);
       ctx.lineTo(x, plotY0 + plotH);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.569417ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.08025ms)
  ✔ empty input is safe (0.069667ms)
  ✔ single sample → mean=value, std=0 (0.05925ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.078042ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.062833ms)

[Killed] ArithmeticOperator
traces.js:265:28
     ctx.lineWidth = 1;
     ctx.beginPath();
     for (const ev of visible) {
-      const x = Math.round(plotX0 + ((ev.onset - t0) / span) * (plotX1 - plotX0)) + 0.5;
+      const x = Math.round(plotX0 - (ev.onset - t0) / span * (plotX1 - plotX0)) + 0.5;
       ctx.moveTo(x, plotY0);
       ctx.lineTo(x, plotY0 + plotH);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.481917ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.0645ms)
  ✔ empty input is safe (0.04725ms)

  ✔ single sample → mean=value, std=0 (0.064084ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.0565ms)

[Killed] ArithmeticOperator
traces.js:267:21
     for (const ev of visible) {
       const x = Math.round(plotX0 + ((ev.onset - t0) / span) * (plotX1 - plotX0)) + 0.5;
       ctx.moveTo(x, plotY0);
-      ctx.lineTo(x, plotY0 + plotH);
+      ctx.lineTo(x, plotY0 - plotH);
     }
     ctx.stroke();
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.470292ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.059125ms)

  ✔ empty input is safe (0.046375ms)

  ✔ single sample → mean=value, std=0 (0.056792ms)

[Survived] StringLiteral
traces.js:272:21
     ctx.stroke();
     ctx.fillStyle = EVENT_LABEL_COLOR;
     ctx.font = AXIS_FONT;
-    ctx.textAlign = 'left';
+    ctx.textAlign = "";
     ctx.textBaseline = 'top';
     let lastLabelX = -100;

[Survived] UnaryOperator
traces.js:274:22
     ctx.font = AXIS_FONT;
     ctx.textAlign = 'left';
     ctx.textBaseline = 'top';
-    let lastLabelX = -100;
+    let lastLabelX = +100;
     for (const ev of visible) {
       const x = Math.round(plotX0 + ((ev.onset - t0) / span) * (plotX1 - plotX0));

[Killed] BlockStatement
traces.js:275:31
     ctx.textAlign = 'left';
     ctx.textBaseline = 'top';
     let lastLabelX = -100;
-    for (const ev of visible) {
-      const x = Math.round(plotX0 + ((ev.onset - t0) / span) * (plotX1 - plotX0));
-      if (x - lastLabelX < 32) continue;
-      if (ev.label) {
-        ctx.fillText(String(ev.label).slice(0, 14), x + 3, plotY0 + 1);
-        lastLabelX = x;
-      }
-    }
+    for (const ev of visible) {}
     ctx.restore();
   }
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.485541ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.120083ms)
  ✔ empty input is safe (0.05625ms)
  ✔ single sample → mean=value, std=0 (0.059458ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.084083ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.08925ms)

[Killed] ArithmeticOperator
traces.js:276:28
     ctx.textBaseline = 'top';
     let lastLabelX = -100;
     for (const ev of visible) {
-      const x = Math.round(plotX0 + ((ev.onset - t0) / span) * (plotX1 - plotX0));
+      const x = Math.round(plotX0 - (ev.onset - t0) / span * (plotX1 - plotX0));
       if (x - lastLabelX < 32) continue;
       if (ev.label) {
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.474333ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.061875ms)
  ✔ empty input is safe (0.050042ms)
  ✔ single sample → mean=value, std=0 (0.062167ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.059334ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.057167ms)

[Killed] ArithmeticOperator
traces.js:276:37
     ctx.textBaseline = 'top';
     let lastLabelX = -100;
     for (const ev of visible) {
-      const x = Math.round(plotX0 + ((ev.onset - t0) / span) * (plotX1 - plotX0));
+      const x = Math.round(plotX0 + (ev.onset - t0) / span / (plotX1 - plotX0));
       if (x - lastLabelX < 32) continue;
       if (ev.label) {
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.493584ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.061083ms)
  ✔ empty input is safe (0.047708ms)
  ✔ single sample → mean=value, std=0 (0.063667ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.059667ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.057583ms)

[Killed] ArithmeticOperator
traces.js:277:11
     let lastLabelX = -100;
     for (const ev of visible) {
       const x = Math.round(plotX0 + ((ev.onset - t0) / span) * (plotX1 - plotX0));
-      if (x - lastLabelX < 32) continue;
+      if (x + lastLabelX < 32) continue;
       if (ev.label) {
         ctx.fillText(String(ev.label).slice(0, 14), x + 3, plotY0 + 1);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.469583ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.059083ms)
  ✔ empty input is safe (0.045167ms)
  ✔ single sample → mean=value, std=0 (0.047625ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.054625ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.065541ms)

[Killed] ConditionalExpression
traces.js:277:11
     let lastLabelX = -100;
     for (const ev of visible) {
       const x = Math.round(plotX0 + ((ev.onset - t0) / span) * (plotX1 - plotX0));
-      if (x - lastLabelX < 32) continue;
+      if (false) continue;
       if (ev.label) {
         ctx.fillText(String(ev.label).slice(0, 14), x + 3, plotY0 + 1);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.501791ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.063416ms)
  ✔ empty input is safe (0.052875ms)
  ✔ single sample → mean=value, std=0 (0.114083ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.30175ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.476875ms)

[Killed] ConditionalExpression
traces.js:278:11
     for (const ev of visible) {
       const x = Math.round(plotX0 + ((ev.onset - t0) / span) * (plotX1 - plotX0));
       if (x - lastLabelX < 32) continue;
-      if (ev.label) {
+      if (false) {
         ctx.fillText(String(ev.label).slice(0, 14), x + 3, plotY0 + 1);
         lastLabelX = x;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.490667ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.059917ms)
  ✔ empty input is safe (0.047458ms)
  ✔ single sample → mean=value, std=0 (0.049625ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.076083ms)

[Killed] BlockStatement
traces.js:278:21
     for (const ev of visible) {
       const x = Math.round(plotX0 + ((ev.onset - t0) / span) * (plotX1 - plotX0));
       if (x - lastLabelX < 32) continue;
-      if (ev.label) {
-        ctx.fillText(String(ev.label).slice(0, 14), x + 3, plotY0 + 1);
-        lastLabelX = x;
-      }
+      if (ev.label) {}
     }
     ctx.restore();
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.480625ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.0635ms)
  ✔ empty input is safe (0.051625ms)
  ✔ single sample → mean=value, std=0 (0.067542ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.060041ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.057958ms)

[Killed] MethodExpression
traces.js:279:22
       const x = Math.round(plotX0 + ((ev.onset - t0) / span) * (plotX1 - plotX0));
       if (x - lastLabelX < 32) continue;
       if (ev.label) {
-        ctx.fillText(String(ev.label).slice(0, 14), x + 3, plotY0 + 1);
+        ctx.fillText(String(ev.label), x + 3, plotY0 + 1);
         lastLabelX = x;
       }
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.532666ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.067084ms)
  ✔ empty input is safe (0.051042ms)

  ✔ single sample → mean=value, std=0 (0.049708ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.072792ms)

[Killed] ArithmeticOperator
traces.js:279:53
       const x = Math.round(plotX0 + ((ev.onset - t0) / span) * (plotX1 - plotX0));
       if (x - lastLabelX < 32) continue;
       if (ev.label) {
-        ctx.fillText(String(ev.label).slice(0, 14), x + 3, plotY0 + 1);
+        ctx.fillText(String(ev.label).slice(0, 14), x - 3, plotY0 + 1);
         lastLabelX = x;
       }
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.488875ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.064541ms)
  ✔ empty input is safe (0.442166ms)
  ✔ single sample → mean=value, std=0 (0.077209ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.077541ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.059917ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] BlockStatement
traces.js:288:34
 
   // Format an absolute number of seconds-since-midnight as HH:MM:SS.
   // Works for recording offsets that may wrap past midnight.
-  function secToHHMMSS(totalSec) {
-    const s = Math.floor(totalSec) % 86400;
-    const hh = String(Math.floor(s / 3600) % 24).padStart(2, '0');
-    const mm = String(Math.floor((s % 3600) / 60)).padStart(2, '0');
-    const ss = String(s % 60).padStart(2, '0');
-    return `${hh}:${mm}:${ss}`;
-  }
+  function secToHHMMSS(totalSec) {}
 
   // Parse an ISO 8601 string "YYYY-MM-DDTHH:MM:SS" and return the
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.459709ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.062041ms)
  ✔ empty input is safe (0.047042ms)
  ✔ single sample → mean=value, std=0 (0.049459ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.059667ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.057667ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] ArithmeticOperator
traces.js:289:15
   // Format an absolute number of seconds-since-midnight as HH:MM:SS.
   // Works for recording offsets that may wrap past midnight.
   function secToHHMMSS(totalSec) {
-    const s = Math.floor(totalSec) % 86400;
+    const s = Math.floor(totalSec) * 86400;
     const hh = String(Math.floor(s / 3600) % 24).padStart(2, '0');
     const mm = String(Math.floor((s % 3600) / 60)).padStart(2, '0');
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.479625ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.063333ms)
  ✔ empty input is safe (0.063ms)

  ✔ single sample → mean=value, std=0 (0.05ms)

[Killed] ArithmeticOperator
traces.js:290:23
   // Works for recording offsets that may wrap past midnight.
   function secToHHMMSS(totalSec) {
     const s = Math.floor(totalSec) % 86400;
-    const hh = String(Math.floor(s / 3600) % 24).padStart(2, '0');
+    const hh = String(Math.floor(s / 3600) * 24).padStart(2, '0');
     const mm = String(Math.floor((s % 3600) / 60)).padStart(2, '0');
     const ss = String(s % 60).padStart(2, '0');
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.465917ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.061583ms)
  ✔ empty input is safe (0.048ms)
  ✔ single sample → mean=value, std=0 (0.049583ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.059208ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.058166ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce Na

[Killed] ArithmeticOperator
traces.js:290:34
   // Works for recording offsets that may wrap past midnight.
   function secToHHMMSS(totalSec) {
     const s = Math.floor(totalSec) % 86400;
-    const hh = String(Math.floor(s / 3600) % 24).padStart(2, '0');
+    const hh = String(Math.floor(s * 3600) % 24).padStart(2, '0');
     const mm = String(Math.floor((s % 3600) / 60)).padStart(2, '0');
     const ss = String(s % 60).padStart(2, '0');
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.476541ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.063875ms)
  ✔ empty input is safe (0.053958ms)
  ✔ single sample → mean=value, std=0 (0.049083ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.069792ms)

[Killed] ArithmeticOperator
traces.js:291:35
   function secToHHMMSS(totalSec) {
     const s = Math.floor(totalSec) % 86400;
     const hh = String(Math.floor(s / 3600) % 24).padStart(2, '0');
-    const mm = String(Math.floor((s % 3600) / 60)).padStart(2, '0');
+    const mm = String(Math.floor((s * 3600) / 60)).padStart(2, '0');
     const ss = String(s % 60).padStart(2, '0');
     return `${hh}:${mm}:${ss}`;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.478209ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.063542ms)
  ✔ empty input is safe (0.045375ms)
  ✔ single sample → mean=value, std=0 (0.05ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.056708ms)

[Killed] ArithmeticOperator
traces.js:291:34
   function secToHHMMSS(totalSec) {
     const s = Math.floor(totalSec) % 86400;
     const hh = String(Math.floor(s / 3600) % 24).padStart(2, '0');
-    const mm = String(Math.floor((s % 3600) / 60)).padStart(2, '0');
+    const mm = String(Math.floor(s % 3600 * 60)).padStart(2, '0');
     const ss = String(s % 60).padStart(2, '0');
     return `${hh}:${mm}:${ss}`;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.473416ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.072916ms)
  ✔ empty input is safe (0.048209ms)

  ✔ single sample → mean=value, std=0 (0.048666ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.06825ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.055292ms)

[Killed] ArithmeticOperator
traces.js:292:23
     const s = Math.floor(totalSec) % 86400;
     const hh = String(Math.floor(s / 3600) % 24).padStart(2, '0');
     const mm = String(Math.floor((s % 3600) / 60)).padStart(2, '0');
-    const ss = String(s % 60).padStart(2, '0');
+    const ss = String(s * 60).padStart(2, '0');
     return `${hh}:${mm}:${ss}`;
   }
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.478709ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.064917ms)
  ✔ empty input is safe (0.055459ms)
  ✔ single sample → mean=value, std=0 (0.050334ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.059459ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.058916ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] StringLiteral
traces.js:292:43
     const s = Math.floor(totalSec) % 86400;
     const hh = String(Math.floor(s / 3600) % 24).padStart(2, '0');
     const mm = String(Math.floor((s % 3600) / 60)).padStart(2, '0');
-    const ss = String(s % 60).padStart(2, '0');
+    const ss = String(s % 60).padStart(2, "");
     return `${hh}:${mm}:${ss}`;
   }
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.492375ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.062ms)

  ✔ empty input is safe (0.049625ms)
  ✔ single sample → mean=value, std=0 (0.061375ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.057125ms)

[Killed] StringLiteral
traces.js:293:12
     const hh = String(Math.floor(s / 3600) % 24).padStart(2, '0');
     const mm = String(Math.floor((s % 3600) / 60)).padStart(2, '0');
     const ss = String(s % 60).padStart(2, '0');
-    return `${hh}:${mm}:${ss}`;
+    return ``;
   }
 
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.48ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.064208ms)
  ✔ empty input is safe (0.0485ms)
  ✔ single sample → mean=value, std=0 (0.060042ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.056959ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.073042ms)
