[Killed] BlockStatement
traces.js:299:34
   // Parse an ISO 8601 string "YYYY-MM-DDTHH:MM:SS" and return the
   // number of seconds since midnight (i.e. time-of-day portion only).
   // Returns null if the string is not parseable.
-  function isoToSecOfDay(isoStr) {
-    if (!isoStr) return null;
-    const m = isoStr.match(/T(\d{2}):(\d{2}):(\d{2})/);
-    if (!m) return null;
-    return parseInt(m[1], 10) * 3600 + parseInt(m[2], 10) * 60 + parseInt(m[3], 10);
-  }
+  function isoToSecOfDay(isoStr) {}
 
   // Compute tick positions and labels; returns { ticks: [{t, label}], step }.
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.995542ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.178875ms)
  ✔ empty input is safe (0.149917ms)
  ✔ single sample → mean=value, std=0 (0.286875ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.209792ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.551291ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] ConditionalExpression
traces.js:300:9
   // number of seconds since midnight (i.e. time-of-day portion only).
   // Returns null if the string is not parseable.
   function isoToSecOfDay(isoStr) {
-    if (!isoStr) return null;
+    if (false) return null;
     const m = isoStr.match(/T(\d{2}):(\d{2}):(\d{2})/);
     if (!m) return null;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.476208ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.061625ms)
  ✔ empty input is safe (0.047125ms)
  ✔ single sample → mean=value, std=0 (0.048625ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.072166ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.0585ms)

[Killed] ConditionalExpression
traces.js:300:9
   // number of seconds since midnight (i.e. time-of-day portion only).
   // Returns null if the string is not parseable.
   function isoToSecOfDay(isoStr) {
-    if (!isoStr) return null;
+    if (true) return null;
     const m = isoStr.match(/T(\d{2}):(\d{2}):(\d{2})/);
     if (!m) return null;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.473292ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.061625ms)
  ✔ empty input is safe (0.048375ms)
  ✔ single sample → mean=value, std=0 (0.066208ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.057708ms)

[Killed] Regex
traces.js:301:28
   // Returns null if the string is not parseable.
   function isoToSecOfDay(isoStr) {
     if (!isoStr) return null;
-    const m = isoStr.match(/T(\d{2}):(\d{2}):(\d{2})/);
+    const m = isoStr.match(/T(\d{2}):(\d):(\d{2})/);
     if (!m) return null;
     return parseInt(m[1], 10) * 3600 + parseInt(m[2], 10) * 60 + parseInt(m[3], 10);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.504167ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.065166ms)
  ✔ empty input is safe (0.050625ms)
  ✔ single sample → mean=value, std=0 (0.058041ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.069833ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.058792ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] BooleanLiteral
traces.js:302:9
   function isoToSecOfDay(isoStr) {
     if (!isoStr) return null;
     const m = isoStr.match(/T(\d{2}):(\d{2}):(\d{2})/);
-    if (!m) return null;
+    if (m) return null;
     return parseInt(m[1], 10) * 3600 + parseInt(m[2], 10) * 60 + parseInt(m[3], 10);
   }
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (1.030542ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.145334ms)
  ✔ empty input is safe (0.106375ms)
  ✔ single sample → mean=value, std=0 (0.105042ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.148333ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.217167ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] ConditionalExpression
traces.js:302:9
   function isoToSecOfDay(isoStr) {
     if (!isoStr) return null;
     const m = isoStr.match(/T(\d{2}):(\d{2}):(\d{2})/);
-    if (!m) return null;
+    if (true) return null;
     return parseInt(m[1], 10) * 3600 + parseInt(m[2], 10) * 60 + parseInt(m[3], 10);
   }
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.471ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.062625ms)
  ✔ empty input is safe (0.048375ms)
  ✔ single sample → mean=value, std=0 (0.052042ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.072458ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.056208ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce Na

[Killed] ArithmeticOperator
traces.js:303:12
     if (!isoStr) return null;
     const m = isoStr.match(/T(\d{2}):(\d{2}):(\d{2})/);
     if (!m) return null;
-    return parseInt(m[1], 10) * 3600 + parseInt(m[2], 10) * 60 + parseInt(m[3], 10);
+    return parseInt(m[1], 10) * 3600 - parseInt(m[2], 10) * 60 + parseInt(m[3], 10);
   }
 
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.466708ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.062958ms)
  ✔ empty input is safe (0.045209ms)
  ✔ single sample → mean=value, std=0 (0.058625ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.059583ms)

[Killed] ArithmeticOperator
traces.js:303:12
     if (!isoStr) return null;
     const m = isoStr.match(/T(\d{2}):(\d{2}):(\d{2})/);
     if (!m) return null;
-    return parseInt(m[1], 10) * 3600 + parseInt(m[2], 10) * 60 + parseInt(m[3], 10);
+    return parseInt(m[1], 10) * 3600 + parseInt(m[2], 10) * 60 - parseInt(m[3], 10);
   }
 
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.478916ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.063667ms)
  ✔ empty input is safe (0.045958ms)
  ✔ single sample → mean=value, std=0 (0.048375ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.060167ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.056459ms)

[Killed] BlockStatement
traces.js:309:75
   // Compute tick positions and labels; returns { ticks: [{t, label}], step }.
   // When time_mode === 'clock' AND recording_start_iso is set, labels are
   // HH:MM:SS; otherwise labels are relative numeric strings.
-  function computeTimeTicks(t0Sec, t1Sec, time_mode, recording_start_iso) {
-    const span = t1Sec - t0Sec;
-    const niceSteps = [0.01, 0.02, 0.05, 0.1, 0.2, 0.5, 1, 2, 5, 10, 30, 60];
-    const target = span / 7;
-    let step = niceSteps[0];
-    for (const s of niceSteps) if (s <= target) step = s;
-    const first = Math.ceil(t0Sec / step) * step;
-
-    const useClock = time_mode === 'clock' && !!recording_start_iso;
-    const startSecOfDay = useClock ? isoToSecOfDay(recording_start_iso) : null;
-
-    const ticks = [];
-    for (let t = first; t <= t1Sec + 1e-9; t += step) {
-      let label;
-      if (useClock && startSecOfDay !== null) {
-        label = secToHHMMSS(startSecOfDay + t);
-      } else {
-        label = t.toFixed(step >= 1 ? 0 : 2);
-      }
-      ticks.push({ t, label });
-    }
-    return { ticks, step, useClock };
-  }
+  function computeTimeTicks(t0Sec, t1Sec, time_mode, recording_start_iso) {}
 
   function drawTimeAxis(ctx, x0, x1, y, t0Sec, t1Sec, time_mode, recording_start_iso) {
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.495458ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.064041ms)
  ✔ empty input is safe (0.050708ms)
  ✔ single sample → mean=value, std=0 (0.0495ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.074625ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.055417ms)

[Killed] ArithmeticOperator
traces.js:310:18
   // When time_mode === 'clock' AND recording_start_iso is set, labels are
   // HH:MM:SS; otherwise labels are relative numeric strings.
   function computeTimeTicks(t0Sec, t1Sec, time_mode, recording_start_iso) {
-    const span = t1Sec - t0Sec;
+    const span = t1Sec + t0Sec;
     const niceSteps = [0.01, 0.02, 0.05, 0.1, 0.2, 0.5, 1, 2, 5, 10, 30, 60];
     const target = span / 7;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (1.661333ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.146416ms)
  ✔ empty input is safe (0.11175ms)
  ✔ single sample → mean=value, std=0 (0.104625ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.188458ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.207583ms)

[Killed] ArithmeticOperator
traces.js:312:20
   function computeTimeTicks(t0Sec, t1Sec, time_mode, recording_start_iso) {
     const span = t1Sec - t0Sec;
     const niceSteps = [0.01, 0.02, 0.05, 0.1, 0.2, 0.5, 1, 2, 5, 10, 30, 60];
-    const target = span / 7;
+    const target = span * 7;
     let step = niceSteps[0];
     for (const s of niceSteps) if (s <= target) step = s;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.470458ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.060292ms)
  ✔ empty input is safe (0.049583ms)
  ✔ single sample → mean=value, std=0 (0.04875ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.054875ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.054666ms)

[Killed] EqualityOperator
traces.js:314:36
     const niceSteps = [0.01, 0.02, 0.05, 0.1, 0.2, 0.5, 1, 2, 5, 10, 30, 60];
     const target = span / 7;
     let step = niceSteps[0];
-    for (const s of niceSteps) if (s <= target) step = s;
+    for (const s of niceSteps) if (s > target) step = s;
     const first = Math.ceil(t0Sec / step) * step;
 
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.458875ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.059333ms)
  ✔ empty input is safe (0.059834ms)

  ✔ single sample → mean=value, std=0 (0.049334ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.062834ms)

[Killed] ConditionalExpression
traces.js:314:36
     const niceSteps = [0.01, 0.02, 0.05, 0.1, 0.2, 0.5, 1, 2, 5, 10, 30, 60];
     const target = span / 7;
     let step = niceSteps[0];
-    for (const s of niceSteps) if (s <= target) step = s;
+    for (const s of niceSteps) if (false) step = s;
     const first = Math.ceil(t0Sec / step) * step;
 
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (2.982792ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.075208ms)
  ✔ empty input is safe (0.054208ms)
  ✔ single sample → mean=value, std=0 (0.054875ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.061583ms)

[Killed] ArithmeticOperator
traces.js:315:29
     const target = span / 7;
     let step = niceSteps[0];
     for (const s of niceSteps) if (s <= target) step = s;
-    const first = Math.ceil(t0Sec / step) * step;
+    const first = Math.ceil(t0Sec * step) * step;
 
     const useClock = time_mode === 'clock' && !!recording_start_iso;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.558208ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.0715ms)
  ✔ empty input is safe (0.053292ms)
  ✔ single sample → mean=value, std=0 (0.055583ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.084834ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.061208ms)

[Killed] ArithmeticOperator
traces.js:315:19
     const target = span / 7;
     let step = niceSteps[0];
     for (const s of niceSteps) if (s <= target) step = s;
-    const first = Math.ceil(t0Sec / step) * step;
+    const first = Math.ceil(t0Sec / step) / step;
 
     const useClock = time_mode === 'clock' && !!recording_start_iso;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.485708ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.063083ms)
  ✔ empty input is safe (0.05ms)
  ✔ single sample → mean=value, std=0 (0.05075ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.058625ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.058209ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce NaN/

[Killed] BooleanLiteral
traces.js:317:47
     for (const s of niceSteps) if (s <= target) step = s;
     const first = Math.ceil(t0Sec / step) * step;
 
-    const useClock = time_mode === 'clock' && !!recording_start_iso;
+    const useClock = time_mode === 'clock' && !recording_start_iso;
     const startSecOfDay = useClock ? isoToSecOfDay(recording_start_iso) : null;
 
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.479458ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.060459ms)
  ✔ empty input is safe (0.0475ms)
  ✔ single sample → mean=value, std=0 (0.050708ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.06875ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.05625ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce NaN

[Killed] EqualityOperator
traces.js:321:25
     const startSecOfDay = useClock ? isoToSecOfDay(recording_start_iso) : null;
 
     const ticks = [];
-    for (let t = first; t <= t1Sec + 1e-9; t += step) {
+    for (let t = first; t > t1Sec + 1e-9; t += step) {
       let label;
       if (useClock && startSecOfDay !== null) {
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.46875ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.058ms)

  ✔ empty input is safe (0.04525ms)

  ✔ single sample → mean=value, std=0 (0.058958ms)

[Killed] AssignmentOperator
traces.js:321:44
     const startSecOfDay = useClock ? isoToSecOfDay(recording_start_iso) : null;
 
     const ticks = [];
-    for (let t = first; t <= t1Sec + 1e-9; t += step) {
+    for (let t = first; t <= t1Sec + 1e-9; t -= step) {
       let label;
       if (useClock && startSecOfDay !== null) {
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.502583ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.064583ms)
  ✔ empty input is safe (0.049208ms)
  ✔ single sample → mean=value, std=0 (0.049ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.0725ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.054875ms)

[Killed] ConditionalExpression
traces.js:323:11
     const ticks = [];
     for (let t = first; t <= t1Sec + 1e-9; t += step) {
       let label;
-      if (useClock && startSecOfDay !== null) {
+      if (true) {
         label = secToHHMMSS(startSecOfDay + t);
       } else {
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.476542ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.067ms)
  ✔ empty input is safe (0.052666ms)
  ✔ single sample → mean=value, std=0 (0.064417ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.062417ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.060625ms)

[Killed] BlockStatement
traces.js:323:47
     const ticks = [];
     for (let t = first; t <= t1Sec + 1e-9; t += step) {
       let label;
-      if (useClock && startSecOfDay !== null) {
-        label = secToHHMMSS(startSecOfDay + t);
-      } else {
+      if (useClock && startSecOfDay !== null) {} else {
         label = t.toFixed(step >= 1 ? 0 : 2);
       }
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (1.102167ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.145333ms)
  ✔ empty input is safe (0.084917ms)
  ✔ single sample → mean=value, std=0 (0.065417ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.077ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.060833ms)

[Killed] ArithmeticOperator
traces.js:324:29
     for (let t = first; t <= t1Sec + 1e-9; t += step) {
       let label;
       if (useClock && startSecOfDay !== null) {
-        label = secToHHMMSS(startSecOfDay + t);
+        label = secToHHMMSS(startSecOfDay - t);
       } else {
         label = t.toFixed(step >= 1 ? 0 : 2);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.5005ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.063208ms)
  ✔ empty input is safe (0.048625ms)
  ✔ single sample → mean=value, std=0 (0.048458ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.070875ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.053916ms)

[Killed] BlockStatement
traces.js:325:14
       let label;
       if (useClock && startSecOfDay !== null) {
         label = secToHHMMSS(startSecOfDay + t);
-      } else {
-        label = t.toFixed(step >= 1 ? 0 : 2);
-      }
+      } else {}
       ticks.push({ t, label });
     }
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.507334ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.062334ms)
  ✔ empty input is safe (0.049917ms)
  ✔ single sample → mean=value, std=0 (0.051416ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.069583ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.05775ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] ConditionalExpression
traces.js:326:27
       if (useClock && startSecOfDay !== null) {
         label = secToHHMMSS(startSecOfDay + t);
       } else {
-        label = t.toFixed(step >= 1 ? 0 : 2);
+        label = t.toFixed(false ? 0 : 2);
       }
       ticks.push({ t, label });
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.48225ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.061417ms)
  ✔ empty input is safe (0.04775ms)
  ✔ single sample → mean=value, std=0 (0.048833ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.06275ms)

[Killed] EqualityOperator
traces.js:326:27
       if (useClock && startSecOfDay !== null) {
         label = secToHHMMSS(startSecOfDay + t);
       } else {
-        label = t.toFixed(step >= 1 ? 0 : 2);
+        label = t.toFixed(step < 1 ? 0 : 2);
       }
       ticks.push({ t, label });
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.484125ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.062ms)
  ✔ empty input is safe (0.04725ms)
  ✔ single sample → mean=value, std=0 (0.065125ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.0605ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.065583ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce NaN/I

[Killed] ObjectLiteral
traces.js:328:18
       } else {
         label = t.toFixed(step >= 1 ? 0 : 2);
       }
-      ticks.push({ t, label });
+      ticks.push({});
     }
     return { ticks, step, useClock };
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (1.030583ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.294542ms)
  ✔ empty input is safe (0.142625ms)
  ✔ single sample → mean=value, std=0 (0.119167ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.168958ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.174375ms)

[Survived] StringLiteral
traces.js:337:21
     ctx.strokeStyle = AXIS_COLOR;
     ctx.fillStyle = AXIS_COLOR;
     ctx.font = AXIS_FONT;
-    ctx.textAlign = 'center';
+    ctx.textAlign = "";
     ctx.textBaseline = 'top';
     ctx.lineWidth = 1;

[Survived] ArithmeticOperator
traces.js:345:18
     ctx.lineTo(x1, y);
     ctx.stroke();
 
-    const span = t1Sec - t0Sec;
+    const span = t1Sec + t0Sec;
     const { ticks, useClock, step } = computeTimeTicks(t0Sec, t1Sec, time_mode, recording_start_iso);
 

[Killed] ArithmeticOperator
traces.js:351:23
     // Minor ticks: 4 between each major (5 sub-divisions), no labels,
     // shorter (2 px vs 4 px). Visual scaffolding for fine time
     // discrimination without crowding the major-tick labels.
-    const minorStep = step / 5;
+    const minorStep = step * 5;
     const firstMinor = Math.ceil(t0Sec / minorStep) * minorStep;
     ctx.beginPath();
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.495167ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.064417ms)
  ✔ empty input is safe (0.050625ms)
  ✔ single sample → mean=value, std=0 (0.066125ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.0695ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.062167ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce N

[Survived] ArithmeticOperator
traces.js:352:34
     // shorter (2 px vs 4 px). Visual scaffolding for fine time
     // discrimination without crowding the major-tick labels.
     const minorStep = step / 5;
-    const firstMinor = Math.ceil(t0Sec / minorStep) * minorStep;
+    const firstMinor = Math.ceil(t0Sec * minorStep) * minorStep;
     ctx.beginPath();
     for (let t = firstMinor; t <= t1Sec + 1e-9; t += minorStep) {

[Survived] ArithmeticOperator
traces.js:352:24
     // shorter (2 px vs 4 px). Visual scaffolding for fine time
     // discrimination without crowding the major-tick labels.
     const minorStep = step / 5;
-    const firstMinor = Math.ceil(t0Sec / minorStep) * minorStep;
+    const firstMinor = Math.ceil(t0Sec / minorStep) / minorStep;
     ctx.beginPath();
     for (let t = firstMinor; t <= t1Sec + 1e-9; t += minorStep) {

[Killed] BlockStatement
traces.js:354:65
     const minorStep = step / 5;
     const firstMinor = Math.ceil(t0Sec / minorStep) * minorStep;
     ctx.beginPath();
-    for (let t = firstMinor; t <= t1Sec + 1e-9; t += minorStep) {
-      // Skip positions that coincide with a major tick.
-      const r = (t / step);
-      if (Math.abs(r - Math.round(r)) < 1e-6) continue;
-      const x = x0 + ((t - t0Sec) / span) * (x1 - x0);
-      ctx.moveTo(x, y);
-      ctx.lineTo(x, y + 2);
-    }
+    for (let t = firstMinor; t <= t1Sec + 1e-9; t += minorStep) {}
     ctx.stroke();
 
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.557958ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.177875ms)
  ✔ empty input is safe (0.151708ms)
  ✔ single sample → mean=value, std=0 (0.126833ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.145459ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.141333ms)

[Killed] AssignmentOperator
traces.js:354:49
     const minorStep = step / 5;
     const firstMinor = Math.ceil(t0Sec / minorStep) * minorStep;
     ctx.beginPath();
-    for (let t = firstMinor; t <= t1Sec + 1e-9; t += minorStep) {
+    for (let t = firstMinor; t <= t1Sec + 1e-9; t -= minorStep) {
       // Skip positions that coincide with a major tick.
       const r = (t / step);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (2.465333ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.109792ms)
  ✔ empty input is safe (0.058334ms)
  ✔ single sample → mean=value, std=0 (0.056208ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.078042ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.057542ms)

[Survived] ArithmeticOperator
traces.js:356:18
     ctx.beginPath();
     for (let t = firstMinor; t <= t1Sec + 1e-9; t += minorStep) {
       // Skip positions that coincide with a major tick.
-      const r = (t / step);
+      const r = (t * step);
       if (Math.abs(r - Math.round(r)) < 1e-6) continue;
       const x = x0 + ((t - t0Sec) / span) * (x1 - x0);

[Killed] EqualityOperator
traces.js:357:11
     for (let t = firstMinor; t <= t1Sec + 1e-9; t += minorStep) {
       // Skip positions that coincide with a major tick.
       const r = (t / step);
-      if (Math.abs(r - Math.round(r)) < 1e-6) continue;
+      if (Math.abs(r - Math.round(r)) >= 1e-6) continue;
       const x = x0 + ((t - t0Sec) / span) * (x1 - x0);
       ctx.moveTo(x, y);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (1.128958ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.085666ms)
  ✔ empty input is safe (0.055333ms)
  ✔ single sample → mean=value, std=0 (0.0925ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.079667ms)

[Killed] ConditionalExpression
traces.js:357:11
     for (let t = firstMinor; t <= t1Sec + 1e-9; t += minorStep) {
       // Skip positions that coincide with a major tick.
       const r = (t / step);
-      if (Math.abs(r - Math.round(r)) < 1e-6) continue;
+      if (true) continue;
       const x = x0 + ((t - t0Sec) / span) * (x1 - x0);
       ctx.moveTo(x, y);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (1.76325ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.468083ms)
  ✔ empty input is safe (0.171334ms)
  ✔ single sample → mean=value, std=0 (0.319416ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.195083ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.422333ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] ArithmeticOperator
traces.js:358:46
       // Skip positions that coincide with a major tick.
       const r = (t / step);
       if (Math.abs(r - Math.round(r)) < 1e-6) continue;
-      const x = x0 + ((t - t0Sec) / span) * (x1 - x0);
+      const x = x0 + ((t - t0Sec) / span) * (x1 + x0);
       ctx.moveTo(x, y);
       ctx.lineTo(x, y + 2);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (1.091917ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.232125ms)
  ✔ empty input is safe (0.149959ms)
  ✔ single sample → mean=value, std=0 (0.188208ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.241708ms)

[Killed] ArithmeticOperator
traces.js:358:22
       // Skip positions that coincide with a major tick.
       const r = (t / step);
       if (Math.abs(r - Math.round(r)) < 1e-6) continue;
-      const x = x0 + ((t - t0Sec) / span) * (x1 - x0);
+      const x = x0 + (t - t0Sec) / span / (x1 - x0);
       ctx.moveTo(x, y);
       ctx.lineTo(x, y + 2);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.512583ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.063792ms)
  ✔ empty input is safe (0.0505ms)
  ✔ single sample → mean=value, std=0 (0.532584ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (1.315875ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.313667ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce N

[Survived] ArithmeticOperator
traces.js:360:21
       if (Math.abs(r - Math.round(r)) < 1e-6) continue;
       const x = x0 + ((t - t0Sec) / span) * (x1 - x0);
       ctx.moveTo(x, y);
-      ctx.lineTo(x, y + 2);
+      ctx.lineTo(x, y - 2);
     }
     ctx.stroke();

[Killed] BlockStatement
traces.js:365:39
     ctx.stroke();
 
     ctx.beginPath();
-    for (const { t, label } of ticks) {
-      const x = x0 + ((t - t0Sec) / span) * (x1 - x0);
-      ctx.moveTo(x, y);
-      ctx.lineTo(x, y + 4);
-      ctx.fillText(useClock ? label : label + ' s', x, y + 6);
-    }
+    for (const { t, label } of ticks) {}
     ctx.stroke();
 
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.720334ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.146959ms)
  ✔ empty input is safe (0.062458ms)
  ✔ single sample → mean=value, std=0 (0.0705ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.066ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.058958ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce NaN/

[Killed] ArithmeticOperator
traces.js:366:23
 
     ctx.beginPath();
     for (const { t, label } of ticks) {
-      const x = x0 + ((t - t0Sec) / span) * (x1 - x0);
+      const x = x0 + ((t - t0Sec) * span) * (x1 - x0);
       ctx.moveTo(x, y);
       ctx.lineTo(x, y + 4);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.504625ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.084375ms)
  ✔ empty input is safe (0.319292ms)
  ✔ single sample → mean=value, std=0 (0.097416ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.0795ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.066166ms)

[Killed] ArithmeticOperator
traces.js:366:17
 
     ctx.beginPath();
     for (const { t, label } of ticks) {
-      const x = x0 + ((t - t0Sec) / span) * (x1 - x0);
+      const x = x0 - (t - t0Sec) / span * (x1 - x0);
       ctx.moveTo(x, y);
       ctx.lineTo(x, y + 4);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (1.07375ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.086583ms)
  ✔ empty input is safe (0.056458ms)
  ✔ single sample → mean=value, std=0 (0.282833ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.289792ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.280167ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] ArithmeticOperator
traces.js:368:21
     for (const { t, label } of ticks) {
       const x = x0 + ((t - t0Sec) / span) * (x1 - x0);
       ctx.moveTo(x, y);
-      ctx.lineTo(x, y + 4);
+      ctx.lineTo(x, y - 4);
       ctx.fillText(useClock ? label : label + ' s', x, y + 6);
     }
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.560292ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.11425ms)
  ✔ empty input is safe (0.066458ms)
  ✔ single sample → mean=value, std=0 (0.532208ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.229459ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.153208ms)
