[Killed] ArithmeticOperator
traces.js:369:56
       const x = x0 + ((t - t0Sec) / span) * (x1 - x0);
       ctx.moveTo(x, y);
       ctx.lineTo(x, y + 4);
-      ctx.fillText(useClock ? label : label + ' s', x, y + 6);
+      ctx.fillText(useClock ? label : label + ' s', x, y - 6);
     }
     ctx.stroke();
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (13.789125ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.122916ms)
  ✔ empty input is safe (0.120666ms)
  ✔ single sample → mean=value, std=0 (0.05675ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.066208ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.058084ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Survived] ArrowFunction
traces.js:373:22
     }
     ctx.stroke();
 
-    return ticks.map(tk => tk.label);
+    return ticks.map(() => undefined);
   }
 

[Killed] BlockStatement
traces.js:383:45
   // does that inside one synchronous draw pass).
   let _scratchMn = new Float32Array(0);
   let _scratchMx = new Float32Array(0);
-  function decimateMinMax(data, n, nPixels) {
-    if (_scratchMn.length < nPixels) {
-      _scratchMn = new Float32Array(nPixels);
-      _scratchMx = new Float32Array(nPixels);
-    }
-    const mn = _scratchMn, mx = _scratchMx;
-    if (n <= 0 || nPixels <= 0) return { mn, mx };
-    const step = n / nPixels;
-    let from = 0;
-    for (let p = 0; p < nPixels; p++) {
-      const to = (p === nPixels - 1) ? n : Math.floor((p + 1) * step);
-      let lo = data[from], hi = lo;
-      for (let i = from + 1; i < to; i++) {
-        const v = data[i];
-        if (v < lo) lo = v;
-        else if (v > hi) hi = v;
-      }
-      mn[p] = lo; mx[p] = hi;
-      from = to;
-    }
-    return { mn, mx };
-  }
+  function decimateMinMax(data, n, nPixels) {}
 
   function drawChannelDecimated(ctx, data, nVisible, plotX0, plotW, yCenter, vToPx) {
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.50925ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.064375ms)
  ✔ empty input is safe (0.050584ms)
  ✔ single sample → mean=value, std=0 (0.053792ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.060667ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.058167ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] BlockStatement
traces.js:384:38
   let _scratchMn = new Float32Array(0);
   let _scratchMx = new Float32Array(0);
   function decimateMinMax(data, n, nPixels) {
-    if (_scratchMn.length < nPixels) {
-      _scratchMn = new Float32Array(nPixels);
-      _scratchMx = new Float32Array(nPixels);
-    }
+    if (_scratchMn.length < nPixels) {}
     const mn = _scratchMn, mx = _scratchMx;
     if (n <= 0 || nPixels <= 0) return { mn, mx };
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (2.559875ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.186ms)
  ✔ empty input is safe (1.13975ms)
  ✔ single sample → mean=value, std=0 (0.357084ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.267ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.144209ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce NaN/In

[Killed] ConditionalExpression
traces.js:384:9
   let _scratchMn = new Float32Array(0);
   let _scratchMx = new Float32Array(0);
   function decimateMinMax(data, n, nPixels) {
-    if (_scratchMn.length < nPixels) {
+    if (false) {
       _scratchMn = new Float32Array(nPixels);
       _scratchMx = new Float32Array(nPixels);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.852667ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.089584ms)
  ✔ empty input is safe (0.114583ms)
  ✔ single sample → mean=value, std=0 (0.084958ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.098333ms)

[Killed] EqualityOperator
traces.js:389:19
       _scratchMx = new Float32Array(nPixels);
     }
     const mn = _scratchMn, mx = _scratchMx;
-    if (n <= 0 || nPixels <= 0) return { mn, mx };
+    if (n <= 0 || nPixels > 0) return { mn, mx };
     const step = n / nPixels;
     let from = 0;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (8.057916ms)
  ✔ ±1 alternating → mean≈0, std≈1 (2.520458ms)
  ✔ empty input is safe (0.143875ms)
  ✔ single sample → mean=value, std=0 (0.136875ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.114708ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.1735ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce N

[Killed] ConditionalExpression
traces.js:389:9
       _scratchMx = new Float32Array(nPixels);
     }
     const mn = _scratchMn, mx = _scratchMx;
-    if (n <= 0 || nPixels <= 0) return { mn, mx };
+    if (true) return { mn, mx };
     const step = n / nPixels;
     let from = 0;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (1.172459ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.199125ms)
  ✔ empty input is safe (0.125541ms)
  ✔ single sample → mean=value, std=0 (0.168333ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.135583ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.13525ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Timeout] ArithmeticOperator
traces.js:390:18
     }
     const mn = _scratchMn, mx = _scratchMx;
     if (n <= 0 || nPixels <= 0) return { mn, mx };
-    const step = n / nPixels;
+    const step = n * nPixels;
     let from = 0;
     for (let p = 0; p < nPixels; p++) {

[Killed] BlockStatement
traces.js:392:39
     if (n <= 0 || nPixels <= 0) return { mn, mx };
     const step = n / nPixels;
     let from = 0;
-    for (let p = 0; p < nPixels; p++) {
-      const to = (p === nPixels - 1) ? n : Math.floor((p + 1) * step);
-      let lo = data[from], hi = lo;
-      for (let i = from + 1; i < to; i++) {
-        const v = data[i];
-        if (v < lo) lo = v;
-        else if (v > hi) hi = v;
-      }
-      mn[p] = lo; mx[p] = hi;
-      from = to;
-    }
+    for (let p = 0; p < nPixels; p++) {}
     return { mn, mx };
   }
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (2.008125ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.103875ms)
  ✔ empty input is safe (0.067208ms)
  ✔ single sample → mean=value, std=0 (0.055667ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.064916ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.061167ms)

[Killed] EqualityOperator
traces.js:392:21
     if (n <= 0 || nPixels <= 0) return { mn, mx };
     const step = n / nPixels;
     let from = 0;
-    for (let p = 0; p < nPixels; p++) {
+    for (let p = 0; p >= nPixels; p++) {
       const to = (p === nPixels - 1) ? n : Math.floor((p + 1) * step);
       let lo = data[from], hi = lo;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.559875ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.101541ms)
  ✔ empty input is safe (0.060042ms)

  ✔ single sample → mean=value, std=0 (0.211834ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.169583ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.126791ms)

[Killed] ArithmeticOperator
traces.js:393:56
     const step = n / nPixels;
     let from = 0;
     for (let p = 0; p < nPixels; p++) {
-      const to = (p === nPixels - 1) ? n : Math.floor((p + 1) * step);
+      const to = (p === nPixels - 1) ? n : Math.floor((p - 1) * step);
       let lo = data[from], hi = lo;
       for (let i = from + 1; i < to; i++) {
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.479667ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.117083ms)
  ✔ empty input is safe (0.065333ms)
  ✔ single sample → mean=value, std=0 (0.078125ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.108583ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.073292ms)

[Killed] ArithmeticOperator
traces.js:393:55
     const step = n / nPixels;
     let from = 0;
     for (let p = 0; p < nPixels; p++) {
-      const to = (p === nPixels - 1) ? n : Math.floor((p + 1) * step);
+      const to = (p === nPixels - 1) ? n : Math.floor((p + 1) / step);
       let lo = data[from], hi = lo;
       for (let i = from + 1; i < to; i++) {
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.491584ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.060958ms)
  ✔ empty input is safe (0.063875ms)
  ✔ single sample → mean=value, std=0 (0.055959ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.057792ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.056875ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] BlockStatement
traces.js:395:43
     for (let p = 0; p < nPixels; p++) {
       const to = (p === nPixels - 1) ? n : Math.floor((p + 1) * step);
       let lo = data[from], hi = lo;
-      for (let i = from + 1; i < to; i++) {
-        const v = data[i];
-        if (v < lo) lo = v;
-        else if (v > hi) hi = v;
-      }
+      for (let i = from + 1; i < to; i++) {}
       mn[p] = lo; mx[p] = hi;
       from = to;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.46575ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.061208ms)
  ✔ empty input is safe (0.047917ms)
  ✔ single sample → mean=value, std=0 (0.060625ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.056833ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.055ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce NaN

[Killed] ArithmeticOperator
traces.js:395:20
     for (let p = 0; p < nPixels; p++) {
       const to = (p === nPixels - 1) ? n : Math.floor((p + 1) * step);
       let lo = data[from], hi = lo;
-      for (let i = from + 1; i < to; i++) {
+      for (let i = from - 1; i < to; i++) {
         const v = data[i];
         if (v < lo) lo = v;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.460625ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.061834ms)
  ✔ empty input is safe (0.047584ms)
  ✔ single sample → mean=value, std=0 (0.052625ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.075333ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.058875ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] ConditionalExpression
traces.js:397:13
       let lo = data[from], hi = lo;
       for (let i = from + 1; i < to; i++) {
         const v = data[i];
-        if (v < lo) lo = v;
+        if (true) lo = v;
         else if (v > hi) hi = v;
       }
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.467833ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.058208ms)
  ✔ empty input is safe (0.047666ms)
  ✔ single sample → mean=value, std=0 (0.046917ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.055958ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.053125ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] EqualityOperator
traces.js:397:13
       let lo = data[from], hi = lo;
       for (let i = from + 1; i < to; i++) {
         const v = data[i];
-        if (v < lo) lo = v;
+        if (v >= lo) lo = v;
         else if (v > hi) hi = v;
       }
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.529417ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.06675ms)
  ✔ empty input is safe (0.051708ms)
  ✔ single sample → mean=value, std=0 (0.070583ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.06325ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.059542ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce N

[Killed] ConditionalExpression
traces.js:398:18
       for (let i = from + 1; i < to; i++) {
         const v = data[i];
         if (v < lo) lo = v;
-        else if (v > hi) hi = v;
+        else if (false) hi = v;
       }
       mn[p] = lo; mx[p] = hi;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.485458ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.062375ms)
  ✔ empty input is safe (0.049875ms)
  ✔ single sample → mean=value, std=0 (0.054292ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.063375ms)

[Killed] ConditionalExpression
traces.js:398:18
       for (let i = from + 1; i < to; i++) {
         const v = data[i];
         if (v < lo) lo = v;
-        else if (v > hi) hi = v;
+        else if (true) hi = v;
       }
       mn[p] = lo; mx[p] = hi;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.503584ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.065917ms)
  ✔ empty input is safe (0.063625ms)
  ✔ single sample → mean=value, std=0 (0.054291ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.059833ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.057ms)

[Killed] ObjectLiteral
traces.js:403:12
       mn[p] = lo; mx[p] = hi;
       from = to;
     }
-    return { mn, mx };
+    return {};
   }
 
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.462875ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.059958ms)
  ✔ empty input is safe (0.052ms)
  ✔ single sample → mean=value, std=0 (0.058291ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.0595ms)

[Killed] BlockStatement
traces.js:406:85
     return { mn, mx };
   }
 
-  function drawChannelDecimated(ctx, data, nVisible, plotX0, plotW, yCenter, vToPx) {
-    const nPixels = Math.max(1, Math.floor(plotW));
-    const { mn, mx } = decimateMinMax(data, nVisible, nPixels);
-    ctx.beginPath();
-    for (let p = 0; p < nPixels; p++) {
-      const x = plotX0 + p;
-      ctx.moveTo(x, yCenter - mx[p] * vToPx);
-      ctx.lineTo(x, yCenter - mn[p] * vToPx);
-    }
-    ctx.stroke();
-  }
+  function drawChannelDecimated(ctx, data, nVisible, plotX0, plotW, yCenter, vToPx) {}
 
   function drawChannelPolyline(ctx, data, nVisible, plotX0, plotW, yCenter, vToPx) {
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.503333ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.062292ms)
  ✔ empty input is safe (0.048417ms)
  ✔ single sample → mean=value, std=0 (0.061667ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.061167ms)

[Survived] MethodExpression
traces.js:407:21
   }
 
   function drawChannelDecimated(ctx, data, nVisible, plotX0, plotW, yCenter, vToPx) {
-    const nPixels = Math.max(1, Math.floor(plotW));
+    const nPixels = Math.min(1, Math.floor(plotW));
     const { mn, mx } = decimateMinMax(data, nVisible, nPixels);
     ctx.beginPath();

[Killed] BlockStatement
traces.js:410:39
     const nPixels = Math.max(1, Math.floor(plotW));
     const { mn, mx } = decimateMinMax(data, nVisible, nPixels);
     ctx.beginPath();
-    for (let p = 0; p < nPixels; p++) {
-      const x = plotX0 + p;
-      ctx.moveTo(x, yCenter - mx[p] * vToPx);
-      ctx.lineTo(x, yCenter - mn[p] * vToPx);
-    }
+    for (let p = 0; p < nPixels; p++) {}
     ctx.stroke();
   }
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.491084ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.061459ms)
  ✔ empty input is safe (0.065166ms)

  ✔ single sample → mean=value, std=0 (0.049958ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.058666ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.055416ms)

[Killed] UpdateOperator
traces.js:410:34
     const nPixels = Math.max(1, Math.floor(plotW));
     const { mn, mx } = decimateMinMax(data, nVisible, nPixels);
     ctx.beginPath();
-    for (let p = 0; p < nPixels; p++) {
+    for (let p = 0; p < nPixels; p--) {
       const x = plotX0 + p;
       ctx.moveTo(x, yCenter - mx[p] * vToPx);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.508875ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.069625ms)
  ✔ empty input is safe (0.049625ms)
  ✔ single sample → mean=value, std=0 (0.067333ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.061625ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.055666ms)

[Survived] ArithmeticOperator
traces.js:411:17
     const { mn, mx } = decimateMinMax(data, nVisible, nPixels);
     ctx.beginPath();
     for (let p = 0; p < nPixels; p++) {
-      const x = plotX0 + p;
+      const x = plotX0 - p;
       ctx.moveTo(x, yCenter - mx[p] * vToPx);
       ctx.lineTo(x, yCenter - mn[p] * vToPx);

[Survived] ArithmeticOperator
traces.js:412:31
     ctx.beginPath();
     for (let p = 0; p < nPixels; p++) {
       const x = plotX0 + p;
-      ctx.moveTo(x, yCenter - mx[p] * vToPx);
+      ctx.moveTo(x, yCenter - mx[p] / vToPx);
       ctx.lineTo(x, yCenter - mn[p] * vToPx);
     }

[Survived] ArithmeticOperator
traces.js:412:21
     ctx.beginPath();
     for (let p = 0; p < nPixels; p++) {
       const x = plotX0 + p;
-      ctx.moveTo(x, yCenter - mx[p] * vToPx);
+      ctx.moveTo(x, yCenter + mx[p] * vToPx);
       ctx.lineTo(x, yCenter - mn[p] * vToPx);
     }

[Survived] ArithmeticOperator
traces.js:413:31
     for (let p = 0; p < nPixels; p++) {
       const x = plotX0 + p;
       ctx.moveTo(x, yCenter - mx[p] * vToPx);
-      ctx.lineTo(x, yCenter - mn[p] * vToPx);
+      ctx.lineTo(x, yCenter - mn[p] / vToPx);
     }
     ctx.stroke();

[Survived] ArithmeticOperator
traces.js:413:21
     for (let p = 0; p < nPixels; p++) {
       const x = plotX0 + p;
       ctx.moveTo(x, yCenter - mx[p] * vToPx);
-      ctx.lineTo(x, yCenter - mn[p] * vToPx);
+      ctx.lineTo(x, yCenter + mn[p] * vToPx);
     }
     ctx.stroke();

[Killed] BlockStatement
traces.js:418:84
     ctx.stroke();
   }
 
-  function drawChannelPolyline(ctx, data, nVisible, plotX0, plotW, yCenter, vToPx) {
-    if (nVisible <= 0) return;
-    const dx = plotW / Math.max(1, nVisible - 1);
-    ctx.beginPath();
-    ctx.moveTo(plotX0, yCenter - data[0] * vToPx);
-    for (let s = 1; s < nVisible; s++) {
-      ctx.lineTo(plotX0 + s * dx, yCenter - data[s] * vToPx);
-    }
-    ctx.stroke();
-  }
+  function drawChannelPolyline(ctx, data, nVisible, plotX0, plotW, yCenter, vToPx) {}
 
   // Single entry point. `channels` is a per-channel typed-array
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.498916ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.063708ms)
  ✔ empty input is safe (0.061833ms)
  ✔ single sample → mean=value, std=0 (0.04875ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.058666ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.054334ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] ConditionalExpression
traces.js:419:9
   }
 
   function drawChannelPolyline(ctx, data, nVisible, plotX0, plotW, yCenter, vToPx) {
-    if (nVisible <= 0) return;
+    if (true) return;
     const dx = plotW / Math.max(1, nVisible - 1);
     ctx.beginPath();
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.472625ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.065083ms)
  ✔ empty input is safe (0.060959ms)

  ✔ single sample → mean=value, std=0 (0.049125ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.058917ms)

[Killed] EqualityOperator
traces.js:419:9
   }
 
   function drawChannelPolyline(ctx, data, nVisible, plotX0, plotW, yCenter, vToPx) {
-    if (nVisible <= 0) return;
+    if (nVisible > 0) return;
     const dx = plotW / Math.max(1, nVisible - 1);
     ctx.beginPath();
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.466083ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.064125ms)
  ✔ empty input is safe (0.055542ms)

  ✔ single sample → mean=value, std=0 (0.057625ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.056416ms)

[Killed] MethodExpression
traces.js:420:24
 
   function drawChannelPolyline(ctx, data, nVisible, plotX0, plotW, yCenter, vToPx) {
     if (nVisible <= 0) return;
-    const dx = plotW / Math.max(1, nVisible - 1);
+    const dx = plotW / Math.min(1, nVisible - 1);
     ctx.beginPath();
     ctx.moveTo(plotX0, yCenter - data[0] * vToPx);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.491958ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.063125ms)
  ✔ empty input is safe (0.0665ms)
  ✔ single sample → mean=value, std=0 (0.05325ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.060583ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.057542ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce Na

[Killed] ArithmeticOperator
traces.js:420:16
 
   function drawChannelPolyline(ctx, data, nVisible, plotX0, plotW, yCenter, vToPx) {
     if (nVisible <= 0) return;
-    const dx = plotW / Math.max(1, nVisible - 1);
+    const dx = plotW * Math.max(1, nVisible - 1);
     ctx.beginPath();
     ctx.moveTo(plotX0, yCenter - data[0] * vToPx);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.494292ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.063583ms)
  ✔ empty input is safe (0.049292ms)
  ✔ single sample → mean=value, std=0 (0.059666ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.062542ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.06ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce NaN

[Survived] ArithmeticOperator
traces.js:422:34
     if (nVisible <= 0) return;
     const dx = plotW / Math.max(1, nVisible - 1);
     ctx.beginPath();
-    ctx.moveTo(plotX0, yCenter - data[0] * vToPx);
+    ctx.moveTo(plotX0, yCenter - data[0] / vToPx);
     for (let s = 1; s < nVisible; s++) {
       ctx.lineTo(plotX0 + s * dx, yCenter - data[s] * vToPx);

[Survived] ArithmeticOperator
traces.js:422:24
     if (nVisible <= 0) return;
     const dx = plotW / Math.max(1, nVisible - 1);
     ctx.beginPath();
-    ctx.moveTo(plotX0, yCenter - data[0] * vToPx);
+    ctx.moveTo(plotX0, yCenter + data[0] * vToPx);
     for (let s = 1; s < nVisible; s++) {
       ctx.lineTo(plotX0 + s * dx, yCenter - data[s] * vToPx);

[Killed] BlockStatement
traces.js:423:40
     const dx = plotW / Math.max(1, nVisible - 1);
     ctx.beginPath();
     ctx.moveTo(plotX0, yCenter - data[0] * vToPx);
-    for (let s = 1; s < nVisible; s++) {
-      ctx.lineTo(plotX0 + s * dx, yCenter - data[s] * vToPx);
-    }
+    for (let s = 1; s < nVisible; s++) {}
     ctx.stroke();
   }
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.484708ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.063334ms)
  ✔ empty input is safe (0.048958ms)
  ✔ single sample → mean=value, std=0 (0.055375ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.063ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.059792ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce Na

[Killed] UpdateOperator
traces.js:423:35
     const dx = plotW / Math.max(1, nVisible - 1);
     ctx.beginPath();
     ctx.moveTo(plotX0, yCenter - data[0] * vToPx);
-    for (let s = 1; s < nVisible; s++) {
+    for (let s = 1; s < nVisible; s--) {
       ctx.lineTo(plotX0 + s * dx, yCenter - data[s] * vToPx);
     }
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.474125ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.066167ms)
  ✔ empty input is safe (0.052666ms)
  ✔ single sample → mean=value, std=0 (0.054209ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.062ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.060084ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce Na

[Killed] ArithmeticOperator
traces.js:424:27
     ctx.beginPath();
     ctx.moveTo(plotX0, yCenter - data[0] * vToPx);
     for (let s = 1; s < nVisible; s++) {
-      ctx.lineTo(plotX0 + s * dx, yCenter - data[s] * vToPx);
+      ctx.lineTo(plotX0 + s / dx, yCenter - data[s] * vToPx);
     }
     ctx.stroke();
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (8.12675ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.08525ms)

  ✔ empty input is safe (0.054916ms)
  ✔ single sample → mean=value, std=0 (0.053208ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.0755ms)

[Killed] ArithmeticOperator
traces.js:424:18
     ctx.beginPath();
     ctx.moveTo(plotX0, yCenter - data[0] * vToPx);
     for (let s = 1; s < nVisible; s++) {
-      ctx.lineTo(plotX0 + s * dx, yCenter - data[s] * vToPx);
+      ctx.lineTo(plotX0 - s * dx, yCenter - data[s] * vToPx);
     }
     ctx.stroke();
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.483375ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.059625ms)
  ✔ empty input is safe (0.06425ms)
  ✔ single sample → mean=value, std=0 (0.051ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.06025ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.053958ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce NaN/

[Survived] StringLiteral
traces.js:443:35
   // the old frame) and subsequent chunks with partial_fill.
   function draw(canvas, opts) {
     const { dpr, cssW, cssH } = deviceFitCanvas(canvas);
-    const ctx = canvas.getContext('2d');
+    const ctx = canvas.getContext("");
     ctx.setTransform(dpr, 0, 0, dpr, 0, 0);
 

[Killed] ConditionalExpression
traces.js:455:9
     // new chunk's band. The polyline x-mapping (downstream) still uses
     // `total_samples` so the partial data lands in its real x position.
     const partialFill = opts.partial_fill;
-    if (partialFill) {
+    if (true) {
       if (partialFill.full_clear) {
         clear(ctx, cssW, cssH, opts.transparent === true);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.489542ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.064125ms)
  ✔ empty input is safe (0.049042ms)
  ✔ single sample → mean=value, std=0 (0.062916ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.057875ms)

[Killed] BlockStatement
traces.js:455:22
     // new chunk's band. The polyline x-mapping (downstream) still uses
     // `total_samples` so the partial data lands in its real x position.
     const partialFill = opts.partial_fill;
-    if (partialFill) {
-      if (partialFill.full_clear) {
-        clear(ctx, cssW, cssH, opts.transparent === true);
-      } else {
-        const allChannels0 = opts.channels;
-        const nSamplesTotal = partialFill.total_samples || (allChannels0[0] ? allChannels0[0].length : 0);
-        const plotX0 = PAD_LEFT;
-        const plotX1 = cssW - PAD_RIGHT;
-        const plotW = plotX1 - plotX0;
-        if (nSamplesTotal > 0 && plotW > 0) {
-          const xStart = Math.floor(plotX0 + (partialFill.sample_start / nSamplesTotal) * plotW);
-          const xEnd = Math.ceil(plotX0 + ((partialFill.sample_end + 1) / nSamplesTotal) * plotW);
-          const bandW = Math.max(1, xEnd - xStart);
-          ctx.fillStyle = BG_COLOR;
-          ctx.fillRect(xStart, 0, bandW, cssH);
-        }
-      }
-    } else {
+    if (partialFill) {} else {
       clear(ctx, cssW, cssH, opts.transparent === true);
     }
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.489792ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.060042ms)
  ✔ empty input is safe (0.047542ms)
  ✔ single sample → mean=value, std=0 (0.052ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.068875ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.055291ms)

[Killed] BlockStatement
traces.js:456:35
     // `total_samples` so the partial data lands in its real x position.
     const partialFill = opts.partial_fill;
     if (partialFill) {
-      if (partialFill.full_clear) {
-        clear(ctx, cssW, cssH, opts.transparent === true);
-      } else {
+      if (partialFill.full_clear) {} else {
         const allChannels0 = opts.channels;
         const nSamplesTotal = partialFill.total_samples || (allChannels0[0] ? allChannels0[0].length : 0);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.470083ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.061209ms)
  ✔ empty input is safe (0.047542ms)
  ✔ single sample → mean=value, std=0 (0.059667ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.054709ms)

[Killed] ConditionalExpression
traces.js:456:11
     // `total_samples` so the partial data lands in its real x position.
     const partialFill = opts.partial_fill;
     if (partialFill) {
-      if (partialFill.full_clear) {
+      if (false) {
         clear(ctx, cssW, cssH, opts.transparent === true);
       } else {
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.468042ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.065125ms)
  ✔ empty input is safe (0.06875ms)
  ✔ single sample → mean=value, std=0 (0.06875ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.10925ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.070666ms)

[Killed] BooleanLiteral
traces.js:457:53
     const partialFill = opts.partial_fill;
     if (partialFill) {
       if (partialFill.full_clear) {
-        clear(ctx, cssW, cssH, opts.transparent === true);
+        clear(ctx, cssW, cssH, opts.transparent === false);
       } else {
         const allChannels0 = opts.channels;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.488709ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.342083ms)
  ✔ empty input is safe (0.06875ms)
  ✔ single sample → mean=value, std=0 (0.077125ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.064041ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.062625ms)
