[Killed] EqualityOperator
traces.js:457:32
     const partialFill = opts.partial_fill;
     if (partialFill) {
       if (partialFill.full_clear) {
-        clear(ctx, cssW, cssH, opts.transparent === true);
+        clear(ctx, cssW, cssH, opts.transparent !== true);
       } else {
         const allChannels0 = opts.channels;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.528291ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.066125ms)
  ✔ empty input is safe (0.063125ms)
  ✔ single sample → mean=value, std=0 (0.055083ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.062375ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.06125ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] BlockStatement
traces.js:458:14
     if (partialFill) {
       if (partialFill.full_clear) {
         clear(ctx, cssW, cssH, opts.transparent === true);
-      } else {
-        const allChannels0 = opts.channels;
-        const nSamplesTotal = partialFill.total_samples || (allChannels0[0] ? allChannels0[0].length : 0);
-        const plotX0 = PAD_LEFT;
-        const plotX1 = cssW - PAD_RIGHT;
-        const plotW = plotX1 - plotX0;
-        if (nSamplesTotal > 0 && plotW > 0) {
-          const xStart = Math.floor(plotX0 + (partialFill.sample_start / nSamplesTotal) * plotW);
-          const xEnd = Math.ceil(plotX0 + ((partialFill.sample_end + 1) / nSamplesTotal) * plotW);
-          const bandW = Math.max(1, xEnd - xStart);
-          ctx.fillStyle = BG_COLOR;
-          ctx.fillRect(xStart, 0, bandW, cssH);
-        }
-      }
+      } else {}
     } else {
       clear(ctx, cssW, cssH, opts.transparent === true);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.477125ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.064625ms)
  ✔ empty input is safe (0.048833ms)
  ✔ single sample → mean=value, std=0 (0.048708ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.054625ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.056959ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] ConditionalExpression
traces.js:460:31
         clear(ctx, cssW, cssH, opts.transparent === true);
       } else {
         const allChannels0 = opts.channels;
-        const nSamplesTotal = partialFill.total_samples || (allChannels0[0] ? allChannels0[0].length : 0);
+        const nSamplesTotal = false;
         const plotX0 = PAD_LEFT;
         const plotX1 = cssW - PAD_RIGHT;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.494667ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.063167ms)
  ✔ empty input is safe (0.054792ms)
  ✔ single sample → mean=value, std=0 (0.062083ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.055083ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.052666ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] ConditionalExpression
traces.js:460:31
         clear(ctx, cssW, cssH, opts.transparent === true);
       } else {
         const allChannels0 = opts.channels;
-        const nSamplesTotal = partialFill.total_samples || (allChannels0[0] ? allChannels0[0].length : 0);
+        const nSamplesTotal = true;
         const plotX0 = PAD_LEFT;
         const plotX1 = cssW - PAD_RIGHT;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.473792ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.062083ms)
  ✔ empty input is safe (0.058542ms)

  ✔ single sample → mean=value, std=0 (0.051666ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.06025ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.056167ms)

[Killed] ArithmeticOperator
traces.js:462:24
         const allChannels0 = opts.channels;
         const nSamplesTotal = partialFill.total_samples || (allChannels0[0] ? allChannels0[0].length : 0);
         const plotX0 = PAD_LEFT;
-        const plotX1 = cssW - PAD_RIGHT;
+        const plotX1 = cssW + PAD_RIGHT;
         const plotW = plotX1 - plotX0;
         if (nSamplesTotal > 0 && plotW > 0) {
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (1.453791ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.087ms)
  ✔ empty input is safe (0.054792ms)
  ✔ single sample → mean=value, std=0 (0.067541ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.062416ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.057958ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce Na

[Killed] ArithmeticOperator
traces.js:463:23
         const nSamplesTotal = partialFill.total_samples || (allChannels0[0] ? allChannels0[0].length : 0);
         const plotX0 = PAD_LEFT;
         const plotX1 = cssW - PAD_RIGHT;
-        const plotW = plotX1 - plotX0;
+        const plotW = plotX1 + plotX0;
         if (nSamplesTotal > 0 && plotW > 0) {
           const xStart = Math.floor(plotX0 + (partialFill.sample_start / nSamplesTotal) * plotW);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.502042ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.06025ms)
  ✔ empty input is safe (0.047584ms)
  ✔ single sample → mean=value, std=0 (0.047834ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.057167ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.054625ms)

[Killed] ConditionalExpression
traces.js:464:13
         const plotX0 = PAD_LEFT;
         const plotX1 = cssW - PAD_RIGHT;
         const plotW = plotX1 - plotX0;
-        if (nSamplesTotal > 0 && plotW > 0) {
+        if (false) {
           const xStart = Math.floor(plotX0 + (partialFill.sample_start / nSamplesTotal) * plotW);
           const xEnd = Math.ceil(plotX0 + ((partialFill.sample_end + 1) / nSamplesTotal) * plotW);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.519834ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.067334ms)
  ✔ empty input is safe (0.049083ms)
  ✔ single sample → mean=value, std=0 (0.068042ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.06375ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.058208ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] EqualityOperator
traces.js:464:34
         const plotX0 = PAD_LEFT;
         const plotX1 = cssW - PAD_RIGHT;
         const plotW = plotX1 - plotX0;
-        if (nSamplesTotal > 0 && plotW > 0) {
+        if (nSamplesTotal > 0 && plotW <= 0) {
           const xStart = Math.floor(plotX0 + (partialFill.sample_start / nSamplesTotal) * plotW);
           const xEnd = Math.ceil(plotX0 + ((partialFill.sample_end + 1) / nSamplesTotal) * plotW);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.495584ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.064834ms)
  ✔ empty input is safe (0.049208ms)
  ✔ single sample → mean=value, std=0 (0.065708ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.063083ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.057666ms)

[Killed] ArithmeticOperator
traces.js:465:37
         const plotX1 = cssW - PAD_RIGHT;
         const plotW = plotX1 - plotX0;
         if (nSamplesTotal > 0 && plotW > 0) {
-          const xStart = Math.floor(plotX0 + (partialFill.sample_start / nSamplesTotal) * plotW);
+          const xStart = Math.floor(plotX0 - partialFill.sample_start / nSamplesTotal * plotW);
           const xEnd = Math.ceil(plotX0 + ((partialFill.sample_end + 1) / nSamplesTotal) * plotW);
           const bandW = Math.max(1, xEnd - xStart);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.474ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.081333ms)
  ✔ empty input is safe (0.059ms)
  ✔ single sample → mean=value, std=0 (0.058ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.067458ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.060416ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce NaN/Inf

[Killed] ArithmeticOperator
traces.js:465:46
         const plotX1 = cssW - PAD_RIGHT;
         const plotW = plotX1 - plotX0;
         if (nSamplesTotal > 0 && plotW > 0) {
-          const xStart = Math.floor(plotX0 + (partialFill.sample_start / nSamplesTotal) * plotW);
+          const xStart = Math.floor(plotX0 + partialFill.sample_start / nSamplesTotal / plotW);
           const xEnd = Math.ceil(plotX0 + ((partialFill.sample_end + 1) / nSamplesTotal) * plotW);
           const bandW = Math.max(1, xEnd - xStart);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.467625ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.062083ms)
  ✔ empty input is safe (0.045458ms)
  ✔ single sample → mean=value, std=0 (0.04925ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.056292ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.054333ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] ArithmeticOperator
traces.js:466:34
         const plotW = plotX1 - plotX0;
         if (nSamplesTotal > 0 && plotW > 0) {
           const xStart = Math.floor(plotX0 + (partialFill.sample_start / nSamplesTotal) * plotW);
-          const xEnd = Math.ceil(plotX0 + ((partialFill.sample_end + 1) / nSamplesTotal) * plotW);
+          const xEnd = Math.ceil(plotX0 - (partialFill.sample_end + 1) / nSamplesTotal * plotW);
           const bandW = Math.max(1, xEnd - xStart);
           ctx.fillStyle = BG_COLOR;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.46225ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.058333ms)
  ✔ empty input is safe (0.059083ms)
  ✔ single sample → mean=value, std=0 (0.050167ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.057167ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.054625ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] ArithmeticOperator
traces.js:466:43
         const plotW = plotX1 - plotX0;
         if (nSamplesTotal > 0 && plotW > 0) {
           const xStart = Math.floor(plotX0 + (partialFill.sample_start / nSamplesTotal) * plotW);
-          const xEnd = Math.ceil(plotX0 + ((partialFill.sample_end + 1) / nSamplesTotal) * plotW);
+          const xEnd = Math.ceil(plotX0 + (partialFill.sample_end + 1) / nSamplesTotal / plotW);
           const bandW = Math.max(1, xEnd - xStart);
           ctx.fillStyle = BG_COLOR;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.456292ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.059041ms)
  ✔ empty input is safe (0.047125ms)
  ✔ single sample → mean=value, std=0 (0.049ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.067833ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.0555ms)

[Killed] ArithmeticOperator
traces.js:467:37
         if (nSamplesTotal > 0 && plotW > 0) {
           const xStart = Math.floor(plotX0 + (partialFill.sample_start / nSamplesTotal) * plotW);
           const xEnd = Math.ceil(plotX0 + ((partialFill.sample_end + 1) / nSamplesTotal) * plotW);
-          const bandW = Math.max(1, xEnd - xStart);
+          const bandW = Math.max(1, xEnd + xStart);
           ctx.fillStyle = BG_COLOR;
           ctx.fillRect(xStart, 0, bandW, cssH);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.697166ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.076917ms)
  ✔ empty input is safe (0.052917ms)
  ✔ single sample → mean=value, std=0 (0.053708ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.06525ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.056375ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] MethodExpression
traces.js:467:25
         if (nSamplesTotal > 0 && plotW > 0) {
           const xStart = Math.floor(plotX0 + (partialFill.sample_start / nSamplesTotal) * plotW);
           const xEnd = Math.ceil(plotX0 + ((partialFill.sample_end + 1) / nSamplesTotal) * plotW);
-          const bandW = Math.max(1, xEnd - xStart);
+          const bandW = Math.min(1, xEnd - xStart);
           ctx.fillStyle = BG_COLOR;
           ctx.fillRect(xStart, 0, bandW, cssH);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (4.807417ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.093625ms)
  ✔ empty input is safe (0.067416ms)
  ✔ single sample → mean=value, std=0 (0.05425ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.060458ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.054459ms)

[Killed] BlockStatement
traces.js:472:12
           ctx.fillRect(xStart, 0, bandW, cssH);
         }
       }
-    } else {
-      clear(ctx, cssW, cssH, opts.transparent === true);
-    }
+    } else {}
 
     const allChannels = opts.channels;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (2.215834ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.160541ms)
  ✔ empty input is safe (0.119875ms)
  ✔ single sample → mean=value, std=0 (0.123292ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.372083ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.13875ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] ConditionalExpression
traces.js:473:30
         }
       }
     } else {
-      clear(ctx, cssW, cssH, opts.transparent === true);
+      clear(ctx, cssW, cssH, true);
     }
 
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.508125ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.063417ms)
  ✔ empty input is safe (0.048625ms)
  ✔ single sample → mean=value, std=0 (0.049375ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.074291ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.055042ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] ConditionalExpression
traces.js:473:30
         }
       }
     } else {
-      clear(ctx, cssW, cssH, opts.transparent === true);
+      clear(ctx, cssW, cssH, false);
     }
 
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.512375ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.09275ms)
  ✔ empty input is safe (0.0505ms)
  ✔ single sample → mean=value, std=0 (0.063875ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.056959ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.054208ms)

[Killed] ConditionalExpression
traces.js:478:9
 
     const allChannels = opts.channels;
     const totalCh = allChannels.length;
-    if (!totalCh) return;
+    if (true) return;
     const allLabels = opts.channel_labels || [];
     const allTypes  = opts.channel_types  || [];
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (1.00875ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.146458ms)

  ✔ empty input is safe (0.114167ms)

  ✔ single sample → mean=value, std=0 (0.1275ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.161208ms)

[Killed] BooleanLiteral
traces.js:478:9
 
     const allChannels = opts.channels;
     const totalCh = allChannels.length;
-    if (!totalCh) return;
+    if (totalCh) return;
     const allLabels = opts.channel_labels || [];
     const allTypes  = opts.channel_types  || [];
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.472542ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.059ms)
  ✔ empty input is safe (0.057083ms)
  ✔ single sample → mean=value, std=0 (0.047833ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.055459ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.057041ms)

[Killed] ConditionalExpression
traces.js:479:23
     const allChannels = opts.channels;
     const totalCh = allChannels.length;
     if (!totalCh) return;
-    const allLabels = opts.channel_labels || [];
+    const allLabels = true;
     const allTypes  = opts.channel_types  || [];
     const allColors = opts.channel_colors || null;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.465667ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.059834ms)
  ✔ empty input is safe (0.047667ms)
  ✔ single sample → mean=value, std=0 (0.048958ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.057042ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.054ms)

[Killed] ConditionalExpression
traces.js:479:23
     const allChannels = opts.channels;
     const totalCh = allChannels.length;
     if (!totalCh) return;
-    const allLabels = opts.channel_labels || [];
+    const allLabels = false;
     const allTypes  = opts.channel_types  || [];
     const allColors = opts.channel_colors || null;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.467792ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.063ms)
  ✔ empty input is safe (0.062333ms)
  ✔ single sample → mean=value, std=0 (0.04925ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.05675ms)

[Killed] ConditionalExpression
traces.js:480:23
     const totalCh = allChannels.length;
     if (!totalCh) return;
     const allLabels = opts.channel_labels || [];
-    const allTypes  = opts.channel_types  || [];
+    const allTypes  = true;
     const allColors = opts.channel_colors || null;
     const allBad    = opts.bad_mask       || null;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.601458ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.073917ms)
  ✔ empty input is safe (0.05575ms)
  ✔ single sample → mean=value, std=0 (0.068542ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.063875ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.070125ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] LogicalOperator
traces.js:480:23
     const totalCh = allChannels.length;
     if (!totalCh) return;
     const allLabels = opts.channel_labels || [];
-    const allTypes  = opts.channel_types  || [];
+    const allTypes  = opts.channel_types && [];
     const allColors = opts.channel_colors || null;
     const allBad    = opts.bad_mask       || null;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (1.424375ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.086042ms)
  ✔ empty input is safe (0.066209ms)
  ✔ single sample → mean=value, std=0 (0.068625ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.071959ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.063708ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] ConditionalExpression
traces.js:481:23
     if (!totalCh) return;
     const allLabels = opts.channel_labels || [];
     const allTypes  = opts.channel_types  || [];
-    const allColors = opts.channel_colors || null;
+    const allColors = true;
     const allBad    = opts.bad_mask       || null;
 
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (3.055667ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.102166ms)
  ✔ empty input is safe (0.05725ms)
  ✔ single sample → mean=value, std=0 (0.055209ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.060166ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.056208ms)

[Killed] ConditionalExpression
traces.js:481:23
     if (!totalCh) return;
     const allLabels = opts.channel_labels || [];
     const allTypes  = opts.channel_types  || [];
-    const allColors = opts.channel_colors || null;
+    const allColors = false;
     const allBad    = opts.bad_mask       || null;
 
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.49475ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.067042ms)

  ✔ empty input is safe (0.048625ms)
  ✔ single sample → mean=value, std=0 (0.052583ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.064083ms)

[Killed] ConditionalExpression
traces.js:482:23
     const allLabels = opts.channel_labels || [];
     const allTypes  = opts.channel_types  || [];
     const allColors = opts.channel_colors || null;
-    const allBad    = opts.bad_mask       || null;
+    const allBad    = false;
 
     const t0 = opts.start_sec;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.538667ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.107125ms)
  ✔ empty input is safe (0.50225ms)
  ✔ single sample → mean=value, std=0 (0.080292ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.069792ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.060417ms)

[Killed] ConditionalExpression
traces.js:482:23
     const allLabels = opts.channel_labels || [];
     const allTypes  = opts.channel_types  || [];
     const allColors = opts.channel_colors || null;
-    const allBad    = opts.bad_mask       || null;
+    const allBad    = true;
 
     const t0 = opts.start_sec;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.469625ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.063625ms)
  ✔ empty input is safe (0.048125ms)
  ✔ single sample → mean=value, std=0 (0.052083ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.078ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.055958ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce Na

[Survived] MethodExpression
traces.js:485:30
     const allBad    = opts.bad_mask       || null;
 
     const t0 = opts.start_sec;
-    const nSamplesVisible0 = Math.min(opts.n_samples_visible, allChannels[0].length);
+    const nSamplesVisible0 = Math.max(opts.n_samples_visible, allChannels[0].length);
     // Time axis and event positions are anchored to the FULL window even
     // during streaming, so ticks don't jitter as chunks arrive and so events

[Killed] LogicalOperator
traces.js:491:28
     // appear at their true t-coordinate. Without partial_fill the full
     // window equals the partial (chunk == window). With partial_fill we
     // trust `total_samples` from the caller.
-    const nSamplesTotal = (opts.partial_fill && opts.partial_fill.total_samples)
+    const nSamplesTotal = (opts.partial_fill || opts.partial_fill.total_samples)
       ? opts.partial_fill.total_samples
       : nSamplesVisible0;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.466791ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.067208ms)
  ✔ empty input is safe (0.053416ms)
  ✔ single sample → mean=value, std=0 (0.064625ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.060875ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.063083ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] ConditionalExpression
traces.js:491:28
     // appear at their true t-coordinate. Without partial_fill the full
     // window equals the partial (chunk == window). With partial_fill we
     // trust `total_samples` from the caller.
-    const nSamplesTotal = (opts.partial_fill && opts.partial_fill.total_samples)
+    const nSamplesTotal = (true)
       ? opts.partial_fill.total_samples
       : nSamplesVisible0;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.597375ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.067ms)

  ✔ empty input is safe (0.050625ms)
  ✔ single sample → mean=value, std=0 (0.054958ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.075042ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.055542ms)

[Killed] ArithmeticOperator
traces.js:494:21
     const nSamplesTotal = (opts.partial_fill && opts.partial_fill.total_samples)
       ? opts.partial_fill.total_samples
       : nSamplesVisible0;
-    const t1 = t0 + nSamplesTotal / opts.fs;
+    const t1 = t0 + nSamplesTotal * opts.fs;
     const gain = opts.gain ?? 1;
 
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.488334ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.060666ms)
  ✔ empty input is safe (0.047959ms)

  ✔ single sample → mean=value, std=0 (0.060708ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.059416ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.054875ms)

[Killed] ArithmeticOperator
traces.js:494:16
     const nSamplesTotal = (opts.partial_fill && opts.partial_fill.total_samples)
       ? opts.partial_fill.total_samples
       : nSamplesVisible0;
-    const t1 = t0 + nSamplesTotal / opts.fs;
+    const t1 = t0 - nSamplesTotal / opts.fs;
     const gain = opts.gain ?? 1;
 
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.483208ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.065916ms)
  ✔ empty input is safe (0.054417ms)
  ✔ single sample → mean=value, std=0 (0.055333ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.075875ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.0605ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce N

[Killed] LogicalOperator
traces.js:495:18
       ? opts.partial_fill.total_samples
       : nSamplesVisible0;
     const t1 = t0 + nSamplesTotal / opts.fs;
-    const gain = opts.gain ?? 1;
+    const gain = opts.gain && 1;
 
     const plotX0 = PAD_LEFT;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.488667ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.061166ms)
  ✔ empty input is safe (0.047458ms)
  ✔ single sample → mean=value, std=0 (0.048667ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.07275ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.057ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce NaN

[Killed] ArithmeticOperator
traces.js:500:20
     const plotX0 = PAD_LEFT;
     const plotX1 = cssW - PAD_RIGHT;
     const plotY0 = PAD_TOP;
-    const plotH  = cssH - PAD_TOP - PAD_BOTTOM;
+    const plotH  = cssH - PAD_TOP + PAD_BOTTOM;
     const plotW  = plotX1 - plotX0;
     if (plotW <= 4 || plotH <= 4) return;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.47625ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.068709ms)
  ✔ empty input is safe (0.05125ms)
  ✔ single sample → mean=value, std=0 (0.049917ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.071791ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.053625ms)

[Killed] ArithmeticOperator
traces.js:500:20
     const plotX0 = PAD_LEFT;
     const plotX1 = cssW - PAD_RIGHT;
     const plotY0 = PAD_TOP;
-    const plotH  = cssH - PAD_TOP - PAD_BOTTOM;
+    const plotH  = cssH + PAD_TOP - PAD_BOTTOM;
     const plotW  = plotX1 - plotX0;
     if (plotW <= 4 || plotH <= 4) return;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.487083ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.063041ms)
  ✔ empty input is safe (0.063166ms)

  ✔ single sample → mean=value, std=0 (0.049709ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.059375ms)

[Killed] ArithmeticOperator
traces.js:501:20
     const plotX1 = cssW - PAD_RIGHT;
     const plotY0 = PAD_TOP;
     const plotH  = cssH - PAD_TOP - PAD_BOTTOM;
-    const plotW  = plotX1 - plotX0;
+    const plotW  = plotX1 + plotX0;
     if (plotW <= 4 || plotH <= 4) return;
 
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.471708ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.058459ms)
  ✔ empty input is safe (0.046542ms)
  ✔ single sample → mean=value, std=0 (0.061542ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.056708ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.054541ms)

[Killed] ConditionalExpression
traces.js:502:9
     const plotY0 = PAD_TOP;
     const plotH  = cssH - PAD_TOP - PAD_BOTTOM;
     const plotW  = plotX1 - plotX0;
-    if (plotW <= 4 || plotH <= 4) return;
+    if (true) return;
 
     // Virtual scroll: when n_channels would force slots smaller than
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.492291ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.062583ms)
  ✔ empty input is safe (0.054542ms)
  ✔ single sample → mean=value, std=0 (0.050541ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.073291ms)

[Killed] EqualityOperator
traces.js:502:23
     const plotY0 = PAD_TOP;
     const plotH  = cssH - PAD_TOP - PAD_BOTTOM;
     const plotW  = plotX1 - plotX0;
-    if (plotW <= 4 || plotH <= 4) return;
+    if (plotW <= 4 || plotH > 4) return;
 
     // Virtual scroll: when n_channels would force slots smaller than
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.789125ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.07625ms)
  ✔ empty input is safe (0.05525ms)
  ✔ single sample → mean=value, std=0 (0.052375ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.075833ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.056459ms)

[Killed] ArithmeticOperator
traces.js:507:47
     // Virtual scroll: when n_channels would force slots smaller than
     // MIN_SLOT_PX, paginate. Caller (viewer.js) drives `channel_offset`
     // via PgUp/PgDn so pages stay in sync with the user's intent.
-    const maxVisible = Math.max(1, Math.floor(plotH / MIN_SLOT_PX));
+    const maxVisible = Math.max(1, Math.floor(plotH * MIN_SLOT_PX));
     const offsetRaw = opts.channel_offset || 0;
     const offset = Math.max(0, Math.min(Math.max(0, totalCh - 1), offsetRaw));
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.4865ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.066ms)
  ✔ empty input is safe (0.04875ms)
  ✔ single sample → mean=value, std=0 (0.059542ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.058916ms)
