[Killed] MethodExpression
traces.js:507:24
     // Virtual scroll: when n_channels would force slots smaller than
     // MIN_SLOT_PX, paginate. Caller (viewer.js) drives `channel_offset`
     // via PgUp/PgDn so pages stay in sync with the user's intent.
-    const maxVisible = Math.max(1, Math.floor(plotH / MIN_SLOT_PX));
+    const maxVisible = Math.min(1, Math.floor(plotH / MIN_SLOT_PX));
     const offsetRaw = opts.channel_offset || 0;
     const offset = Math.max(0, Math.min(Math.max(0, totalCh - 1), offsetRaw));
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.525917ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.083209ms)
  ✔ empty input is safe (0.060541ms)
  ✔ single sample → mean=value, std=0 (0.07175ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.063625ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.061834ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] ConditionalExpression
traces.js:508:23
     // MIN_SLOT_PX, paginate. Caller (viewer.js) drives `channel_offset`
     // via PgUp/PgDn so pages stay in sync with the user's intent.
     const maxVisible = Math.max(1, Math.floor(plotH / MIN_SLOT_PX));
-    const offsetRaw = opts.channel_offset || 0;
+    const offsetRaw = true;
     const offset = Math.max(0, Math.min(Math.max(0, totalCh - 1), offsetRaw));
     const visibleN = Math.min(maxVisible, totalCh - offset);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.524625ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.065875ms)

  ✔ empty input is safe (0.050291ms)
  ✔ single sample → mean=value, std=0 (0.052625ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.064125ms)

[Killed] ConditionalExpression
traces.js:508:23
     // MIN_SLOT_PX, paginate. Caller (viewer.js) drives `channel_offset`
     // via PgUp/PgDn so pages stay in sync with the user's intent.
     const maxVisible = Math.max(1, Math.floor(plotH / MIN_SLOT_PX));
-    const offsetRaw = opts.channel_offset || 0;
+    const offsetRaw = false;
     const offset = Math.max(0, Math.min(Math.max(0, totalCh - 1), offsetRaw));
     const visibleN = Math.min(maxVisible, totalCh - offset);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.466167ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.057958ms)
  ✔ empty input is safe (0.04525ms)
  ✔ single sample → mean=value, std=0 (0.056334ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.054292ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.053791ms)

[Killed] MethodExpression
traces.js:509:41
     // via PgUp/PgDn so pages stay in sync with the user's intent.
     const maxVisible = Math.max(1, Math.floor(plotH / MIN_SLOT_PX));
     const offsetRaw = opts.channel_offset || 0;
-    const offset = Math.max(0, Math.min(Math.max(0, totalCh - 1), offsetRaw));
+    const offset = Math.max(0, Math.min(Math.min(0, totalCh - 1), offsetRaw));
     const visibleN = Math.min(maxVisible, totalCh - offset);
     const slice = (arr) => (arr ? arr.slice(offset, offset + visibleN) : arr);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.469917ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.060708ms)
  ✔ empty input is safe (0.047083ms)

  ✔ single sample → mean=value, std=0 (0.058458ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.060375ms)

[Killed] MethodExpression
traces.js:509:20
     // via PgUp/PgDn so pages stay in sync with the user's intent.
     const maxVisible = Math.max(1, Math.floor(plotH / MIN_SLOT_PX));
     const offsetRaw = opts.channel_offset || 0;
-    const offset = Math.max(0, Math.min(Math.max(0, totalCh - 1), offsetRaw));
+    const offset = Math.min(0, Math.min(Math.max(0, totalCh - 1), offsetRaw));
     const visibleN = Math.min(maxVisible, totalCh - offset);
     const slice = (arr) => (arr ? arr.slice(offset, offset + visibleN) : arr);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.46775ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.06025ms)
  ✔ empty input is safe (0.0475ms)
  ✔ single sample → mean=value, std=0 (0.059334ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.059458ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.057042ms)

[Killed] MethodExpression
traces.js:510:22
     const maxVisible = Math.max(1, Math.floor(plotH / MIN_SLOT_PX));
     const offsetRaw = opts.channel_offset || 0;
     const offset = Math.max(0, Math.min(Math.max(0, totalCh - 1), offsetRaw));
-    const visibleN = Math.min(maxVisible, totalCh - offset);
+    const visibleN = Math.max(maxVisible, totalCh - offset);
     const slice = (arr) => (arr ? arr.slice(offset, offset + visibleN) : arr);
     const channels = totalCh > maxVisible ? slice(allChannels) : allChannels;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (2.176625ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.089958ms)
  ✔ empty input is safe (0.0575ms)
  ✔ single sample → mean=value, std=0 (0.072417ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.131833ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.130917ms)

[Survived] ArithmeticOperator
traces.js:510:43
     const maxVisible = Math.max(1, Math.floor(plotH / MIN_SLOT_PX));
     const offsetRaw = opts.channel_offset || 0;
     const offset = Math.max(0, Math.min(Math.max(0, totalCh - 1), offsetRaw));
-    const visibleN = Math.min(maxVisible, totalCh - offset);
+    const visibleN = Math.min(maxVisible, totalCh + offset);
     const slice = (arr) => (arr ? arr.slice(offset, offset + visibleN) : arr);
     const channels = totalCh > maxVisible ? slice(allChannels) : allChannels;

[Killed] ArrowFunction
traces.js:511:19
     const offsetRaw = opts.channel_offset || 0;
     const offset = Math.max(0, Math.min(Math.max(0, totalCh - 1), offsetRaw));
     const visibleN = Math.min(maxVisible, totalCh - offset);
-    const slice = (arr) => (arr ? arr.slice(offset, offset + visibleN) : arr);
+    const slice = () => undefined;
     const channels = totalCh > maxVisible ? slice(allChannels) : allChannels;
     const labels   = totalCh > maxVisible ? slice(allLabels)   : allLabels;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.505083ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.093542ms)
  ✔ empty input is safe (0.059ms)
  ✔ single sample → mean=value, std=0 (0.055917ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.0615ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.062292ms)

[Killed] MethodExpression
traces.js:511:35
     const offsetRaw = opts.channel_offset || 0;
     const offset = Math.max(0, Math.min(Math.max(0, totalCh - 1), offsetRaw));
     const visibleN = Math.min(maxVisible, totalCh - offset);
-    const slice = (arr) => (arr ? arr.slice(offset, offset + visibleN) : arr);
+    const slice = (arr) => (arr ? arr : arr);
     const channels = totalCh > maxVisible ? slice(allChannels) : allChannels;
     const labels   = totalCh > maxVisible ? slice(allLabels)   : allLabels;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.47275ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.059584ms)
  ✔ empty input is safe (0.045417ms)

  ✔ single sample → mean=value, std=0 (0.048ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.057708ms)

[Killed] ConditionalExpression
traces.js:512:22
     const offset = Math.max(0, Math.min(Math.max(0, totalCh - 1), offsetRaw));
     const visibleN = Math.min(maxVisible, totalCh - offset);
     const slice = (arr) => (arr ? arr.slice(offset, offset + visibleN) : arr);
-    const channels = totalCh > maxVisible ? slice(allChannels) : allChannels;
+    const channels = false ? slice(allChannels) : allChannels;
     const labels   = totalCh > maxVisible ? slice(allLabels)   : allLabels;
     const types    = totalCh > maxVisible ? slice(allTypes)    : allTypes;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.590666ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.06725ms)
  ✔ empty input is safe (0.053459ms)
  ✔ single sample → mean=value, std=0 (0.05125ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.077083ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.059667ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce N

[Killed] EqualityOperator
traces.js:512:22
     const offset = Math.max(0, Math.min(Math.max(0, totalCh - 1), offsetRaw));
     const visibleN = Math.min(maxVisible, totalCh - offset);
     const slice = (arr) => (arr ? arr.slice(offset, offset + visibleN) : arr);
-    const channels = totalCh > maxVisible ? slice(allChannels) : allChannels;
+    const channels = totalCh <= maxVisible ? slice(allChannels) : allChannels;
     const labels   = totalCh > maxVisible ? slice(allLabels)   : allLabels;
     const types    = totalCh > maxVisible ? slice(allTypes)    : allTypes;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.480875ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.063833ms)
  ✔ empty input is safe (0.047083ms)
  ✔ single sample → mean=value, std=0 (0.052416ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.069625ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.053875ms)

[Killed] EqualityOperator
traces.js:513:22
     const visibleN = Math.min(maxVisible, totalCh - offset);
     const slice = (arr) => (arr ? arr.slice(offset, offset + visibleN) : arr);
     const channels = totalCh > maxVisible ? slice(allChannels) : allChannels;
-    const labels   = totalCh > maxVisible ? slice(allLabels)   : allLabels;
+    const labels   = totalCh <= maxVisible ? slice(allLabels)   : allLabels;
     const types    = totalCh > maxVisible ? slice(allTypes)    : allTypes;
     const colors   = totalCh > maxVisible ? slice(allColors)   : allColors;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.464708ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.060875ms)
  ✔ empty input is safe (0.050583ms)
  ✔ single sample → mean=value, std=0 (0.063167ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.086375ms)

[Killed] ConditionalExpression
traces.js:513:22
     const visibleN = Math.min(maxVisible, totalCh - offset);
     const slice = (arr) => (arr ? arr.slice(offset, offset + visibleN) : arr);
     const channels = totalCh > maxVisible ? slice(allChannels) : allChannels;
-    const labels   = totalCh > maxVisible ? slice(allLabels)   : allLabels;
+    const labels   = false ? slice(allLabels)   : allLabels;
     const types    = totalCh > maxVisible ? slice(allTypes)    : allTypes;
     const colors   = totalCh > maxVisible ? slice(allColors)   : allColors;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.506041ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.067167ms)
  ✔ empty input is safe (0.050875ms)
  ✔ single sample → mean=value, std=0 (0.068208ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.064375ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.056708ms)

[Survived] EqualityOperator
traces.js:514:22
     const slice = (arr) => (arr ? arr.slice(offset, offset + visibleN) : arr);
     const channels = totalCh > maxVisible ? slice(allChannels) : allChannels;
     const labels   = totalCh > maxVisible ? slice(allLabels)   : allLabels;
-    const types    = totalCh > maxVisible ? slice(allTypes)    : allTypes;
+    const types    = totalCh >= maxVisible ? slice(allTypes)    : allTypes;
     const colors   = totalCh > maxVisible ? slice(allColors)   : allColors;
     const badMask  = totalCh > maxVisible ? slice(allBad)      : allBad;

[Survived] ConditionalExpression
traces.js:514:22
     const slice = (arr) => (arr ? arr.slice(offset, offset + visibleN) : arr);
     const channels = totalCh > maxVisible ? slice(allChannels) : allChannels;
     const labels   = totalCh > maxVisible ? slice(allLabels)   : allLabels;
-    const types    = totalCh > maxVisible ? slice(allTypes)    : allTypes;
+    const types    = true ? slice(allTypes)    : allTypes;
     const colors   = totalCh > maxVisible ? slice(allColors)   : allColors;
     const badMask  = totalCh > maxVisible ? slice(allBad)      : allBad;

[Killed] EqualityOperator
traces.js:515:22
     const channels = totalCh > maxVisible ? slice(allChannels) : allChannels;
     const labels   = totalCh > maxVisible ? slice(allLabels)   : allLabels;
     const types    = totalCh > maxVisible ? slice(allTypes)    : allTypes;
-    const colors   = totalCh > maxVisible ? slice(allColors)   : allColors;
+    const colors   = totalCh <= maxVisible ? slice(allColors)   : allColors;
     const badMask  = totalCh > maxVisible ? slice(allBad)      : allBad;
 
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.529708ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.064583ms)
  ✔ empty input is safe (0.0515ms)
  ✔ single sample → mean=value, std=0 (0.064292ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.063833ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.060417ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce N

[Killed] ConditionalExpression
traces.js:515:22
     const channels = totalCh > maxVisible ? slice(allChannels) : allChannels;
     const labels   = totalCh > maxVisible ? slice(allLabels)   : allLabels;
     const types    = totalCh > maxVisible ? slice(allTypes)    : allTypes;
-    const colors   = totalCh > maxVisible ? slice(allColors)   : allColors;
+    const colors   = false ? slice(allColors)   : allColors;
     const badMask  = totalCh > maxVisible ? slice(allBad)      : allBad;
 
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.48075ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.068292ms)
  ✔ empty input is safe (0.052333ms)
  ✔ single sample → mean=value, std=0 (0.067583ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.064333ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.060208ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] ConditionalExpression
traces.js:516:22
     const labels   = totalCh > maxVisible ? slice(allLabels)   : allLabels;
     const types    = totalCh > maxVisible ? slice(allTypes)    : allTypes;
     const colors   = totalCh > maxVisible ? slice(allColors)   : allColors;
-    const badMask  = totalCh > maxVisible ? slice(allBad)      : allBad;
+    const badMask  = false ? slice(allBad)      : allBad;
 
     const nCh = channels.length;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.472542ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.061792ms)
  ✔ empty input is safe (0.047833ms)
  ✔ single sample → mean=value, std=0 (0.05025ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.074291ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.059083ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] EqualityOperator
traces.js:516:22
     const labels   = totalCh > maxVisible ? slice(allLabels)   : allLabels;
     const types    = totalCh > maxVisible ? slice(allTypes)    : allTypes;
     const colors   = totalCh > maxVisible ? slice(allColors)   : allColors;
-    const badMask  = totalCh > maxVisible ? slice(allBad)      : allBad;
+    const badMask  = totalCh <= maxVisible ? slice(allBad)      : allBad;
 
     const nCh = channels.length;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.471166ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.060458ms)
  ✔ empty input is safe (0.049708ms)

  ✔ single sample → mean=value, std=0 (0.052166ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.073375ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.058875ms)

[Survived] MethodExpression
traces.js:519:22
     const badMask  = totalCh > maxVisible ? slice(allBad)      : allBad;
 
     const nCh = channels.length;
-    const nVisible = Math.min(opts.n_samples_visible, channels[0].length);
+    const nVisible = Math.max(opts.n_samples_visible, channels[0].length);
     const slotH = plotH / nCh;
     const halfSlotPx = slotH * 0.45;

[Killed] ArithmeticOperator
traces.js:520:19
 
     const nCh = channels.length;
     const nVisible = Math.min(opts.n_samples_visible, channels[0].length);
-    const slotH = plotH / nCh;
+    const slotH = plotH * nCh;
     const halfSlotPx = slotH * 0.45;
     // When streaming, the chunk contains only `nVisible` of the eventual
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.478833ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.06275ms)
  ✔ empty input is safe (0.046959ms)
  ✔ single sample → mean=value, std=0 (0.049291ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.071125ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.054875ms)

[Killed] ArithmeticOperator
traces.js:521:24
     const nCh = channels.length;
     const nVisible = Math.min(opts.n_samples_visible, channels[0].length);
     const slotH = plotH / nCh;
-    const halfSlotPx = slotH * 0.45;
+    const halfSlotPx = slotH / 0.45;
     // When streaming, the chunk contains only `nVisible` of the eventual
     // `nSamplesTotal` samples. The polyline/decimator must map sample i to
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.498084ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.065292ms)
  ✔ empty input is safe (0.050042ms)
  ✔ single sample → mean=value, std=0 (0.050833ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.075292ms)

[Killed] ConditionalExpression
traces.js:529:29
     // this remapping, every chunk paints a different stretched lookalike of
     // the final shape and the band-clear leaves ghost lines from prior
     // chunks — the visible "trace residue" reported during fast pan.
-    const effectivePlotW = (nSamplesTotal > nVisible)
+    const effectivePlotW = (false)
       ? plotW * (nVisible / nSamplesTotal)
       : plotW;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (48.518709ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.098833ms)
  ✔ empty input is safe (0.060416ms)
  ✔ single sample → mean=value, std=0 (0.07275ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.062958ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.058958ms)

[Killed] EqualityOperator
traces.js:529:29
     // this remapping, every chunk paints a different stretched lookalike of
     // the final shape and the band-clear leaves ghost lines from prior
     // chunks — the visible "trace residue" reported during fast pan.
-    const effectivePlotW = (nSamplesTotal > nVisible)
+    const effectivePlotW = (nSamplesTotal <= nVisible)
       ? plotW * (nVisible / nSamplesTotal)
       : plotW;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.47ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.063833ms)

  ✔ empty input is safe (0.049542ms)
  ✔ single sample → mean=value, std=0 (0.292917ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.061208ms)

[Killed] ArithmeticOperator
traces.js:530:9
     // the final shape and the band-clear leaves ghost lines from prior
     // chunks — the visible "trace residue" reported during fast pan.
     const effectivePlotW = (nSamplesTotal > nVisible)
-      ? plotW * (nVisible / nSamplesTotal)
+      ? plotW / (nVisible / nSamplesTotal)
       : plotW;
 
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.471709ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.061916ms)
  ✔ empty input is safe (0.062584ms)
  ✔ single sample → mean=value, std=0 (0.050625ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.05975ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.058333ms)

[Killed] ArithmeticOperator
traces.js:530:18
     // the final shape and the band-clear leaves ghost lines from prior
     // chunks — the visible "trace residue" reported during fast pan.
     const effectivePlotW = (nSamplesTotal > nVisible)
-      ? plotW * (nVisible / nSamplesTotal)
+      ? plotW * (nVisible * nSamplesTotal)
       : plotW;
 
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.494917ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.069417ms)
  ✔ empty input is safe (0.053084ms)
  ✔ single sample → mean=value, std=0 (0.071833ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.063542ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.061541ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] ArithmeticOperator
traces.js:536:28
     drawSlotDividers(ctx, plotX0, plotX1, plotY0, slotH, nCh);
     drawChannelLabels(ctx, labels, types, slotH, plotX0, plotY0);
     const xLabels = drawTimeAxis(
-      ctx, plotX0, plotX1, plotY0 + plotH + 4, t0, t1,
+      ctx, plotX0, plotX1, plotY0 - plotH + 4, t0, t1,
       opts.time_mode, opts.recording_start_iso
     );
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.504834ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.067708ms)
  ✔ empty input is safe (0.055375ms)
  ✔ single sample → mean=value, std=0 (0.057041ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.065916ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.059208ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] ArithmeticOperator
traces.js:536:28
     drawSlotDividers(ctx, plotX0, plotX1, plotY0, slotH, nCh);
     drawChannelLabels(ctx, labels, types, slotH, plotX0, plotY0);
     const xLabels = drawTimeAxis(
-      ctx, plotX0, plotX1, plotY0 + plotH + 4, t0, t1,
+      ctx, plotX0, plotX1, plotY0 + plotH - 4, t0, t1,
       opts.time_mode, opts.recording_start_iso
     );
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.474ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.059792ms)
  ✔ empty input is safe (0.050125ms)
  ✔ single sample → mean=value, std=0 (0.048833ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.0665ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.053375ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce NaN/

[Survived] ArithmeticOperator
traces.js:548:34
     // Decimation threshold uses the *effective* plot width — samples-per-
     // pixel density is the same regardless of partial vs full (we just have
     // fewer samples mapped into fewer pixels), so the trigger stays accurate.
-    const decimated = nVisible > effectivePlotW * DECIMATE_RATIO;
+    const decimated = nVisible > effectivePlotW / DECIMATE_RATIO;
     const stds = [];
     for (let c = 0; c < nCh; c++) {

[Survived] ConditionalExpression
traces.js:548:23
     // Decimation threshold uses the *effective* plot width — samples-per-
     // pixel density is the same regardless of partial vs full (we just have
     // fewer samples mapped into fewer pixels), so the trigger stays accurate.
-    const decimated = nVisible > effectivePlotW * DECIMATE_RATIO;
+    const decimated = false;
     const stds = [];
     for (let c = 0; c < nCh; c++) {

[Survived] ArrayDeclaration
traces.js:549:18
     // pixel density is the same regardless of partial vs full (we just have
     // fewer samples mapped into fewer pixels), so the trigger stays accurate.
     const decimated = nVisible > effectivePlotW * DECIMATE_RATIO;
-    const stds = [];
+    const stds = ["Stryker was here"];
     for (let c = 0; c < nCh; c++) {
       const data = channels[c];

[Killed] UpdateOperator
traces.js:550:30
     // fewer samples mapped into fewer pixels), so the trigger stays accurate.
     const decimated = nVisible > effectivePlotW * DECIMATE_RATIO;
     const stds = [];
-    for (let c = 0; c < nCh; c++) {
+    for (let c = 0; c < nCh; c--) {
       const data = channels[c];
       const isBad = badMask ? badMask[c] === true : false;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.484916ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.067416ms)
  ✔ empty input is safe (0.055083ms)
  ✔ single sample → mean=value, std=0 (0.055ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.076542ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.061542ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce Na

[Killed] EqualityOperator
traces.js:550:21
     // fewer samples mapped into fewer pixels), so the trigger stays accurate.
     const decimated = nVisible > effectivePlotW * DECIMATE_RATIO;
     const stds = [];
-    for (let c = 0; c < nCh; c++) {
+    for (let c = 0; c <= nCh; c++) {
       const data = channels[c];
       const isBad = badMask ? badMask[c] === true : false;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.484417ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.062667ms)
  ✔ empty input is safe (0.049541ms)
  ✔ single sample → mean=value, std=0 (0.050667ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.074ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.057042ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce Na

[Killed] BooleanLiteral
traces.js:552:53
     const stds = [];
     for (let c = 0; c < nCh; c++) {
       const data = channels[c];
-      const isBad = badMask ? badMask[c] === true : false;
+      const isBad = badMask ? badMask[c] === true : true;
 
       const { mean, std } = meanStd(data, nVisible);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.528958ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.07275ms)
  ✔ empty input is safe (0.054875ms)
  ✔ single sample → mean=value, std=0 (0.063709ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.0565ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.055625ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce Na

[Killed] BooleanLiteral
traces.js:552:46
     const stds = [];
     for (let c = 0; c < nCh; c++) {
       const data = channels[c];
-      const isBad = badMask ? badMask[c] === true : false;
+      const isBad = badMask ? badMask[c] === false : false;
 
       const { mean, std } = meanStd(data, nVisible);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.531625ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.06875ms)
  ✔ empty input is safe (0.049208ms)

  ✔ single sample → mean=value, std=0 (0.054375ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.081625ms)

[Killed] EqualityOperator
traces.js:558:20
       stds.push(std);
       // Empty channel guard: a flat line stays at center, scale stays
       // finite, no NaN propagation.
-      const ampl = std > 0 ? std * STDDEV_FILL_FACTOR : 1;
+      const ampl = std <= 0 ? std * STDDEV_FILL_FACTOR : 1;
       const vToPx = (halfSlotPx * gain) / (ampl / 2);
 
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.476667ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.059833ms)
  ✔ empty input is safe (0.046583ms)
  ✔ single sample → mean=value, std=0 (0.0605ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.057708ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.054417ms)

[Killed] ArithmeticOperator
traces.js:558:30
       stds.push(std);
       // Empty channel guard: a flat line stays at center, scale stays
       // finite, no NaN propagation.
-      const ampl = std > 0 ? std * STDDEV_FILL_FACTOR : 1;
+      const ampl = std > 0 ? std / STDDEV_FILL_FACTOR : 1;
       const vToPx = (halfSlotPx * gain) / (ampl / 2);
 
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.478125ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.062333ms)
  ✔ empty input is safe (0.048375ms)
  ✔ single sample → mean=value, std=0 (0.050291ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.074209ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (18.7805ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] ArithmeticOperator
traces.js:559:21
       // Empty channel guard: a flat line stays at center, scale stays
       // finite, no NaN propagation.
       const ampl = std > 0 ? std * STDDEV_FILL_FACTOR : 1;
-      const vToPx = (halfSlotPx * gain) / (ampl / 2);
+      const vToPx = halfSlotPx * gain * (ampl / 2);
 
       const yCenter = plotY0 + (c + 0.5) * slotH;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.494834ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.063166ms)
  ✔ empty input is safe (0.049125ms)
  ✔ single sample → mean=value, std=0 (0.062291ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.055791ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.053291ms)

[Killed] ArithmeticOperator
traces.js:559:22
       // Empty channel guard: a flat line stays at center, scale stays
       // finite, no NaN propagation.
       const ampl = std > 0 ? std * STDDEV_FILL_FACTOR : 1;
-      const vToPx = (halfSlotPx * gain) / (ampl / 2);
+      const vToPx = (halfSlotPx / gain) / (ampl / 2);
 
       const yCenter = plotY0 + (c + 0.5) * slotH;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.512583ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.068167ms)
  ✔ empty input is safe (0.063958ms)

  ✔ single sample → mean=value, std=0 (0.052458ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.060084ms)
