[Killed] ArithmeticOperator
traces.js:561:33
       const ampl = std > 0 ? std * STDDEV_FILL_FACTOR : 1;
       const vToPx = (halfSlotPx * gain) / (ampl / 2);
 
-      const yCenter = plotY0 + (c + 0.5) * slotH;
+      const yCenter = plotY0 + (c - 0.5) * slotH;
       ctx.save();
       // Outer clip: confine traces to the plot region (no leak into
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.47175ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.058833ms)
  ✔ empty input is safe (0.062ms)
  ✔ single sample → mean=value, std=0 (0.048542ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.058334ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.053666ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce NaN

[Killed] ArithmeticOperator
traces.js:561:23
       const ampl = std > 0 ? std * STDDEV_FILL_FACTOR : 1;
       const vToPx = (halfSlotPx * gain) / (ampl / 2);
 
-      const yCenter = plotY0 + (c + 0.5) * slotH;
+      const yCenter = plotY0 - (c + 0.5) * slotH;
       ctx.save();
       // Outer clip: confine traces to the plot region (no leak into
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.495291ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.060083ms)
  ✔ empty input is safe (0.046917ms)
  ✔ single sample → mean=value, std=0 (0.064375ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.057625ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.05675ms)

[Killed] BlockStatement
traces.js:574:18
       ctx.rect(plotX0, plotY0, plotW, plotH);
       ctx.clip();
 
-      if (isBad) {
-        ctx.fillStyle = BAD_SLOT_COLOR;
-        ctx.fillRect(plotX0, plotY0 + c * slotH, plotW, slotH);
-      }
+      if (isBad) {}
 
       const yC = yCenter + mean * vToPx;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.474917ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.060875ms)
  ✔ empty input is safe (0.060208ms)

  ✔ single sample → mean=value, std=0 (0.050292ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.057708ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.055833ms)

[Killed] ConditionalExpression
traces.js:574:11
       ctx.rect(plotX0, plotY0, plotW, plotH);
       ctx.clip();
 
-      if (isBad) {
+      if (true) {
         ctx.fillStyle = BAD_SLOT_COLOR;
         ctx.fillRect(plotX0, plotY0 + c * slotH, plotW, slotH);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.477667ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.06175ms)
  ✔ empty input is safe (0.05975ms)

  ✔ single sample → mean=value, std=0 (0.0485ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.057ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.054333ms)

[Killed] ArithmeticOperator
traces.js:576:39
 
       if (isBad) {
         ctx.fillStyle = BAD_SLOT_COLOR;
-        ctx.fillRect(plotX0, plotY0 + c * slotH, plotW, slotH);
+        ctx.fillRect(plotX0, plotY0 + c / slotH, plotW, slotH);
       }
 
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.489584ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.061833ms)
  ✔ empty input is safe (0.04775ms)
  ✔ single sample → mean=value, std=0 (0.049583ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.072459ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.05475ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce N

[Killed] ArithmeticOperator
traces.js:576:30
 
       if (isBad) {
         ctx.fillStyle = BAD_SLOT_COLOR;
-        ctx.fillRect(plotX0, plotY0 + c * slotH, plotW, slotH);
+        ctx.fillRect(plotX0, plotY0 - c * slotH, plotW, slotH);
       }
 
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.464542ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.060792ms)
  ✔ empty input is safe (0.047167ms)
  ✔ single sample → mean=value, std=0 (0.063125ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.057791ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.058125ms)

[Survived] ArithmeticOperator
traces.js:579:18
         ctx.fillRect(plotX0, plotY0 + c * slotH, plotW, slotH);
       }
 
-      const yC = yCenter + mean * vToPx;
+      const yC = yCenter - mean * vToPx;
       const typeColor = (colors && colors[c]) ? colors[c] : TRACE_COLOR;
       ctx.strokeStyle = isBad ? BAD_COLOR : typeColor;

[Survived] ArithmeticOperator
traces.js:579:28
         ctx.fillRect(plotX0, plotY0 + c * slotH, plotW, slotH);
       }
 
-      const yC = yCenter + mean * vToPx;
+      const yC = yCenter + mean / vToPx;
       const typeColor = (colors && colors[c]) ? colors[c] : TRACE_COLOR;
       ctx.strokeStyle = isBad ? BAD_COLOR : typeColor;

[Killed] ConditionalExpression
traces.js:580:26
       }
 
       const yC = yCenter + mean * vToPx;
-      const typeColor = (colors && colors[c]) ? colors[c] : TRACE_COLOR;
+      const typeColor = (true) ? colors[c] : TRACE_COLOR;
       ctx.strokeStyle = isBad ? BAD_COLOR : typeColor;
       ctx.lineWidth = isBad ? TRACE_WIDTH_BAD : TRACE_WIDTH_DEFAULT;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.4845ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.059709ms)
  ✔ empty input is safe (0.048292ms)
  ✔ single sample → mean=value, std=0 (0.048ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.072625ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.054875ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce NaN/

[Killed] ConditionalExpression
traces.js:580:26
       }
 
       const yC = yCenter + mean * vToPx;
-      const typeColor = (colors && colors[c]) ? colors[c] : TRACE_COLOR;
+      const typeColor = (false) ? colors[c] : TRACE_COLOR;
       ctx.strokeStyle = isBad ? BAD_COLOR : typeColor;
       ctx.lineWidth = isBad ? TRACE_WIDTH_BAD : TRACE_WIDTH_DEFAULT;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.504417ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.06825ms)
  ✔ empty input is safe (0.0485ms)
  ✔ single sample → mean=value, std=0 (0.049333ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.075166ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.058333ms)

[Killed] LogicalOperator
traces.js:586:21
       // Dash pattern by channel type — redundant encoding for
       // grayscale-safe distinction (color alone collapses to mid-grey
       // when desaturated).
-      const type = (types && types[c] || '').toUpperCase();
+      const type = (types && types[c] && '').toUpperCase();
       ctx.setLineDash(TYPE_DASH[type] || []);
       if (decimated) {
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (7.506458ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.097959ms)
  ✔ empty input is safe (0.059459ms)
  ✔ single sample → mean=value, std=0 (0.053334ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.075833ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.056209ms)

[Killed] LogicalOperator
traces.js:586:21
       // Dash pattern by channel type — redundant encoding for
       // grayscale-safe distinction (color alone collapses to mid-grey
       // when desaturated).
-      const type = (types && types[c] || '').toUpperCase();
+      const type = (types || types[c] || '').toUpperCase();
       ctx.setLineDash(TYPE_DASH[type] || []);
       if (decimated) {
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.465958ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.063875ms)
  ✔ empty input is safe (0.046458ms)
  ✔ single sample → mean=value, std=0 (0.050625ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.070541ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.057834ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] ConditionalExpression
traces.js:587:23
       // grayscale-safe distinction (color alone collapses to mid-grey
       // when desaturated).
       const type = (types && types[c] || '').toUpperCase();
-      ctx.setLineDash(TYPE_DASH[type] || []);
+      ctx.setLineDash(false);
       if (decimated) {
         drawChannelDecimated(ctx, data, nVisible, plotX0, effectivePlotW, yC, vToPx);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.477791ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.061084ms)
  ✔ empty input is safe (0.049541ms)
  ✔ single sample → mean=value, std=0 (0.049584ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.072083ms)

[Killed] LogicalOperator
traces.js:587:23
       // grayscale-safe distinction (color alone collapses to mid-grey
       // when desaturated).
       const type = (types && types[c] || '').toUpperCase();
-      ctx.setLineDash(TYPE_DASH[type] || []);
+      ctx.setLineDash(TYPE_DASH[type] && []);
       if (decimated) {
         drawChannelDecimated(ctx, data, nVisible, plotX0, effectivePlotW, yC, vToPx);
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.475ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.060084ms)
  ✔ empty input is safe (0.048292ms)
  ✔ single sample → mean=value, std=0 (0.049916ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.059875ms)

[Killed] BlockStatement
traces.js:588:22
       // when desaturated).
       const type = (types && types[c] || '').toUpperCase();
       ctx.setLineDash(TYPE_DASH[type] || []);
-      if (decimated) {
-        drawChannelDecimated(ctx, data, nVisible, plotX0, effectivePlotW, yC, vToPx);
-      } else {
+      if (decimated) {} else {
         drawChannelPolyline(ctx, data, nVisible, plotX0, effectivePlotW, yC, vToPx);
       }
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.49ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.064583ms)
  ✔ empty input is safe (0.065ms)

  ✔ single sample → mean=value, std=0 (0.051542ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.058625ms)

[Survived] ConditionalExpression
traces.js:588:11
       // when desaturated).
       const type = (types && types[c] || '').toUpperCase();
       ctx.setLineDash(TYPE_DASH[type] || []);
-      if (decimated) {
+      if (false) {
         drawChannelDecimated(ctx, data, nVisible, plotX0, effectivePlotW, yC, vToPx);
       } else {

[Killed] BlockStatement
traces.js:590:14
       ctx.setLineDash(TYPE_DASH[type] || []);
       if (decimated) {
         drawChannelDecimated(ctx, data, nVisible, plotX0, effectivePlotW, yC, vToPx);
-      } else {
-        drawChannelPolyline(ctx, data, nVisible, plotX0, effectivePlotW, yC, vToPx);
-      }
+      } else {}
       ctx.restore();
     }
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.473167ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.060083ms)
  ✔ empty input is safe (0.046ms)
  ✔ single sample → mean=value, std=0 (0.049791ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.0575ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.059916ms)

[Killed] EqualityOperator
traces.js:600:41
     // across visible channels as a representative amplitude — robust
     // to one or two saturated electrodes that would otherwise dominate
     // the mean.
-    const sortedStds = stds.filter(s => s > 0).sort((a, b) => a - b);
+    const sortedStds = stds.filter(s => s <= 0).sort((a, b) => a - b);
     const medianStd = sortedStds.length ? sortedStds[Math.floor(sortedStds.length / 2)] : 0;
     // slot_µV = how many µV does one slot height represent?
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.507458ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.06325ms)
  ✔ empty input is safe (0.04975ms)
  ✔ single sample → mean=value, std=0 (0.075084ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.061916ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.059833ms)

[Killed] ConditionalExpression
traces.js:600:41
     // across visible channels as a representative amplitude — robust
     // to one or two saturated electrodes that would otherwise dominate
     // the mean.
-    const sortedStds = stds.filter(s => s > 0).sort((a, b) => a - b);
+    const sortedStds = stds.filter(s => false).sort((a, b) => a - b);
     const medianStd = sortedStds.length ? sortedStds[Math.floor(sortedStds.length / 2)] : 0;
     // slot_µV = how many µV does one slot height represent?
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.558291ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.071458ms)
  ✔ empty input is safe (0.050666ms)
  ✔ single sample → mean=value, std=0 (0.069417ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.059167ms)

[Killed] ArithmeticOperator
traces.js:601:65
     // to one or two saturated electrodes that would otherwise dominate
     // the mean.
     const sortedStds = stds.filter(s => s > 0).sort((a, b) => a - b);
-    const medianStd = sortedStds.length ? sortedStds[Math.floor(sortedStds.length / 2)] : 0;
+    const medianStd = sortedStds.length ? sortedStds[Math.floor(sortedStds.length * 2)] : 0;
     // slot_µV = how many µV does one slot height represent?
     // From `vToPx = (halfSlotPx * gain) / (ampl/2)` with halfSlotPx = 0.45*slotH and ampl = 6*std:
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.476833ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.062542ms)
  ✔ empty input is safe (0.049875ms)
  ✔ single sample → mean=value, std=0 (0.051667ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.07025ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.055667ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] EqualityOperator
traces.js:605:28
     // slot_µV = how many µV does one slot height represent?
     // From `vToPx = (halfSlotPx * gain) / (ampl/2)` with halfSlotPx = 0.45*slotH and ampl = 6*std:
     //   slot_µV = slotH / vToPx = std * 6 / (gain * 0.9) ≈ 6.67 * std / gain
-    const slotMicrovolts = medianStd > 0 ? (medianStd * STDDEV_FILL_FACTOR) / (gain * 0.9) : 0;
+    const slotMicrovolts = medianStd <= 0 ? (medianStd * STDDEV_FILL_FACTOR) / (gain * 0.9) : 0;
     drawScaleBar(ctx, slotH, slotMicrovolts, plotX1, plotY0, plotH);
 
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.464459ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.061917ms)
  ✔ empty input is safe (0.047333ms)
  ✔ single sample → mean=value, std=0 (0.064916ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.060083ms)

[Killed] ConditionalExpression
traces.js:605:28
     // slot_µV = how many µV does one slot height represent?
     // From `vToPx = (halfSlotPx * gain) / (ampl/2)` with halfSlotPx = 0.45*slotH and ampl = 6*std:
     //   slot_µV = slotH / vToPx = std * 6 / (gain * 0.9) ≈ 6.67 * std / gain
-    const slotMicrovolts = medianStd > 0 ? (medianStd * STDDEV_FILL_FACTOR) / (gain * 0.9) : 0;
+    const slotMicrovolts = false ? (medianStd * STDDEV_FILL_FACTOR) / (gain * 0.9) : 0;
     drawScaleBar(ctx, slotH, slotMicrovolts, plotX1, plotY0, plotH);
 
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.458542ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.061667ms)
  ✔ empty input is safe (0.047916ms)
  ✔ single sample → mean=value, std=0 (0.050083ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.070458ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.056084ms)

[Survived] EqualityOperator
traces.js:615:9
     api.lastMaxVisibleChannels = maxVisible;
     api.lastChannelOffset = offset;
     api.lastTotalChannels = totalCh;
-    if (typeof window !== 'undefined' && window.TraceRenderer) {
+    if (typeof window === 'undefined' && window.TraceRenderer) {
       window.TraceRenderer.lastDrawnXLabels = xLabels;
       window.TraceRenderer.lastSlotMicrovolts = slotMicrovolts;

[Survived] LogicalOperator
traces.js:615:9
     api.lastMaxVisibleChannels = maxVisible;
     api.lastChannelOffset = offset;
     api.lastTotalChannels = totalCh;
-    if (typeof window !== 'undefined' && window.TraceRenderer) {
+    if (typeof window !== 'undefined' || window.TraceRenderer) {
       window.TraceRenderer.lastDrawnXLabels = xLabels;
       window.TraceRenderer.lastSlotMicrovolts = slotMicrovolts;

[Survived] ConditionalExpression
traces.js:622:9
       window.TraceRenderer.lastChannelOffset = offset;
       window.TraceRenderer.lastTotalChannels = totalCh;
     }
-    if (typeof globalThis !== 'undefined' && globalThis.TraceRenderer) {
+    if (true) {
       globalThis.TraceRenderer.lastDrawnXLabels = xLabels;
       globalThis.TraceRenderer.lastSlotMicrovolts = slotMicrovolts;

[Survived] ConditionalExpression
traces.js:622:9
       window.TraceRenderer.lastChannelOffset = offset;
       window.TraceRenderer.lastTotalChannels = totalCh;
     }
-    if (typeof globalThis !== 'undefined' && globalThis.TraceRenderer) {
+    if (true && globalThis.TraceRenderer) {
       globalThis.TraceRenderer.lastDrawnXLabels = xLabels;
       globalThis.TraceRenderer.lastSlotMicrovolts = slotMicrovolts;

[Killed] BlockStatement
traces.js:659:81
     // to pin position-to-µV mapping and tick layout against the
     // iteration-4 surviving-mutant clusters (lines 200-249 and 350-399
     // in docs/mutation-survivors-2026-05.md).
-    _computeScaleBarGeometry(slotMicrovolts, slotH, plotX1, plotY0, plotHeight) {
-      // Mirrors drawScaleBar at traces.js:217-225 (everything before ctx).
-      // Param naming: plotHeight (not plotH) only to avoid a duplicate-name
-      // SyntaxError under 'use strict'; the math matches drawScaleBar's
-      // internal `plotH` variable exactly.
-      if (!isFinite(slotMicrovolts) || slotMicrovolts <= 0) return null;
-      const targetMv = niceRound(slotMicrovolts * 0.5);
-      const px = (targetMv / slotMicrovolts) * slotH;
-      if (!isFinite(px) || px < 8) return null;
-      const x = plotX1 + 18;
-      const yBottom = plotY0 + plotHeight - 12;
-      const yTop = yBottom - px;
-      return { targetMv, px, x, yBottom, yTop };
-    },
+    _computeScaleBarGeometry(slotMicrovolts, slotH, plotX1, plotY0, plotHeight) {},
     _computeTimeAxisLayout(x0, x1, t0Sec, t1Sec, time_mode, recording_start_iso) {
       // Mirrors drawTimeAxis at traces.js:333-374 *without* ctx calls.
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.501ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.064542ms)
  ✔ empty input is safe (0.049167ms)
  ✔ single sample → mean=value, std=0 (0.051916ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.060083ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.063125ms)

[Killed] EqualityOperator
traces.js:664:40
       // Param naming: plotHeight (not plotH) only to avoid a duplicate-name
       // SyntaxError under 'use strict'; the math matches drawScaleBar's
       // internal `plotH` variable exactly.
-      if (!isFinite(slotMicrovolts) || slotMicrovolts <= 0) return null;
+      if (!isFinite(slotMicrovolts) || slotMicrovolts > 0) return null;
       const targetMv = niceRound(slotMicrovolts * 0.5);
       const px = (targetMv / slotMicrovolts) * slotH;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.473958ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.060583ms)
  ✔ empty input is safe (0.047625ms)
  ✔ single sample → mean=value, std=0 (0.051458ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.07ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.06275ms)

[Killed] BooleanLiteral
traces.js:664:11
       // Param naming: plotHeight (not plotH) only to avoid a duplicate-name
       // SyntaxError under 'use strict'; the math matches drawScaleBar's
       // internal `plotH` variable exactly.
-      if (!isFinite(slotMicrovolts) || slotMicrovolts <= 0) return null;
+      if (isFinite(slotMicrovolts) || slotMicrovolts <= 0) return null;
       const targetMv = niceRound(slotMicrovolts * 0.5);
       const px = (targetMv / slotMicrovolts) * slotH;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.481625ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.059125ms)
  ✔ empty input is safe (0.0595ms)
  ✔ single sample → mean=value, std=0 (0.04875ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.055541ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.052042ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce Na

[Killed] ArithmeticOperator
traces.js:665:34
       // SyntaxError under 'use strict'; the math matches drawScaleBar's
       // internal `plotH` variable exactly.
       if (!isFinite(slotMicrovolts) || slotMicrovolts <= 0) return null;
-      const targetMv = niceRound(slotMicrovolts * 0.5);
+      const targetMv = niceRound(slotMicrovolts / 0.5);
       const px = (targetMv / slotMicrovolts) * slotH;
       if (!isFinite(px) || px < 8) return null;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.488875ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.065666ms)
  ✔ empty input is safe (0.262542ms)
  ✔ single sample → mean=value, std=0 (0.230709ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.153459ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.152166ms)

[Killed] EqualityOperator
traces.js:667:28
       if (!isFinite(slotMicrovolts) || slotMicrovolts <= 0) return null;
       const targetMv = niceRound(slotMicrovolts * 0.5);
       const px = (targetMv / slotMicrovolts) * slotH;
-      if (!isFinite(px) || px < 8) return null;
+      if (!isFinite(px) || px >= 8) return null;
       const x = plotX1 + 18;
       const yBottom = plotY0 + plotHeight - 12;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.477375ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.063708ms)

  ✔ empty input is safe (0.047917ms)
  ✔ single sample → mean=value, std=0 (0.064792ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.066042ms)

[Killed] ConditionalExpression
traces.js:667:11
       if (!isFinite(slotMicrovolts) || slotMicrovolts <= 0) return null;
       const targetMv = niceRound(slotMicrovolts * 0.5);
       const px = (targetMv / slotMicrovolts) * slotH;
-      if (!isFinite(px) || px < 8) return null;
+      if (true) return null;
       const x = plotX1 + 18;
       const yBottom = plotY0 + plotHeight - 12;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.475875ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.060875ms)
  ✔ empty input is safe (0.050208ms)
  ✔ single sample → mean=value, std=0 (0.050042ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.075083ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.058375ms)

[Killed] ArithmeticOperator
traces.js:668:17
       const targetMv = niceRound(slotMicrovolts * 0.5);
       const px = (targetMv / slotMicrovolts) * slotH;
       if (!isFinite(px) || px < 8) return null;
-      const x = plotX1 + 18;
+      const x = plotX1 - 18;
       const yBottom = plotY0 + plotHeight - 12;
       const yTop = yBottom - px;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.4825ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.067584ms)
  ✔ empty input is safe (0.060917ms)

  ✔ single sample → mean=value, std=0 (0.052ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.05875ms)

[Killed] ArithmeticOperator
traces.js:669:23
       const px = (targetMv / slotMicrovolts) * slotH;
       if (!isFinite(px) || px < 8) return null;
       const x = plotX1 + 18;
-      const yBottom = plotY0 + plotHeight - 12;
+      const yBottom = plotY0 - plotHeight - 12;
       const yTop = yBottom - px;
       return { targetMv, px, x, yBottom, yTop };
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.465917ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.058417ms)
  ✔ empty input is safe (0.047417ms)
  ✔ single sample → mean=value, std=0 (0.06ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.061042ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.055542ms)

[Killed] ArithmeticOperator
traces.js:669:23
       const px = (targetMv / slotMicrovolts) * slotH;
       if (!isFinite(px) || px < 8) return null;
       const x = plotX1 + 18;
-      const yBottom = plotY0 + plotHeight - 12;
+      const yBottom = plotY0 + plotHeight + 12;
       const yTop = yBottom - px;
       return { targetMv, px, x, yBottom, yTop };
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.481625ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.062959ms)
  ✔ empty input is safe (0.062291ms)
  ✔ single sample → mean=value, std=0 (0.049375ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.0585ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.057584ms)

[Killed] ArithmeticOperator
traces.js:670:20
       if (!isFinite(px) || px < 8) return null;
       const x = plotX1 + 18;
       const yBottom = plotY0 + plotHeight - 12;
-      const yTop = yBottom - px;
+      const yTop = yBottom + px;
       return { targetMv, px, x, yBottom, yTop };
     },
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.471291ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.065792ms)
  ✔ empty input is safe (0.058ms)
  ✔ single sample → mean=value, std=0 (0.047792ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.059167ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.054959ms)

[Killed] ArithmeticOperator
traces.js:680:20
       // matches the implementation exactly so the layout shim is the
       // ground truth for tests.
       const { ticks, step, useClock } = computeTimeTicks(t0Sec, t1Sec, time_mode, recording_start_iso);
-      const span = t1Sec - t0Sec;
+      const span = t1Sec + t0Sec;
       if (span <= 0) return { major: [], minor: [], useClock, step };
       const major = ticks.map(({ t, label }) => ({
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.601ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.092958ms)
  ✔ empty input is safe (0.062459ms)
  ✔ single sample → mean=value, std=0 (0.065875ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.069125ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.061833ms)

[Killed] ConditionalExpression
traces.js:681:11
       // ground truth for tests.
       const { ticks, step, useClock } = computeTimeTicks(t0Sec, t1Sec, time_mode, recording_start_iso);
       const span = t1Sec - t0Sec;
-      if (span <= 0) return { major: [], minor: [], useClock, step };
+      if (false) return { major: [], minor: [], useClock, step };
       const major = ticks.map(({ t, label }) => ({
         t,
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (1.3245ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.172417ms)
  ✔ empty input is safe (0.069125ms)
  ✔ single sample → mean=value, std=0 (0.080542ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.067459ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.060125ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce N

[Killed] ConditionalExpression
traces.js:681:11
       // ground truth for tests.
       const { ticks, step, useClock } = computeTimeTicks(t0Sec, t1Sec, time_mode, recording_start_iso);
       const span = t1Sec - t0Sec;
-      if (span <= 0) return { major: [], minor: [], useClock, step };
+      if (true) return { major: [], minor: [], useClock, step };
       const major = ticks.map(({ t, label }) => ({
         t,
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.478708ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.065208ms)

  ✔ empty input is safe (0.050916ms)

  ✔ single sample → mean=value, std=0 (0.0625ms)

[Killed] ArrowFunction
traces.js:682:31
       const { ticks, step, useClock } = computeTimeTicks(t0Sec, t1Sec, time_mode, recording_start_iso);
       const span = t1Sec - t0Sec;
       if (span <= 0) return { major: [], minor: [], useClock, step };
-      const major = ticks.map(({ t, label }) => ({
-        t,
-        label,
-        x: x0 + ((t - t0Sec) / span) * (x1 - x0),
-      }));
+      const major = ticks.map(() => undefined);
       const minorStep = step / 5;
       const firstMinor = Math.ceil(t0Sec / minorStep) * minorStep;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.470167ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.099125ms)
  ✔ empty input is safe (0.053208ms)
  ✔ single sample → mean=value, std=0 (0.064333ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.061042ms)

  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.058625ms)

[Killed] ArithmeticOperator
traces.js:685:18
       const major = ticks.map(({ t, label }) => ({
         t,
         label,
-        x: x0 + ((t - t0Sec) / span) * (x1 - x0),
+        x: x0 + ((t - t0Sec) * span) * (x1 - x0),
       }));
       const minorStep = step / 5;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.482541ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.065416ms)

  ✔ empty input is safe (0.0495ms)
  ✔ single sample → mean=value, std=0 (0.068ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.060292ms)
