[Killed] ArithmeticOperator
traces.js:685:41
       const major = ticks.map(({ t, label }) => ({
         t,
         label,
-        x: x0 + ((t - t0Sec) / span) * (x1 - x0),
+        x: x0 + ((t - t0Sec) / span) * (x1 + x0),
       }));
       const minorStep = step / 5;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.520166ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.067209ms)
  ✔ empty input is safe (0.053667ms)
  ✔ single sample → mean=value, std=0 (0.064208ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.058625ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.056166ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Killed] ArithmeticOperator
traces.js:687:25
         label,
         x: x0 + ((t - t0Sec) / span) * (x1 - x0),
       }));
-      const minorStep = step / 5;
+      const minorStep = step * 5;
       const firstMinor = Math.ceil(t0Sec / minorStep) * minorStep;
       const minor = [];
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.4705ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.062291ms)
  ✔ empty input is safe (0.04725ms)
  ✔ single sample → mean=value, std=0 (0.050375ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.070875ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.059958ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce Na

[Killed] BlockStatement
traces.js:690:67
       const minorStep = step / 5;
       const firstMinor = Math.ceil(t0Sec / minorStep) * minorStep;
       const minor = [];
-      for (let t = firstMinor; t <= t1Sec + 1e-9; t += minorStep) {
-        const r = t / step;
-        if (Math.abs(r - Math.round(r)) < 1e-6) continue;
-        minor.push({
-          t,
-          x: x0 + ((t - t0Sec) / span) * (x1 - x0),
-        });
-      }
+      for (let t = firstMinor; t <= t1Sec + 1e-9; t += minorStep) {}
       return { major, minor, useClock, step };
     },
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.472042ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.058584ms)
  ✔ empty input is safe (0.047625ms)

  ✔ single sample → mean=value, std=0 (0.048375ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.058ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.052958ms)

[Killed] ConditionalExpression
traces.js:690:32
       const minorStep = step / 5;
       const firstMinor = Math.ceil(t0Sec / minorStep) * minorStep;
       const minor = [];
-      for (let t = firstMinor; t <= t1Sec + 1e-9; t += minorStep) {
+      for (let t = firstMinor; false; t += minorStep) {
         const r = t / step;
         if (Math.abs(r - Math.round(r)) < 1e-6) continue;
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.502375ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.063375ms)
  ✔ empty input is safe (0.051792ms)
  ✔ single sample → mean=value, std=0 (0.064542ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.093167ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.058833ms)
  ✔ extreme dynamic range (1e-10 to 1e10) does not produce

[Survived] ArithmeticOperator
traces.js:691:19
       const firstMinor = Math.ceil(t0Sec / minorStep) * minorStep;
       const minor = [];
       for (let t = firstMinor; t <= t1Sec + 1e-9; t += minorStep) {
-        const r = t / step;
+        const r = t * step;
         if (Math.abs(r - Math.round(r)) < 1e-6) continue;
         minor.push({

[Killed] ArithmeticOperator
traces.js:692:22
       const minor = [];
       for (let t = firstMinor; t <= t1Sec + 1e-9; t += minorStep) {
         const r = t / step;
-        if (Math.abs(r - Math.round(r)) < 1e-6) continue;
+        if (Math.abs(r + Math.round(r)) < 1e-6) continue;
         minor.push({
           t,
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.490625ms)
  ✔ ±1 alternating → mean≈0, std≈1 (0.064583ms)

  ✔ empty input is safe (0.050084ms)
  ✔ single sample → mean=value, std=0 (0.05075ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.068875ms)

[Killed] ConditionalExpression
traces.js:692:13
       const minor = [];
       for (let t = firstMinor; t <= t1Sec + 1e-9; t += minorStep) {
         const r = t / step;
-        if (Math.abs(r - Math.round(r)) < 1e-6) continue;
+        if (true) continue;
         minor.push({
           t,
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.49775ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.059834ms)
  ✔ empty input is safe (0.048792ms)
  ✔ single sample → mean=value, std=0 (0.0525ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.079166ms)
  ✔ mixed NaN/finite: n covers only finite-prefix in array (0.061209ms)

[Killed] ArithmeticOperator
traces.js:695:43
         if (Math.abs(r - Math.round(r)) < 1e-6) continue;
         minor.push({
           t,
-          x: x0 + ((t - t0Sec) / span) * (x1 - x0),
+          x: x0 + ((t - t0Sec) / span) * (x1 + x0),
         });
       }
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.494083ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.063333ms)
  ✔ empty input is safe (0.048875ms)
  ✔ single sample → mean=value, std=0 (0.051792ms)
  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.073666ms)

[Killed] ArithmeticOperator
traces.js:695:14
         if (Math.abs(r - Math.round(r)) < 1e-6) continue;
         minor.push({
           t,
-          x: x0 + ((t - t0Sec) / span) * (x1 - x0),
+          x: x0 - (t - t0Sec) / span * (x1 - x0),
         });
       }
killedBy: All tests
statusReason: ▶ meanStd
  ✔ constant series → mean=value, std=0 (0.502959ms)

  ✔ ±1 alternating → mean≈0, std≈1 (0.271791ms)
  ✔ empty input is safe (0.131292ms)
  ✔ single sample → mean=value, std=0 (0.082375ms)

  ✔ all-NaN input propagates NaN cleanly (does not throw) (0.072458ms)

[Survived] ConditionalExpression
traces.js:706:7
     lastChannelOffset: 0,
     lastTotalChannels: 0,
   };
-  if (typeof window !== 'undefined') window.TraceRenderer = api;
+  if (true) window.TraceRenderer = api;
   if (typeof module !== 'undefined' && module.exports) module.exports = api;
   if (typeof globalThis !== 'undefined') globalThis.TraceRenderer = api;

[Survived] EqualityOperator
traces.js:706:7
     lastChannelOffset: 0,
     lastTotalChannels: 0,
   };
-  if (typeof window !== 'undefined') window.TraceRenderer = api;
+  if (typeof window === 'undefined') window.TraceRenderer = api;
   if (typeof module !== 'undefined' && module.exports) module.exports = api;
   if (typeof globalThis !== 'undefined') globalThis.TraceRenderer = api;

[Killed] ConditionalExpression
traces.js:707:7
     lastTotalChannels: 0,
   };
   if (typeof window !== 'undefined') window.TraceRenderer = api;
-  if (typeof module !== 'undefined' && module.exports) module.exports = api;
+  if (false) module.exports = api;
   if (typeof globalThis !== 'undefined') globalThis.TraceRenderer = api;
 })();
killedBy: All tests
statusReason: ▶ meanStd
  ✖ constant series → mean=value, std=0 (0.482833ms)

  ✖ ±1 alternating → mean≈0, std≈1 (0.054958ms)

  ✖ empty input is safe (0.045792ms)
  ✖ single sample → mean=value, std=0 (0.047208ms)

[Killed] EqualityOperator
traces.js:707:7
     lastTotalChannels: 0,
   };
   if (typeof window !== 'undefined') window.TraceRenderer = api;
-  if (typeof module !== 'undefined' && module.exports) module.exports = api;
+  if (typeof module === 'undefined' && module.exports) module.exports = api;
   if (typeof globalThis !== 'undefined') globalThis.TraceRenderer = api;
 })();
killedBy: All tests
statusReason: ▶ meanStd
  ✖ constant series → mean=value, std=0 (0.487958ms)
  ✖ ±1 alternating → mean≈0, std≈1 (0.05675ms)
  ✖ empty input is safe (0.043667ms)
  ✖ single sample → mean=value, std=0 (0.046833ms)
  ✖ all-NaN input propagates NaN cleanly (does not throw) (0.3135ms)
  ✖ mixed NaN/finite: n covers only finite-prefix in array (0.049958ms)
  ✖ extreme dynamic range (1e-10 to 1e10) does not produce Na

[Survived] ConditionalExpression
traces.js:708:7
   };
   if (typeof window !== 'undefined') window.TraceRenderer = api;
   if (typeof module !== 'undefined' && module.exports) module.exports = api;
-  if (typeof globalThis !== 'undefined') globalThis.TraceRenderer = api;
+  if (false) globalThis.TraceRenderer = api;
 })();
 

[Survived] EqualityOperator
traces.js:708:7
   };
   if (typeof window !== 'undefined') window.TraceRenderer = api;
   if (typeof module !== 'undefined' && module.exports) module.exports = api;
-  if (typeof globalThis !== 'undefined') globalThis.TraceRenderer = api;
+  if (typeof globalThis === 'undefined') globalThis.TraceRenderer = api;
 })();
 
